espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** EMAC_MACCONFIGURATION_REG register
 *  This is the operation mode register for the MAC
 */
#define EMAC_MACCONFIGURATION_REG (DR_REG_EMAC_BASE + 0x0)
/** EMAC_PRELEN : R/W; bitpos: [1:0]; default: 0;
 *  Preamble Length for Transmit frames These bits control the number of preamble bytes
 *  that are added to the beginning of every Transmit frame The preamble reduction
 *  occurs only when the MAC is operating in the fullduplex mode 2'b00: 7 bytes of
 *  preamble 2'b01: 5 bytes of preamble 2'b10: 3 bytes of preamble 2'b11: Reserved
 */
#define EMAC_PRELEN    0x00000003U
#define EMAC_PRELEN_M  (EMAC_PRELEN_V << EMAC_PRELEN_S)
#define EMAC_PRELEN_V  0x00000003U
#define EMAC_PRELEN_S  0
/** EMAC_RE : R/W; bitpos: [2]; default: 0;
 *  Receiver Enable When this bit is set, the receiver state machine of the MAC is
 *  enabled for receiving frames from the GMII or MII When this bit is reset, the MAC
 *  receive state machine is disabled after the completion of the reception of the
 *  current frame, and does not receive any further frames from the GMII or MII
 */
#define EMAC_RE    (BIT(2))
#define EMAC_RE_M  (EMAC_RE_V << EMAC_RE_S)
#define EMAC_RE_V  0x00000001U
#define EMAC_RE_S  2
/** EMAC_TE : R/W; bitpos: [3]; default: 0;
 *  Transmitter Enable When this bit is set, the transmit state machine of the MAC is
 *  enabled for transmission on the GMII or MII When this bit is reset, the MAC
 *  transmit state machine is disabled after the completion of the transmission of the
 *  current frame, and does not transmit any further frames
 */
#define EMAC_TE    (BIT(3))
#define EMAC_TE_M  (EMAC_TE_V << EMAC_TE_S)
#define EMAC_TE_V  0x00000001U
#define EMAC_TE_S  3
/** EMAC_DC : R/W; bitpos: [4]; default: 0;
 *  Deferral Check When this bit is set, the deferral check function is enabled in the
 *  MAC The MAC issues a Frame Abort status, along with the excessive deferral error
 *  bit set in the transmit frame status, when the transmit state machine is deferred
 *  for more than 24,288 bit times in the 10 or 100 Mbps mode If the MAC is configured
 *  for 1000 Mbps operation or if the Jumbo frame mode is enabled in the 10 or 100 Mbps
 *  mode, the threshold for deferral is 155,680 bits times Deferral begins when the
 *  transmitter is ready to transmit, but it is prevented because of an active carrier
 *  sense signal _CRS_ on GMII or MII The defer time is not cumulative For example, if
 *  the transmitter defers for 10,000 bit times because the CRS signal is active and
 *  then the CRS signal becomes inactive, the transmitter transmits and collision
 *  happens Because of collision, the transmitter needs to back off and then defer
 *  again after back off completion In such a scenario, the deferral timer is reset to
 *  0 and it is restarted When this bit is reset, the deferral check function is
 *  disabled and the MAC defers until the CRS signal goes inactive This bit is
 *  applicable only in the halfduplex mode and is reserved _RO_ in the fullduplexonly
 *  configuration
 */
#define EMAC_DC    (BIT(4))
#define EMAC_DC_M  (EMAC_DC_V << EMAC_DC_S)
#define EMAC_DC_V  0x00000001U
#define EMAC_DC_S  4
/** EMAC_BL : R/W; bitpos: [6:5]; default: 0;
 *  BackOff Limit The BackOff limit determines the random integer number _r_ of slot
 *  time delays _4,096 bit times for 1000 Mbps and 512 bit times for 10/100 Mbps_ for
 *  which the MAC waits before rescheduling a transmission attempt during retries after
 *  a collision This bit is applicable only in the halfduplex mode and is reserved _RO_
 *  in the fullduplexonly configuration 00: k= min _n, 10_ 01: k = min _n, 8_ 10: k =
 *  min _n, 4_ 11: k = min _n, 1_ where n = retransmission attempt The random integer r
 *  takes the value in the range 0 ≤ r < 2k
 */
#define EMAC_BL    0x00000003U
#define EMAC_BL_M  (EMAC_BL_V << EMAC_BL_S)
#define EMAC_BL_V  0x00000003U
#define EMAC_BL_S  5
/** EMAC_ACS : R/W; bitpos: [7]; default: 0;
 *  Automatic Pad or CRC Stripping When this bit is set, the MAC strips the Pad or FCS
 *  field on the incoming frames only if the value of the length field is less than
 *  1,536 bytes All received frames with length field greater than or equal to 1,536
 *  bytes are passed to the application without stripping the Pad or FCS field When
 *  this bit is reset, the MAC passes all incoming frames, without modifying them, to
 *  the Host Note: For information about how the settings of Bit 25 _CST_ and this bit
 *  impact the frame length, see Table 632
 */
#define EMAC_ACS    (BIT(7))
#define EMAC_ACS_M  (EMAC_ACS_V << EMAC_ACS_S)
#define EMAC_ACS_V  0x00000001U
#define EMAC_ACS_S  7
/** EMAC_LUD : R/W; bitpos: [8]; default: 0;
 *  Link Up or Down This bit indicates whether the link is up or down during the
 *  transmission of configuration in the RGMII, SGMII, or SMII interface: 0: Link Down
 *  1: Link Up This bit is reserved _RO with default value_ and is enabled when the
 *  RGMII, SGMII, or SMII interface is enabled during core configuration
 */
#define EMAC_LUD    (BIT(8))
#define EMAC_LUD_M  (EMAC_LUD_V << EMAC_LUD_S)
#define EMAC_LUD_V  0x00000001U
#define EMAC_LUD_S  8
/** EMAC_DR : R/W; bitpos: [9]; default: 0;
 *  Disable Retry When this bit is set, the MAC attempts only one transmission When a
 *  collision occurs on the GMII or MII interface, the MAC ignores the current frame
 *  transmission and reports a Frame Abort with excessive collision error in the
 *  transmit frame status When this bit is reset, the MAC attempts retries based on the
 *  settings of the BL field _Bits [6:5]_ This bit is applicable only in the halfduplex
 *  mode and is reserved _RO with default value_ in the fullduplexonly configuration
 */
#define EMAC_DR    (BIT(9))
#define EMAC_DR_M  (EMAC_DR_V << EMAC_DR_S)
#define EMAC_DR_V  0x00000001U
#define EMAC_DR_S  9
/** EMAC_IPC : R/W; bitpos: [10]; default: 0;
 *  Checksum Offload When this bit is set, the MAC calculates the 16bit one’s
 *  complement of the one’s complement sum of all received Ethernet frame payloads It
 *  also checks whether the IPv4 Header checksum _assumed to be bytes 2526 or 2930
 *  _VLAN tagged_ of the received Ethernet frame_ is correct for the received frame and
 *  gives the status in the receive status word The MAC also appends the 16bit checksum
 *  calculated for the IP header datagram payload _bytes after the IPv4 header_ and
 *  appends it to the Ethernet frame transferred to the application _when Type 2 COE is
 *  deselected_ When this bit is reset, this function is disabled When Type 2 COE is
 *  selected, this bit, when set, enables the IPv4 header checksum checking and IPv4 or
 *  IPv6 TCP, UDP, or ICMP payload checksum checking When this bit is reset, the COE
 *  function in the receiver is disabled and the corresponding PCE and IP HCE status
 *  bits _see Table 310 on page 138_ are always cleared If the IP Checksum Offload
 *  feature is not enabled during core configuration, this bit is reserved _RO with
 *  default value_
 */
#define EMAC_IPC    (BIT(10))
#define EMAC_IPC_M  (EMAC_IPC_V << EMAC_IPC_S)
#define EMAC_IPC_V  0x00000001U
#define EMAC_IPC_S  10
/** EMAC_DM : R/W; bitpos: [11]; default: 0;
 *  Duplex Mode When this bit is set, the MAC operates in the fullduplex mode where it
 *  can transmit and receive simultaneously This bit is RO with default value of 1'b1
 *  in the fullduplexonly configuration
 */
#define EMAC_DM    (BIT(11))
#define EMAC_DM_M  (EMAC_DM_V << EMAC_DM_S)
#define EMAC_DM_V  0x00000001U
#define EMAC_DM_S  11
/** EMAC_LM : R/W; bitpos: [12]; default: 0;
 *  Loopback Mode When this bit is set, the MAC operates in the loopback mode at GMII
 *  or MII The _G_MII Receive clock input _clk_rx_i_ is required for the loopback to
 *  work properly, because the Transmit clock is not loopedback internally
 */
#define EMAC_LM    (BIT(12))
#define EMAC_LM_M  (EMAC_LM_V << EMAC_LM_S)
#define EMAC_LM_V  0x00000001U
#define EMAC_LM_S  12
/** EMAC_DO : R/W; bitpos: [13]; default: 0;
 *  Disable Receive Own When this bit is set, the MAC disables the reception of frames
 *  when the phy_txen_o is asserted in the halfduplex mode When this bit is reset, the
 *  MAC receives all packets that are given by the PHY while transmitting This bit is
 *  not applicable if the MAC is operating in the fullduplex mode This bit is reserved
 *  _RO with default value_ if the MAC is configured for the fullduplexonly operation
 */
#define EMAC_DO    (BIT(13))
#define EMAC_DO_M  (EMAC_DO_V << EMAC_DO_S)
#define EMAC_DO_V  0x00000001U
#define EMAC_DO_S  13
/** EMAC_FES : R/W; bitpos: [14]; default: 0;
 *  Speed This bit selects the speed in the MII, RMII, SMII, RGMII, SGMII, or RevMII
 *  interface: 0: 10 Mbps 1: 100 Mbps This bit is reserved _RO_ by default and is
 *  enabled only when the parameter SPEED_SELECT = Enabled This bit generates link
 *  speed encoding when Bit 24 _TC_ is set in the RGMII, SMII, or SGMII mode This bit
 *  is always enabled for RGMII, SGMII, SMII, or RevMII interface In configurations
 *  with RGMII, SGMII, SMII, or RevMII interface, this bit is driven as an output
 *  signal _mac_speed_o[0]_ to reflect the value of this bit in the mac_speed_o signal
 *  In configurations with RMII, MII, or GMII interface, you can optionally drive this
 *  bit as an output signal _mac_speed_o[0]_ to reflect its value in the mac_speed_o
 *  signal
 */
#define EMAC_FES    (BIT(14))
#define EMAC_FES_M  (EMAC_FES_V << EMAC_FES_S)
#define EMAC_FES_V  0x00000001U
#define EMAC_FES_S  14
/** EMAC_PS : R/W; bitpos: [15]; default: 0;
 *  Port Select This bit selects the Ethernet line speed 0: For 1000 Mbps operations 1:
 *  For 10 or 100 Mbps operations In 10 or 100 Mbps operations, this bit, along with
 *  FES bit, selects the exact line speed In the 10/100 Mbpsonly _always 1_ or 1000
 *  Mbpsonly _always 0_ configurations, this bit is readonly with the appropriate value
 *  In default 10/100/1000 Mbps configuration, this bit is R_W The mac_portselect_o or
 *  mac_speed_o[1] signal reflects the value of this bit
 */
#define EMAC_PS    (BIT(15))
#define EMAC_PS_M  (EMAC_PS_V << EMAC_PS_S)
#define EMAC_PS_V  0x00000001U
#define EMAC_PS_S  15
/** EMAC_DCRS : R/W; bitpos: [16]; default: 0;
 *  Disable Carrier Sense During Transmission When set high, this bit makes the MAC
 *  transmitter ignore the _G_MII CRS signal during frame transmission in the
 *  halfduplex mode This request results in no errors generated because of Loss of
 *  Carrier or No Carrier during such transmission When this bit is low, the MAC
 *  transmitter generates such errors because of Carrier Sense and can even abort the
 *  transmissions This bit is reserved _and RO_ in the fullduplexonly configurations
 */
#define EMAC_DCRS    (BIT(16))
#define EMAC_DCRS_M  (EMAC_DCRS_V << EMAC_DCRS_S)
#define EMAC_DCRS_V  0x00000001U
#define EMAC_DCRS_S  16
/** EMAC_IFG : R/W; bitpos: [19:17]; default: 0;
 *  InterFrame Gap These bits control the minimum IFG between frames during
 *  transmission 000: 96 bit times 001: 88 bit times 010: 80 bit times  111: 40 bit
 *  times In the halfduplex mode, the minimum IFG can be configured only for 64 bit
 *  times _IFG = 100_ Lower values are not considered In the 1000Mbps mode, the minimum
 *  IFG supported is 64 bit times _and above_ in the EMACCORE configuration and 80 bit
 *  times _and above_ in other configurations When a JAM pattern is being transmitted
 *  because of backpressure activation, the MAC does not consider the minimum IFG
 */
#define EMAC_IFG    0x00000007U
#define EMAC_IFG_M  (EMAC_IFG_V << EMAC_IFG_S)
#define EMAC_IFG_V  0x00000007U
#define EMAC_IFG_S  17
/** EMAC_JE : R/W; bitpos: [20]; default: 0;
 *  Jumbo Frame Enable When this bit is set, the MAC allows Jumbo frames of 9,018 bytes
 *  _9,022 bytes for VLAN tagged frames_ without reporting a giant frame error in the
 *  receive frame status
 */
#define EMAC_JE    (BIT(20))
#define EMAC_JE_M  (EMAC_JE_V << EMAC_JE_S)
#define EMAC_JE_V  0x00000001U
#define EMAC_JE_S  20
/** EMAC_BE : R/W; bitpos: [21]; default: 0;
 *  Frame Burst Enable When this bit is set, the MAC allows frame bursting during
 *  transmission in the GMII halfduplex mode This bit is reserved _and RO_ in the
 *  10/100 Mbps only or fullduplexonly configurations
 */
#define EMAC_BE    (BIT(21))
#define EMAC_BE_M  (EMAC_BE_V << EMAC_BE_S)
#define EMAC_BE_V  0x00000001U
#define EMAC_BE_S  21
/** EMAC_JD : R/W; bitpos: [22]; default: 0;
 *  Jabber Disable When this bit is set, the MAC disables the jabber timer on the
 *  transmitter The MAC can transfer frames of up to 16,383 bytes When this bit is
 *  reset, the MAC cuts off the transmitter if the application sends out more than
 *  2,048 bytes of data _10,240 if JE is set high_ during transmission
 */
#define EMAC_JD    (BIT(22))
#define EMAC_JD_M  (EMAC_JD_V << EMAC_JD_S)
#define EMAC_JD_V  0x00000001U
#define EMAC_JD_S  22
/** EMAC_WD : R/W; bitpos: [23]; default: 0;
 *  Watchdog Disable When this bit is set, the MAC disables the watchdog timer on the
 *  receiver The MAC can receive frames of up to 16,383 bytes When this bit is reset,
 *  the MAC does not allow a receive frame which more than 2,048 bytes _10,240 if JE is
 *  set high_ or the value programmed in Register 55 _Watchdog Timeout Register_ The
 *  MAC cuts off any bytes received after the watchdog limit number of bytes
 */
#define EMAC_WD    (BIT(23))
#define EMAC_WD_M  (EMAC_WD_V << EMAC_WD_S)
#define EMAC_WD_V  0x00000001U
#define EMAC_WD_S  23
/** EMAC_TC : R/W; bitpos: [24]; default: 0;
 *  Transmit Configuration in RGMII, SGMII, or SMII When set, this bit enables the
 *  transmission of duplex mode, link speed, and link up or down information to the PHY
 *  in the RGMII, SMII, or SGMII port When this bit is reset, no such information is
 *  driven to the PHY This bit is reserved _and RO_ if the RGMII, SMII, or SGMII PHY
 *  port is not selected during core configuration The details of this feature are
 *  explained in the following sections: “Reduced Gigabit Media Independent Interface”
 *  on page 249 “Serial Media Independent Interface” on page 245 “Serial Gigabit Media
 *  Independent Interface” on page 257
 */
#define EMAC_TC    (BIT(24))
#define EMAC_TC_M  (EMAC_TC_V << EMAC_TC_S)
#define EMAC_TC_V  0x00000001U
#define EMAC_TC_S  24
/** EMAC_CST : R/W; bitpos: [25]; default: 0;
 *  CRC Stripping for Type Frames When this bit is set, the last 4 bytes _FCS_ of all
 *  frames of Ether type _Length/Type field greater than or equal to 1,536_ are
 *  stripped and dropped before forwarding the frame to the application This function
 *  is not valid when the IP Checksum Engine _Type 1_ is enabled in the MAC receiver
 *  This function is valid when Type 2 Checksum Offload Engine is enabled Note: For
 *  information about how the settings of Bit 7 _ACS_ and this bit impact the frame
 *  length, see Table 632
 */
#define EMAC_CST    (BIT(25))
#define EMAC_CST_M  (EMAC_CST_V << EMAC_CST_S)
#define EMAC_CST_V  0x00000001U
#define EMAC_CST_S  25
/** EMAC_SFTERR : R/W; bitpos: [26]; default: 0;
 *  SMII Force Transmit Error When set, this bit indicates to the PHY to force a
 *  transmit error in the SMII frame being transmitted This bit is reserved if the SMII
 *  PHY port is not selected during core configuration
 */
#define EMAC_SFTERR    (BIT(26))
#define EMAC_SFTERR_M  (EMAC_SFTERR_V << EMAC_SFTERR_S)
#define EMAC_SFTERR_V  0x00000001U
#define EMAC_SFTERR_S  26
/** EMAC_TWOKPE : R/W; bitpos: [27]; default: 0;
 *  IEEE 8023as Support for 2K Packets When set, the MAC considers all frames, with up
 *  to 2,000 bytes length, as normal packets When Bit 20 _JE_ is not set, the MAC
 *  considers all received frames of size more than 2K bytes as Giant frames When this
 *  bit is reset and Bit 20 _JE_ is not set, the MAC considers all received frames of
 *  size more than 1,518 bytes _1,522 bytes for tagged_ as Giant frames When Bit 20 is
 *  set, setting this bit has no effect on Giant Frame status For more information
 *  about how the setting of this bit and Bit 20 impact the Giant frame status, see
 *  Table 631
 */
#define EMAC_TWOKPE    (BIT(27))
#define EMAC_TWOKPE_M  (EMAC_TWOKPE_V << EMAC_TWOKPE_S)
#define EMAC_TWOKPE_V  0x00000001U
#define EMAC_TWOKPE_S  27
/** EMAC_SARC : R/W; bitpos: [30:28]; default: 0;
 *  Source Address Insertion or Replacement Control This field controls the source
 *  address insertion or replacement for all transmitted frames Bit 30 specifies which
 *  MAC Address register _0 or 1_ is used for source address insertion or replacement
 *  based on the values of Bits [29:28]: 2'b0x: The input signals mti_sa_ctrl_i and
 *  ati_sa_ctrl_i control the SA field generation 2'b10: 	If Bit 30 is set to 0, the
 *  MAC inserts the content of the MAC Address 0 registers _registers 16 and 17_ in the
 *  SA field of all transmitted frames 	If Bit 30 is set to 1 and the Enable MAC
 *  Address Register 1 option is selected during core configuration, the MAC inserts
 *  the content of the MAC Address 1 registers _registers 18 and 19_ in the SA field of
 *  all transmitted frames 2'b11: 	If Bit 30 is set to 0, the MAC replaces the content
 *  of the MAC Address 0 registers _registers 16 and 17_ in the SA field of all
 *  transmitted frames 	If Bit 30 is set to 1 and the Enable MAC Address Register 1
 *  option is selected during core configuration, the MAC replaces the content of the
 *  MAC Address 1 registers _registers 18 and 19_ in the SA field of all transmitted
 *  frames Note: Changes to this field take effect only on the start of a frame If you
 *  write this register field when a frame is being transmitted, only the subsequent
 *  frame can use the updated value, that is, the current frame does not use the
 *  updated value These bits are reserved and RO when the Enable SA, VLAN, and CRC
 *  Insertion on TX feature is not selected during core configuration
 */
#define EMAC_SARC    0x00000007U
#define EMAC_SARC_M  (EMAC_SARC_V << EMAC_SARC_S)
#define EMAC_SARC_V  0x00000007U
#define EMAC_SARC_S  28

