espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_MACFRAMEFILTER_REG register
 *  Contains the frame filtering controls
 */
#define EMAC_MACFRAMEFILTER_REG (DR_REG_EMAC_BASE + 0x4)
/** EMAC_PROMISCUOUS_MODE : R/W; bitpos: [0]; default: 0;
 *  Promiscuous Mode When this bit is set, the Address Filter module passes all
 *  incoming frames irrespective of the destination or source address The SA or DA
 *  Filter Fails status bits of the Receive Status Word are always cleared when PR is
 *  set
 */
#define EMAC_PROMISCUOUS_MODE    (BIT(0))
#define EMAC_PROMISCUOUS_MODE_M  (EMAC_PROMISCUOUS_MODE_V << EMAC_PROMISCUOUS_MODE_S)
#define EMAC_PROMISCUOUS_MODE_V  0x00000001U
#define EMAC_PROMISCUOUS_MODE_S  0
/** EMAC_HUC : R/W; bitpos: [1]; default: 0;
 *  Hash Unicast When set, the MAC performs destination address filtering of unicast
 *  frames according to the hash table When reset, the MAC performs a perfect
 *  destination address filtering for unicast frames, that is, it compares the DA field
 *  with the values programmed in DA registers If Hash Filter is not selected during
 *  core configuration, this bit is reserved _and RO_
 */
#define EMAC_HUC    (BIT(1))
#define EMAC_HUC_M  (EMAC_HUC_V << EMAC_HUC_S)
#define EMAC_HUC_V  0x00000001U
#define EMAC_HUC_S  1
/** EMAC_HMC : R/W; bitpos: [2]; default: 0;
 *  Hash Multicast When set, the MAC performs destination address filtering of received
 *  multicast frames according to the hash table When reset, the MAC performs a perfect
 *  destination address filtering for multicast frames, that is, it compares the DA
 *  field with the values programmed in DA registers If Hash Filter is not selected
 *  during core configuration, this bit is reserved _and RO_
 */
#define EMAC_HMC    (BIT(2))
#define EMAC_HMC_M  (EMAC_HMC_V << EMAC_HMC_S)
#define EMAC_HMC_V  0x00000001U
#define EMAC_HMC_S  2
/** EMAC_DAIF : R/W; bitpos: [3]; default: 0;
 *  DA Inverse Filtering When this bit is set, the Address Check block operates in
 *  inverse filtering mode for the DA address comparison for both unicast and multicast
 *  frames When reset, normal filtering of frames is performed
 */
#define EMAC_DAIF    (BIT(3))
#define EMAC_DAIF_M  (EMAC_DAIF_V << EMAC_DAIF_S)
#define EMAC_DAIF_V  0x00000001U
#define EMAC_DAIF_S  3
/** EMAC_PM : R/W; bitpos: [4]; default: 0;
 *  Pass All Multicast When set, this bit indicates that all received frames with a
 *  multicast destination address _first bit in the destination address field is '1'_
 *  are passed When reset, filtering of multicast frame depends on HMC bit
 */
#define EMAC_PM    (BIT(4))
#define EMAC_PM_M  (EMAC_PM_V << EMAC_PM_S)
#define EMAC_PM_V  0x00000001U
#define EMAC_PM_S  4
/** EMAC_DBF : R/W; bitpos: [5]; default: 0;
 *  Disable Broadcast Frames When this bit is set, the AFM module blocks all incoming
 *  broadcast frames In addition, it overrides all other filter settings When this bit
 *  is reset, the AFM module passes all received broadcast frames
 */
#define EMAC_DBF    (BIT(5))
#define EMAC_DBF_M  (EMAC_DBF_V << EMAC_DBF_S)
#define EMAC_DBF_V  0x00000001U
#define EMAC_DBF_S  5
/** EMAC_PCF : R/W; bitpos: [7:6]; default: 0;
 *  Pass Control Frames These bits control the forwarding of all control frames
 *  _including unicast and multicast Pause frames_ 00: MAC filters all control frames
 *  from reaching the application 01: MAC forwards all control frames except Pause
 *  frames to application even if they fail the Address filter 10: MAC forwards all
 *  control frames to application even if they fail the Address Filter 11: MAC forwards
 *  control frames that pass the Address Filter The following conditions should be true
 *  for the Pause frames processing: Condition 1 : The MAC is in the fullduplex mode
 *  and flow control is enabled by setting Bit 2 _RFE_ of Register 6 _Flow Control
 *  Register_ to 1 Condition 2 : The destination address _DA_ of the received frame
 *  matches the special multicast address or the MAC Address 0 when Bit 3 _UP_ of the
 *  Register 6 _Flow Control Register_ is set Condition 3: The Type field of the
 *  received frame is 0x8808 and the OPCODE field is 0x0001 Note: This field should be
 *  set to 01 only when the Condition 1 is true, that is, the MAC is programmed to
 *  operate in the fullduplex mode and the RFE bit is enabled Otherwise, the Pause
 *  frame filtering may be inconsistent When Condition 1 is false, the Pause frames are
 *  considered as generic control frames Therefore, to pass all control frames
 *  _including Pause frames_ when the fullduplex mode and flow control is not enabled,
 *  you should set the PCF field to 10 or 11 _as required by the application_
 */
#define EMAC_PCF    0x00000003U
#define EMAC_PCF_M  (EMAC_PCF_V << EMAC_PCF_S)
#define EMAC_PCF_V  0x00000003U
#define EMAC_PCF_S  6
/** EMAC_SAIF : R/W; bitpos: [8]; default: 0;
 *  SA Inverse Filtering When this bit is set, the Address Check block operates in
 *  inverse filtering mode for the SA address comparison The frames whose SA matches
 *  the SA registers are marked as failing the SA Address filter When this bit is
 *  reset, frames whose SA does not match the SA registers are marked as failing the SA
 *  Address filter
 */
#define EMAC_SAIF    (BIT(8))
#define EMAC_SAIF_M  (EMAC_SAIF_V << EMAC_SAIF_S)
#define EMAC_SAIF_V  0x00000001U
#define EMAC_SAIF_S  8
/** EMAC_SAF : R/W; bitpos: [9]; default: 0;
 *  Source Address Filter Enable When this bit is set, the MAC compares the SA field of
 *  the received frames with the values programmed in the enabled SA registers If the
 *  comparison fails, the MAC drops the frame When this bit is reset, the MAC forwards
 *  the received frame to the application with updated SAF bit of the Rx Status
 *  depending on the SA address comparison Note: According to the IEEE specification,
 *  Bit 47 of the SA is reserved and set to 0 However, in DWC_EMAC, the MAC compares
 *  all 48 bits The software driver should take this into consideration while
 *  programming the MAC address registers for SA
 */
#define EMAC_SAF    (BIT(9))
#define EMAC_SAF_M  (EMAC_SAF_V << EMAC_SAF_S)
#define EMAC_SAF_V  0x00000001U
#define EMAC_SAF_S  9
/** EMAC_HPF : R/W; bitpos: [10]; default: 0;
 *  Hash or Perfect Filter When this bit is set, it configures the address filter to
 *  pass a frame if it matches either the perfect filtering or the hash filtering as
 *  set by the HMC or HUC bits When this bit is low and the HUC or HMC bit is set, the
 *  frame is passed only if it matches the Hash filter This bit is reserved _and RO_ if
 *  the Hash filter is not selected during core configuration
 */
#define EMAC_HPF    (BIT(10))
#define EMAC_HPF_M  (EMAC_HPF_V << EMAC_HPF_S)
#define EMAC_HPF_V  0x00000001U
#define EMAC_HPF_S  10
/** EMAC_VTFE : R/W; bitpos: [16]; default: 0;
 *  VLAN Tag Filter Enable When set, this bit enables the MAC to drop VLAN tagged
 *  frames that do not match the VLAN Tag comparison When reset, the MAC forwards all
 *  frames irrespective of the match status of the VLAN Tag
 */
#define EMAC_VTFE    (BIT(16))
#define EMAC_VTFE_M  (EMAC_VTFE_V << EMAC_VTFE_S)
#define EMAC_VTFE_V  0x00000001U
#define EMAC_VTFE_S  16
/** EMAC_IPFE : R/W; bitpos: [20]; default: 0;
 *  Layer 3 and Layer 4 Filter Enable When set, this bit enables the MAC to drop frames
 *  that do not match the enabled Layer 3 and Layer 4 filters If Layer 3 or Layer 4
 *  filters are not enabled for matching, this bit does not have any effect When reset,
 *  the MAC forwards all frames irrespective of the match status of the Layer 3 and
 *  Layer 4 fields If the Layer 3 and Layer 4 Filtering feature is not selected during
 *  core configuration, this bit is reserved _RO with default value_
 */
#define EMAC_IPFE    (BIT(20))
#define EMAC_IPFE_M  (EMAC_IPFE_V << EMAC_IPFE_S)
#define EMAC_IPFE_V  0x00000001U
#define EMAC_IPFE_S  20
/** EMAC_DNTU : R/W; bitpos: [21]; default: 0;
 *  Drop nonTCP/UDP over IP Frames When set, this bit enables the MAC to drop the
 *  nonTCP or UDP over IP frames The MAC forward only those frames that are processed
 *  by the Layer 4 filter When reset, this bit enables the MAC to forward all nonTCP or
 *  UDP over IP frames If the Layer 3 and Layer 4 Filtering feature is not selected
 *  during core configuration, this bit is reserved _RO with default value_
 */
#define EMAC_DNTU    (BIT(21))
#define EMAC_DNTU_M  (EMAC_DNTU_V << EMAC_DNTU_S)
#define EMAC_DNTU_V  0x00000001U
#define EMAC_DNTU_S  21
/** EMAC_RA : R/W; bitpos: [31]; default: 0;
 *  Receive All When this bit is set, the MAC Receiver module passes all received
 *  frames, irrespective of whether they pass the address filter or not, to the
 *  Application The result of the SA or DA filtering is updated _pass or fail_ in the
 *  corresponding bits in the Receive Status Word When this bit is reset, the Receiver
 *  module passes only those frames to the Application that pass the SA or DA address
 *  filter
 */
#define EMAC_RA    (BIT(31))
#define EMAC_RA_M  (EMAC_RA_V << EMAC_RA_S)
#define EMAC_RA_V  0x00000001U
#define EMAC_RA_S  31

/** EMAC_HASHTABLEHIGH_REG register
 *  Contains the higher 32 bits of the Multicast Hash table This register is present
 *  only when you select the 64bit Hash filter function in coreConsultant _See Table 79_
 */
#define EMAC_HASHTABLEHIGH_REG (DR_REG_EMAC_BASE + 0x8)
/** EMAC_HTH : R/W; bitpos: [31:0]; default: 0;
 *  Hash Table High This field contains the upper 32 bits of the Hash table
 */
#define EMAC_HTH    0xFFFFFFFFU
#define EMAC_HTH_M  (EMAC_HTH_V << EMAC_HTH_S)
#define EMAC_HTH_V  0xFFFFFFFFU
#define EMAC_HTH_S  0

/** EMAC_HASHTABLELOW_REG register
 *  Contains the lower 32 bits of the Multicast Hash table This register is present
 *  only when you select the Hash filter function in coreConsultant _See Table 79_
 */
#define EMAC_HASHTABLELOW_REG (DR_REG_EMAC_BASE + 0xc)
/** EMAC_HTL : R/W; bitpos: [31:0]; default: 0;
 *  Hash Table Low This field contains the lower 32 bits of the Hash table
 */
#define EMAC_HTL    0xFFFFFFFFU
#define EMAC_HTL_M  (EMAC_HTL_V << EMAC_HTL_S)
#define EMAC_HTL_V  0xFFFFFFFFU
#define EMAC_HTL_S  0

/** EMAC_GMIIADDRESS_REG register
 *  Controls the management cycles to an external PHY This register is present only
 *  when you select the Station Management _MDIO_ feature in coreConsultant _See Table
 *  726_
 */
#define EMAC_GMIIADDRESS_REG (DR_REG_EMAC_BASE + 0x10)
/** EMAC_GB : R/W1S; bitpos: [0]; default: 0;
 *  GMII Busy This bit should read logic 0 before writing to Register 4 and Register 5
 *  During a PHY or RevMII register access, the software sets this bit to 1’b1 to
 *  indicate that a Read or Write access is in progress Register 5 is invalid until
 *  this bit is cleared by the MAC Therefore, Register 5 _GMII Data_ should be kept
 *  valid until the MAC clears this bit during a PHY Write operation Similarly for a
 *  read operation, the contents of Register 5 are not valid until this bit is cleared
 *  The subsequent read or write operation should happen only after the previous
 *  operation is complete Because there is no acknowledgment from the PHY to MAC after
 *  a read or write operation is completed, there is no change in the functionality of
 *  this bit even when the PHY is not present
 */
#define EMAC_GB    (BIT(0))
#define EMAC_GB_M  (EMAC_GB_V << EMAC_GB_S)
#define EMAC_GB_V  0x00000001U
#define EMAC_GB_S  0
/** EMAC_GW : R/W; bitpos: [1]; default: 0;
 *  GMII Write When set, this bit indicates to the PHY or RevMII that this is a Write
 *  operation using the GMII Data register If this bit is not set, it indicates that
 *  this is a Read operation, that is, placing the data in the GMII Data register
 */
#define EMAC_GW    (BIT(1))
#define EMAC_GW_M  (EMAC_GW_V << EMAC_GW_S)
#define EMAC_GW_V  0x00000001U
#define EMAC_GW_S  1
/** EMAC_CR : R/W; bitpos: [5:2]; default: 0;
 *  CSR Clock Range The CSR Clock Range selection determines the frequency of the MDC
 *  clock according to the CSR clock frequency used in your design The CSR clock
 *  corresponding to different EMAC configurations is given in Table 92 on page 564 The
 *  suggested range of CSR clock frequency applicable for each value _when Bit[5] = 0_
 *  ensures that the MDC clock is approximately between the frequency range 10 MHz25
 *  MHz 0000: The CSR clock frequency is 60100 MHz and the MDC clock frequency is CSR
 *  clock/42 0001: The CSR clock frequency is 100150 MHz and the MDC clock frequency is
 *  CSR clock/62 0010: The CSR clock frequency is 2035 MHz and the MDC clock frequency
 *  is CSR clock/16 0011: The CSR clock frequency is 3560 MHz and the MDC clock
 *  frequency is CSR clock/26 0100: The CSR clock frequency is 150250 MHz and the MDC
 *  clock frequency is CSR clock/102 0101: The CSR clock frequency is 250300 MHz and
 *  the MDC clock is CSR clock/124 0110, 0111: Reserved When Bit 5 is set, you can
 *  achieve higher frequency of the MDC clock than the frequency limit of 25 MHz
 *  _specified in the IEEE Std 8023_ and program a clock divider of lower value For
 *  example, when CSR clock is of 100 MHz frequency and you program these bits as 1010,
 *  then the resultant MDC clock is of 125 MHz which is outside the limit of IEEE 8023
 *  specified range Program the following values only if the interfacing chips support
 *  faster MDC clocks 1000: CSR clock/4 1001: CSR clock/6 1010: CSR clock/8 1011: CSR
 *  clock/10 1100: CSR clock/12 1101: CSR clock/14 1110: CSR clock/16 1111: CSR
 *  clock/18 These bits are not used for accessing RevMII These bits are readonly if
 *  the RevMII interface is selected as single PHY interface
 */
#define EMAC_CR    0x0000000FU
#define EMAC_CR_M  (EMAC_CR_V << EMAC_CR_S)
#define EMAC_CR_V  0x0000000FU
#define EMAC_CR_S  2
/** EMAC_GR : R/W; bitpos: [10:6]; default: 0;
 *  GMII Register These bits select the desired GMII register in the selected PHY
 *  device For RevMII, these bits select the desired CSR register in the RevMII
 *  Registers set
 */
#define EMAC_GR    0x0000001FU
#define EMAC_GR_M  (EMAC_GR_V << EMAC_GR_S)
#define EMAC_GR_V  0x0000001FU
#define EMAC_GR_S  6
/** EMAC_PA : R/W; bitpos: [15:11]; default: 0;
 *  Physical Layer Address This field indicates which of the 32 possible PHY devices
 *  are being accessed For RevMII, this field gives the PHY Address of the RevMII module
 */
#define EMAC_PA    0x0000001FU
#define EMAC_PA_M  (EMAC_PA_V << EMAC_PA_S)
#define EMAC_PA_V  0x0000001FU
#define EMAC_PA_S  11

