espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_GMIIDATA_REG register
 *  Contains the data to be written to or read from the PHY register This register is
 *  present only when you select the Station Management _MDIO_ feature in
 *  coreConsultant _See Table 726_
 */
#define EMAC_GMIIDATA_REG (DR_REG_EMAC_BASE + 0x14)
/** EMAC_GD : R/W; bitpos: [15:0]; default: 0;
 *  GMII Data This field contains the 16bit data value read from the PHY or RevMII
 *  after a Management Read operation or the 16bit data value to be written to the PHY
 *  or RevMII before a Management Write operation
 */
#define EMAC_GD    0x0000FFFFU
#define EMAC_GD_M  (EMAC_GD_V << EMAC_GD_S)
#define EMAC_GD_V  0x0000FFFFU
#define EMAC_GD_S  0

/** EMAC_FLOWCONTROL_REG register
 *  Controls the generation of control frames
 */
#define EMAC_FLOWCONTROL_REG (DR_REG_EMAC_BASE + 0x18)
/** EMAC_FCB_BPA : R/W1S; bitpos: [0]; default: 0;
 *  Flow Control Busy or Backpressure Activate This bit initiates a Pause frame in the
 *  fullduplex mode and activates the backpressure function in the halfduplex mode if
 *  the TFE bit is set In the fullduplex mode, this bit should be read as 1'b0 before
 *  writing to the Flow Control register To initiate a Pause frame, the Application
 *  must set this bit to 1'b1 During a transfer of the Control Frame, this bit
 *  continues to be set to signify that a frame transmission is in progress After the
 *  completion of Pause frame transmission, the MAC resets this bit to 1'b0 The Flow
 *  Control register should not be written to until this bit is cleared In the
 *  halfduplex mode, when this bit is set _and TFE is set_, then backpressure is
 *  asserted by the MAC During backpressure, when the MAC receives a new frame, the
 *  transmitter starts sending a JAM pattern resulting in a collision This control
 *  register bit is logically ORed with the mti_flowctrl_i input signal for the
 *  backpressure function When the MAC is configured for the fullduplex mode, the BPA
 *  is automatically disabled
 */
#define EMAC_FCB_BPA    (BIT(0))
#define EMAC_FCB_BPA_M  (EMAC_FCB_BPA_V << EMAC_FCB_BPA_S)
#define EMAC_FCB_BPA_V  0x00000001U
#define EMAC_FCB_BPA_S  0
/** EMAC_TFE : R/W; bitpos: [1]; default: 0;
 *  Transmit Flow Control Enable In the fullduplex mode, when this bit is set, the MAC
 *  enables the flow control operation to transmit Pause frames When this bit is reset,
 *  the flow control operation in the MAC is disabled, and the MAC does not transmit
 *  any Pause frames In the halfduplex mode, when this bit is set, the MAC enables the
 *  backpressure operation When this bit is reset, the backpressure feature is disabled
 */
#define EMAC_TFE    (BIT(1))
#define EMAC_TFE_M  (EMAC_TFE_V << EMAC_TFE_S)
#define EMAC_TFE_V  0x00000001U
#define EMAC_TFE_S  1
/** EMAC_RECEIVE_FLOW_CTRL_E : R/W; bitpos: [2]; default: 0;
 *  Receive Flow Control Enable When this bit is set, the MAC decodes the received
 *  Pause frame and disables its transmitter for a specified _Pause_ time When this bit
 *  is reset, the decode function of the Pause frame is disabled
 */
#define EMAC_RECEIVE_FLOW_CTRL_E    (BIT(2))
#define EMAC_RECEIVE_FLOW_CTRL_E_M  (EMAC_RECEIVE_FLOW_CTRL_E_V << EMAC_RECEIVE_FLOW_CTRL_E_S)
#define EMAC_RECEIVE_FLOW_CTRL_E_V  0x00000001U
#define EMAC_RECEIVE_FLOW_CTRL_E_S  2
/** EMAC_UP : R/W; bitpos: [3]; default: 0;
 *  Unicast Pause Frame Detect A pause frame is processed when it has the unique
 *  multicast address specified in the IEEE Std 8023 When this bit is set, the MAC can
 *  also detect Pause frames with unicast address of the station This unicast address
 *  should be as specified in the MAC Address0 High Register and MAC Address0 Low
 *  Register When this bit is reset, the MAC only detects Pause frames with unique
 *  multicast address Note: The MAC does not process a Pause frame if the multicast
 *  address of received frame is different from the unique multicast address
 */
#define EMAC_UP    (BIT(3))
#define EMAC_UP_M  (EMAC_UP_V << EMAC_UP_S)
#define EMAC_UP_V  0x00000001U
#define EMAC_UP_S  3
/** EMAC_PLT : R/W; bitpos: [5:4]; default: 0;
 *  Pause Low Threshold This field configures the threshold of the Pause timer at which
 *  the input flow control signal mti_flowctrl_i _or sbd_flowctrl_i_ is checked for
 *  automatic retransmission of the Pause frame The threshold values should be always
 *  less than the Pause Time configured in Bits[31:16] For example, if PT = 100H _256
 *  slottimes_, and PLT = 01, then a second Pause frame is automatically transmitted if
 *  the mti_flowctrl_i signal is asserted at 228 _256  28_ slot times after the first
 *  Pause frame is transmitted The following list provides the threshold values for
 *  different values: 00: The threshold is Pause time minus 4 slot times _PT  4 slot
 *  times_ 01: The threshold is Pause time minus 28 slot times _PT  28 slot times_ 10:
 *  The threshold is Pause time minus 144 slot times _PT  144 slot times_ 11: The
 *  threshold is Pause time minus 256 slot times _PT  256 slot times_ The slot time is
 *  defined as the time taken to transmit 512 bits _64 bytes_ on the GMII or MII
 *  interface
 */
#define EMAC_PLT    0x00000003U
#define EMAC_PLT_M  (EMAC_PLT_V << EMAC_PLT_S)
#define EMAC_PLT_V  0x00000003U
#define EMAC_PLT_S  4
/** EMAC_DZPQ : R/W; bitpos: [7]; default: 0;
 *  Disable ZeroQuanta Pause When this bit is set, it disables the automatic generation
 *  of the ZeroQuanta Pause frames on the deassertion of the flowcontrol signal from
 *  the FIFO layer _MTL or external sideband flow control signal
 *  sbd_flowctrl_i/mti_flowctrl_i_ When this bit is reset, normal operation with
 *  automatic ZeroQuanta Pause frame generation is enabled
 */
#define EMAC_DZPQ    (BIT(7))
#define EMAC_DZPQ_M  (EMAC_DZPQ_V << EMAC_DZPQ_S)
#define EMAC_DZPQ_V  0x00000001U
#define EMAC_DZPQ_S  7
/** EMAC_PT : R/W; bitpos: [31:16]; default: 0;
 *  Pause Time This field holds the value to be used in the Pause Time field in the
 *  transmit control frame If the Pause Time bits is configured to be
 *  doublesynchronized to the _G_MII clock domain, then consecutive writes to this
 *  register should be performed only after at least four clock cycles in the
 *  destination clock domain
 */
#define EMAC_PT    0x0000FFFFU
#define EMAC_PT_M  (EMAC_PT_V << EMAC_PT_S)
#define EMAC_PT_V  0x0000FFFFU
#define EMAC_PT_S  16

