espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_VLANTAG_REG register
 *  Identifies IEEE 8021Q VLAN type frames
 */
#define EMAC_VLANTAG_REG (DR_REG_EMAC_BASE + 0x1c)
/** EMAC_VL : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Tag Identifier for Receive Frames This field contains the 8021Q VLAN tag to
 *  identify the VLAN frames and is compared to the 15th and 16th bytes of the frames
 *  being received for VLAN frames The following list describes the bits of this field:
 *  Bits [15:13]: User Priority Bit 12: Canonical Format Indicator _CFI_ or Drop
 *  Eligible Indicator _DEI_ Bits[11:0]: VLAN tag’s VLAN Identifier _VID_ field When
 *  the ETV bit is set, only the VID _Bits[11:0]_ is used for comparison If VL
 *  _VL[11:0] if ETV is set_ is all zeros, the MAC does not check the fifteenth and
 *  16th bytes for VLAN tag comparison, and declares all frames with a Type field value
 *  of 0x8100 or 0x88a8 as VLAN frames
 */
#define EMAC_VL    0x0000FFFFU
#define EMAC_VL_M  (EMAC_VL_V << EMAC_VL_S)
#define EMAC_VL_V  0x0000FFFFU
#define EMAC_VL_S  0
/** EMAC_ETV : R/W; bitpos: [16]; default: 0;
 *  Enable 12-Bit VLAN Tag Comparison
 */
#define EMAC_ETV    (BIT(16))
#define EMAC_ETV_M  (EMAC_ETV_V << EMAC_ETV_S)
#define EMAC_ETV_V  0x00000001U
#define EMAC_ETV_S  16
/** EMAC_VTIM : R/W; bitpos: [17]; default: 0;
 *  VLAN Tag Inverse Match Enable When set, this bit enables the VLAN Tag inverse
 *  matching The frames that do not have matching VLAN Tag are marked as matched When
 *  reset, this bit enables the VLAN Tag perfect matching The frames with matched VLAN
 *  Tag are marked as matched
 */
#define EMAC_VTIM    (BIT(17))
#define EMAC_VTIM_M  (EMAC_VTIM_V << EMAC_VTIM_S)
#define EMAC_VTIM_V  0x00000001U
#define EMAC_VTIM_S  17
/** EMAC_ESVL : R/W; bitpos: [18]; default: 0;
 *  Enable SVLAN When this bit is set, the MAC transmitter and receiver also consider
 *  the SVLAN _Type = 0x88A8_ frames as valid VLAN tagged frames
 */
#define EMAC_ESVL    (BIT(18))
#define EMAC_ESVL_M  (EMAC_ESVL_V << EMAC_ESVL_S)
#define EMAC_ESVL_V  0x00000001U
#define EMAC_ESVL_S  18
/** EMAC_VTHM : R/W; bitpos: [19]; default: 0;
 *  VLAN Tag Hash Table Match Enable When set, the most significant four bits of the
 *  VLAN tag’s CRC are used to index the content of Register 354 _VLAN Hash Table
 *  Register_ A value of 1 in the VLAN Hash Table register, corresponding to the index,
 *  indicates that the frame matched the VLAN hash table When Bit 16 _ETV_ is set, the
 *  CRC of the 12bit VLAN Identifier _VID_ is used for comparison whereas when ETV is
 *  reset, the CRC of the 16bit VLAN tag is used for comparison When reset, the VLAN
 *  Hash Match operation is not performed If the VLAN Hash feature is not enabled
 *  during core configuration, this bit is reserved _RO with default value_
 */
#define EMAC_VTHM    (BIT(19))
#define EMAC_VTHM_M  (EMAC_VTHM_V << EMAC_VTHM_S)
#define EMAC_VTHM_V  0x00000001U
#define EMAC_VTHM_S  19

/** EMAC_VERSION_REG register
 *  Identifies the version of the Core
 */
#define EMAC_VERSION_REG (DR_REG_EMAC_BASE + 0x20)
/** EMAC_SNPSVER : RO; bitpos: [7:0]; default: 55;
 *  Synopsysdefined Version _37_
 */
#define EMAC_SNPSVER    0x000000FFU
#define EMAC_SNPSVER_M  (EMAC_SNPSVER_V << EMAC_SNPSVER_S)
#define EMAC_SNPSVER_V  0x000000FFU
#define EMAC_SNPSVER_S  0
/** EMAC_USERVER : RO; bitpos: [15:8]; default: 0;
 *  Userdefined Version _configured with coreConsultant_
 */
#define EMAC_USERVER    0x000000FFU
#define EMAC_USERVER_M  (EMAC_USERVER_V << EMAC_USERVER_S)
#define EMAC_USERVER_V  0x000000FFU
#define EMAC_USERVER_S  8

/** EMAC_DEBUG_REG register
 *  Gives the status of various internal blocks for debugging
 */
#define EMAC_DEBUG_REG (DR_REG_EMAC_BASE + 0x24)
/** EMAC_RPESTS : RO; bitpos: [0]; default: 0;
 *  MAC GMII or MII Receive Protocol Engine Status When high, this bit indicates that
 *  the MAC GMII or MII receive protocol engine is actively receiving data and not in
 *  IDLE state
 */
#define EMAC_RPESTS    (BIT(0))
#define EMAC_RPESTS_M  (EMAC_RPESTS_V << EMAC_RPESTS_S)
#define EMAC_RPESTS_V  0x00000001U
#define EMAC_RPESTS_S  0
/** EMAC_RFCFCSTS : RO; bitpos: [2:1]; default: 0;
 *  MAC Receive Frame FIFO Controller Status When high, this field indicates the active
 *  state of the small FIFO Read and Write controllers of the MAC Receive Frame
 *  Controller Module RFCFCSTS[1] represents the status of small FIFO Read controller
 *  RFCFCSTS[0] represents the status of small FIFO Write controller
 */
#define EMAC_RFCFCSTS    0x00000003U
#define EMAC_RFCFCSTS_M  (EMAC_RFCFCSTS_V << EMAC_RFCFCSTS_S)
#define EMAC_RFCFCSTS_V  0x00000003U
#define EMAC_RFCFCSTS_S  1
/** EMAC_RWCSTS : RO; bitpos: [4]; default: 0;
 *  MTL Rx FIFO Write Controller Active Status When high, this bit indicates that the
 *  MTL Rx FIFO Write Controller is active and is transferring a received frame to the
 *  FIFO
 */
#define EMAC_RWCSTS    (BIT(4))
#define EMAC_RWCSTS_M  (EMAC_RWCSTS_V << EMAC_RWCSTS_S)
#define EMAC_RWCSTS_V  0x00000001U
#define EMAC_RWCSTS_S  4
/** EMAC_RRCSTS : RO; bitpos: [6:5]; default: 0;
 *  MTL RxFIFO Read Controller State This field gives the state of the Rx FIFO read
 *  Controller: 00: IDLE state 01: Reading frame data 10: Reading frame status _or
 *  timestamp_ 11: Flushing the frame data and status
 */
#define EMAC_RRCSTS    0x00000003U
#define EMAC_RRCSTS_M  (EMAC_RRCSTS_V << EMAC_RRCSTS_S)
#define EMAC_RRCSTS_V  0x00000003U
#define EMAC_RRCSTS_S  5
/** EMAC_RXFSTS : RO; bitpos: [9:8]; default: 0;
 *  MTL RxFIFO FillLevel Status This field gives the status of the filllevel of the Rx
 *  FIFO: 00: Rx FIFO Empty 01: Rx FIFO filllevel below flowcontrol deactivate
 *  threshold 10: Rx FIFO filllevel above flowcontrol activate threshold 11: Rx FIFO
 *  Full
 */
#define EMAC_RXFSTS    0x00000003U
#define EMAC_RXFSTS_M  (EMAC_RXFSTS_V << EMAC_RXFSTS_S)
#define EMAC_RXFSTS_V  0x00000003U
#define EMAC_RXFSTS_S  8
/** EMAC_TPESTS : RO; bitpos: [16]; default: 0;
 *  MAC GMII or MII Transmit Protocol Engine Status When high, this bit indicates that
 *  the MAC GMII or MII transmit protocol engine is actively transmitting data and is
 *  not in the IDLE state
 */
#define EMAC_TPESTS    (BIT(16))
#define EMAC_TPESTS_M  (EMAC_TPESTS_V << EMAC_TPESTS_S)
#define EMAC_TPESTS_V  0x00000001U
#define EMAC_TPESTS_S  16
/** EMAC_TFCSTS : RO; bitpos: [18:17]; default: 0;
 *  MAC Transmit Frame Controller Status This field indicates the state of the MAC
 *  Transmit Frame Controller module: 00: IDLE state 01: Waiting for status of previous
 *  frame or IFG or backoff period to be over 10: Generating and transmitting a Pause
 *  frame _in the fullduplex mode_ 11: Transferring input frame for transmission
 */
#define EMAC_TFCSTS    0x00000003U
#define EMAC_TFCSTS_M  (EMAC_TFCSTS_V << EMAC_TFCSTS_S)
#define EMAC_TFCSTS_V  0x00000003U
#define EMAC_TFCSTS_S  17
/** EMAC_TXPAUSED : RO; bitpos: [19]; default: 0;
 *  MAC Transmitter in Pause When high, this bit indicates that the MAC transmitter is
 *  in the Pause condition _in the fullduplexonly mode_ and hence does not schedule any
 *  frame for transmission
 */
#define EMAC_TXPAUSED    (BIT(19))
#define EMAC_TXPAUSED_M  (EMAC_TXPAUSED_V << EMAC_TXPAUSED_S)
#define EMAC_TXPAUSED_V  0x00000001U
#define EMAC_TXPAUSED_S  19
/** EMAC_TRCSTS : RO; bitpos: [21:20]; default: 0;
 *  MTL Tx FIFO Read Controller Status This field indicates the state of the Tx FIFO
 *  Read Controller: 00: IDLE state 01: READ state _transferring data to the MAC
 *  transmitter_ 10: Waiting for TxStatus from the MAC transmitter 11: Writing the
 *  received TxStatus or flushing the Tx FIFO
 */
#define EMAC_TRCSTS    0x00000003U
#define EMAC_TRCSTS_M  (EMAC_TRCSTS_V << EMAC_TRCSTS_S)
#define EMAC_TRCSTS_V  0x00000003U
#define EMAC_TRCSTS_S  20
/** EMAC_TWCSTS : RO; bitpos: [22]; default: 0;
 *  MTL Tx FIFO Write Controller Status When high, this bit indicates that the MTL Tx
 *  FIFO Write Controller is active and is transferring data to the Tx FIFO
 */
#define EMAC_TWCSTS    (BIT(22))
#define EMAC_TWCSTS_M  (EMAC_TWCSTS_V << EMAC_TWCSTS_S)
#define EMAC_TWCSTS_V  0x00000001U
#define EMAC_TWCSTS_S  22
/** EMAC_TXFSTS : RO; bitpos: [24]; default: 0;
 *  MTL Tx FIFO Not Empty Status When high, this bit indicates that the MTL Tx FIFO is
 *  not empty and some data is left for transmission
 */
#define EMAC_TXFSTS    (BIT(24))
#define EMAC_TXFSTS_M  (EMAC_TXFSTS_V << EMAC_TXFSTS_S)
#define EMAC_TXFSTS_V  0x00000001U
#define EMAC_TXFSTS_S  24
/** EMAC_TXSTSFSTS : RO; bitpos: [25]; default: 0;
 *  MTL TxStatus FIFO Full Status When high, this bit indicates that the MTL TxStatus
 *  FIFO is full Therefore, the MTL cannot accept any more frames for transmission This
 *  bit is reserved in the EMACAHB and EMACDMA configurations
 */
#define EMAC_TXSTSFSTS    (BIT(25))
#define EMAC_TXSTSFSTS_M  (EMAC_TXSTSFSTS_V << EMAC_TXSTSFSTS_S)
#define EMAC_TXSTSFSTS_V  0x00000001U
#define EMAC_TXSTSFSTS_S  25

/** EMAC_REMOTEWAKEUPFRAMEFILTER_REG register
 *  Remote Wake-Up Frame Filter Register
 */
#define EMAC_REMOTEWAKEUPFRAMEFILTER_REG (DR_REG_EMAC_BASE + 0x28)
/** EMAC_WKUPFRM_FILTER : R/W; bitpos: [31:0]; default: 0;
 *  This is the address through which the application writes or reads the remote
 *  wake-up frame filter registers.The reg_wkupfrm_filter register is a pointer to
 *  eight reg_wkupfrm_filter registers.The reg_wkupfrm_filter register is loaded by
 *  sequentially loading the eight register values.Eight sequential writes to this
 *  address(0x0028)write all reg_wkupfrm_filter registers.Similarly, eight sequential
 *  reads from this address(0x0028) read all reg_wkupfrm_filter registers.
 *  This register is present only when you select the PMT module Remote Wake-Up feature
 *  in coreConsultant.
 */
#define EMAC_WKUPFRM_FILTER    0xFFFFFFFFU
#define EMAC_WKUPFRM_FILTER_M  (EMAC_WKUPFRM_FILTER_V << EMAC_WKUPFRM_FILTER_S)
#define EMAC_WKUPFRM_FILTER_V  0xFFFFFFFFU
#define EMAC_WKUPFRM_FILTER_S  0

