espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_PMTCONTROLANDSTATUS_REG register
 *  PMT Control and Status Register. This register is present only when you select the
 *  PMT module in coreConsultant.
 */
#define EMAC_PMTCONTROLANDSTATUS_REG (DR_REG_EMAC_BASE + 0x2c)
/** EMAC_PWRDWN : R/W1S; bitpos: [0]; default: 0;
 *  Power Down
 *  When set, the MAC receiver drops all received frames until it receives the expected
 *  magic packet or remote wake-up frame. This bit is then self-cleared and the
 *  power-down mode is disabled. The Software can also clear this bit before the
 *  expected magic packet or remote wake-up frame is received. The frames, received by
 *  MAC after this bit is cleared, are forwarded to the application. This bit must only
 *  be set when the Magic Packet Enable, Global Unicast, or Remote Wake-Up Frame Enable
 *  bit is set high.
 */
#define EMAC_PWRDWN    (BIT(0))
#define EMAC_PWRDWN_M  (EMAC_PWRDWN_V << EMAC_PWRDWN_S)
#define EMAC_PWRDWN_V  0x00000001U
#define EMAC_PWRDWN_S  0
/** EMAC_MGKPKTEN : R/W; bitpos: [1]; default: 0;
 *  Magic Packet Enable
 *  When set, enables generation of a power management event because of magic packet
 *  reception.
 */
#define EMAC_MGKPKTEN    (BIT(1))
#define EMAC_MGKPKTEN_M  (EMAC_MGKPKTEN_V << EMAC_MGKPKTEN_S)
#define EMAC_MGKPKTEN_V  0x00000001U
#define EMAC_MGKPKTEN_S  1
/** EMAC_RWKPKTEN : R/W; bitpos: [2]; default: 0;
 *  Remote Wake-Up Frame Enable
 *  When set, enables generation of a power management event because of remote wake-up
 *  frame reception.
 */
#define EMAC_RWKPKTEN    (BIT(2))
#define EMAC_RWKPKTEN_M  (EMAC_RWKPKTEN_V << EMAC_RWKPKTEN_S)
#define EMAC_RWKPKTEN_V  0x00000001U
#define EMAC_RWKPKTEN_S  2
/** EMAC_MGKPRCVD : R/W; bitpos: [5]; default: 0;
 *  Magic Packet Received
 *  When set,this bit indicates that the power management event is generated because of
 *  the reception of a magic packet. This bit is cleared by Read into this register.
 */
#define EMAC_MGKPRCVD    (BIT(5))
#define EMAC_MGKPRCVD_M  (EMAC_MGKPRCVD_V << EMAC_MGKPRCVD_S)
#define EMAC_MGKPRCVD_V  0x00000001U
#define EMAC_MGKPRCVD_S  5
/** EMAC_RWKPRCVD : R/W; bitpos: [6]; default: 0;
 *  Remote Wake-Up Frame Received
 *  When set, this bit indicates the power management event is generated because of the
 *  reception of a remote wake-up frame. This bit is cleared by a Read into this
 *  register.
 */
#define EMAC_RWKPRCVD    (BIT(6))
#define EMAC_RWKPRCVD_M  (EMAC_RWKPRCVD_V << EMAC_RWKPRCVD_S)
#define EMAC_RWKPRCVD_V  0x00000001U
#define EMAC_RWKPRCVD_S  6
/** EMAC_GLBLUCAST : R/W; bitpos: [9]; default: 0;
 *  Global Unicast.
 *  When set, enables any unicast packet filtered by the MAX(DAF) address recognition
 *  to be a remote wake-up frame.
 */
#define EMAC_GLBLUCAST    (BIT(9))
#define EMAC_GLBLUCAST_M  (EMAC_GLBLUCAST_V << EMAC_GLBLUCAST_S)
#define EMAC_GLBLUCAST_V  0x00000001U
#define EMAC_GLBLUCAST_S  9
/** EMAC_RWKPTR : RO; bitpos: [28:24]; default: 0;
 *  Remote Wake-up FIFO Pointer.
 *  This field gives the current value(0 to 31) of the Remote Wake-up Frame filter
 *  register pointer. When the value of this pointer is erual to 7, 15, 23 or 31, the
 *  contents of the Remote Wake-up Frame Filter Register are transferred to the
 *  clk_rx_i domain when a write occurs to that register.
 *  The maximum value of the pointer is 7, 15, 23 and 31 respectively depending on the
 *  number of Remote Wakeup Filters selected during configuration.
 */
#define EMAC_RWKPTR    0x0000001FU
#define EMAC_RWKPTR_M  (EMAC_RWKPTR_V << EMAC_RWKPTR_S)
#define EMAC_RWKPTR_V  0x0000001FU
#define EMAC_RWKPTR_S  24
/** EMAC_RWKFILTRST : R/W1S; bitpos: [31]; default: 0;
 *  Remote Wake-Up Frame Filter Register Pointer Reset.
 *  When this bit is set, it resets the remote wake-up frame filter register pointer to
 *  3'b000. It is automatically cleared after 1 clock cycle.
 */
#define EMAC_RWKFILTRST    (BIT(31))
#define EMAC_RWKFILTRST_M  (EMAC_RWKFILTRST_V << EMAC_RWKFILTRST_S)
#define EMAC_RWKFILTRST_V  0x00000001U
#define EMAC_RWKFILTRST_S  31

/** EMAC_LPICONTROLANDSTATUS_REG register
 *  Controls the Low Power Idle _LPI_ operations and provides the LPI status of the
 *  core This register is present only when you select the Energy Efficient Ethernet
 *  feature in coreConsultant
 */
#define EMAC_LPICONTROLANDSTATUS_REG (DR_REG_EMAC_BASE + 0x30)
/** EMAC_TLPIEN : R/W; bitpos: [0]; default: 0;
 *  Transmit LPI Entry When set, this bit indicates that the MAC Transmitter has
 *  entered the LPI state because of the setting of the LPIEN bit This bit is cleared
 *  by a read into this register
 */
#define EMAC_TLPIEN    (BIT(0))
#define EMAC_TLPIEN_M  (EMAC_TLPIEN_V << EMAC_TLPIEN_S)
#define EMAC_TLPIEN_V  0x00000001U
#define EMAC_TLPIEN_S  0
/** EMAC_TLPIEX : R/W; bitpos: [1]; default: 0;
 *  Transmit LPI Exit When set, this bit indicates that the MAC transmitter has exited
 *  the LPI state after the user has cleared the LPIEN bit and the LPI TW Timer has
 *  expired This bit is cleared by a read into this register
 */
#define EMAC_TLPIEX    (BIT(1))
#define EMAC_TLPIEX_M  (EMAC_TLPIEX_V << EMAC_TLPIEX_S)
#define EMAC_TLPIEX_V  0x00000001U
#define EMAC_TLPIEX_S  1
/** EMAC_RLPIEN : R/W; bitpos: [2]; default: 0;
 *  Receive LPI Entry When set, this bit indicates that the MAC Receiver has received
 *  an LPI pattern and entered the LPI state This bit is cleared by a read into this
 *  register Note: This bit may not get set if the MAC stops receiving the LPI pattern
 *  for a very short duration, such as, less than 3 clock cycles of CSR clock
 */
#define EMAC_RLPIEN    (BIT(2))
#define EMAC_RLPIEN_M  (EMAC_RLPIEN_V << EMAC_RLPIEN_S)
#define EMAC_RLPIEN_V  0x00000001U
#define EMAC_RLPIEN_S  2
/** EMAC_RLPIEX : R/W; bitpos: [3]; default: 0;
 *  Receive LPI Exit When set, this bit indicates that the MAC Receiver has stopped
 *  receiving the LPI pattern on the GMII or MII interface, exited the LPI state, and
 *  resumed the normal reception This bit is cleared by a read into this register Note:
 *  This bit may not get set if the MAC stops receiving the LPI pattern for a very
 *  short duration, such as, less than 3 clock cycles of CSR clock
 */
#define EMAC_RLPIEX    (BIT(3))
#define EMAC_RLPIEX_M  (EMAC_RLPIEX_V << EMAC_RLPIEX_S)
#define EMAC_RLPIEX_V  0x00000001U
#define EMAC_RLPIEX_S  3
/** EMAC_TLPIST : RO; bitpos: [8]; default: 0;
 *  Transmit LPI State When set, this bit indicates that the MAC is transmitting the
 *  LPI pattern on the GMII or MII interface
 */
#define EMAC_TLPIST    (BIT(8))
#define EMAC_TLPIST_M  (EMAC_TLPIST_V << EMAC_TLPIST_S)
#define EMAC_TLPIST_V  0x00000001U
#define EMAC_TLPIST_S  8
/** EMAC_RLPIST : RO; bitpos: [9]; default: 0;
 *  Receive LPI State When set, this bit indicates that the MAC is receiving the LPI
 *  pattern on the GMII or MII interface
 */
#define EMAC_RLPIST    (BIT(9))
#define EMAC_RLPIST_M  (EMAC_RLPIST_V << EMAC_RLPIST_S)
#define EMAC_RLPIST_V  0x00000001U
#define EMAC_RLPIST_S  9
/** EMAC_LPIEN : R/W; bitpos: [16]; default: 0;
 *  LPI Enable When set, this bit instructs the MAC Transmitter to enter the LPI state
 *  When reset, this bit instructs the MAC to exit the LPI state and resume normal
 *  transmission This bit is cleared when the LPITXA bit is set and the MAC exits the
 *  LPI state because of the arrival of a new packet for transmission
 */
#define EMAC_LPIEN    (BIT(16))
#define EMAC_LPIEN_M  (EMAC_LPIEN_V << EMAC_LPIEN_S)
#define EMAC_LPIEN_V  0x00000001U
#define EMAC_LPIEN_S  16
/** EMAC_PLS : R/W; bitpos: [17]; default: 0;
 *  PHY Link Status This bit indicates the link status of the PHY The MAC Transmitter
 *  asserts the LPI pattern only when the link status is up _okay_ at least for the
 *  time indicated by the LPI LS TIMER When set, the link is considered to be okay _up_
 *  and when reset, the link is considered to be down
 */
#define EMAC_PLS    (BIT(17))
#define EMAC_PLS_M  (EMAC_PLS_V << EMAC_PLS_S)
#define EMAC_PLS_V  0x00000001U
#define EMAC_PLS_S  17
/** EMAC_PLSEN : R/W; bitpos: [18]; default: 0;
 *  PHY Link Status Enable This bit enables the link status received on the RGMII,
 *  SGMII, or SMII receive paths to be used for activating the LPI LS TIMER When set,
 *  the MAC uses the linkstatus bits of Register 54 _SGMII/RGMII/SMII Control and
 *  Status Register_ and Bit 17 _PLS_ for the LPI LS Timer trigger When cleared, the
 *  MAC ignores the linkstatus bits of Register 54 and takes only the PLS bit This bit
 *  is RO and reserved if you have not selected the RGMII, SGMII, or SMII PHY interface
 */
#define EMAC_PLSEN    (BIT(18))
#define EMAC_PLSEN_M  (EMAC_PLSEN_V << EMAC_PLSEN_S)
#define EMAC_PLSEN_V  0x00000001U
#define EMAC_PLSEN_S  18
/** EMAC_LPITXA : R/W; bitpos: [19]; default: 0;
 *  LPI TX Automate This bit controls the behavior of the MAC when it is entering or
 *  coming out of the LPI mode on the transmit side This bit is not functional in the
 *  EMAC CORE configuration in which the Tx clock gating is done during the LPI mode If
 *  the LPITXA and LPIEN bits are set to 1, the MAC enters the LPI mode only after all
 *  outstanding frames _in the core_ and pending frames _in the application interface_
 *  have been transmitted The MAC comes out of the LPI mode when the application sends
 *  any frame for transmission or the application issues a TX FIFO Flush command In
 *  addition, the MAC automatically clears the LPIEN bit when it exits the LPI state If
 *  TX FIFO Flush is set in Bit 20 of Register 6 _Operation Mode Register_, when the
 *  MAC is in the LPI mode, the MAC exits the LPI mode When this bit is 0, the LPIEN
 *  bit directly controls behavior of the MAC when it is entering or coming out of the
 *  LPI mode
 */
#define EMAC_LPITXA    (BIT(19))
#define EMAC_LPITXA_M  (EMAC_LPITXA_V << EMAC_LPITXA_S)
#define EMAC_LPITXA_V  0x00000001U
#define EMAC_LPITXA_S  19

