espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_LPITIMERSCONTROL_REG register
 *  Controls the timeout values in LPI states This register is present only when you
 *  select the Energy Efficient Ethernet feature in coreConsultant
 */
#define EMAC_LPITIMERSCONTROL_REG (DR_REG_EMAC_BASE + 0x34)
/** EMAC_TWT : R/W; bitpos: [15:0]; default: 0;
 *  LPI TW TIMER This field specifies the minimum time _in microseconds_ for which the
 *  MAC waits after it stops transmitting the LPI pattern to the PHY and before it
 *  resumes the normal transmission The TLPIEX status bit is set after the expiry of
 *  this timer
 */
#define EMAC_TWT    0x0000FFFFU
#define EMAC_TWT_M  (EMAC_TWT_V << EMAC_TWT_S)
#define EMAC_TWT_V  0x0000FFFFU
#define EMAC_TWT_S  0
/** EMAC_LST : R/W; bitpos: [25:16]; default: 1000;
 *  LPI LS TIMER This field specifies the minimum time _in milliseconds_ for which the
 *  link status from the PHY should be up _OKAY_ before the LPI pattern can be
 *  transmitted to the PHY The MAC does not transmit the LPI pattern even when the
 *  LPIEN bit is set unless the LPI LS Timer reaches the programmed terminal count The
 *  default value of the LPI LS Timer is 1000 _1 sec_ as defined in the IEEE standard
 */
#define EMAC_LST    0x000003FFU
#define EMAC_LST_M  (EMAC_LST_V << EMAC_LST_S)
#define EMAC_LST_V  0x000003FFU
#define EMAC_LST_S  16

/** EMAC_INTERRUPTSTATUS_REG register
 *  Contains the interrupt status
 */
#define EMAC_INTERRUPTSTATUS_REG (DR_REG_EMAC_BASE + 0x38)
/** EMAC_RGSMIIIS : RO; bitpos: [0]; default: 0;
 *  RGMII or SMII Interrupt Status This bit is set because of any change in value of
 *  the Link Status of RGMII or SMII interface _Bit 3 in Register 54 _SGMII/RGMII/SMII
 *  Control and Status Register__ This bit is cleared when you perform a read operation
 *  on the SGMII/RGMII/SMII Control and Status Register This bit is valid only when you
 *  select the optional RGMII or SMII PHY interface during core configuration and
 *  operation
 */
#define EMAC_RGSMIIIS    (BIT(0))
#define EMAC_RGSMIIIS_M  (EMAC_RGSMIIIS_V << EMAC_RGSMIIIS_S)
#define EMAC_RGSMIIIS_V  0x00000001U
#define EMAC_RGSMIIIS_S  0
/** EMAC_PCSLCHGIS : RO; bitpos: [1]; default: 0;
 *  PCS Link Status Changed This bit is set because of any change in Link Status in the
 *  TBI, RTBI, or SGMII PHY interface _Bit 2 in Register 49 _AN Status Register__ This
 *  bit is cleared when you perform a read operation on the AN Status register This bit
 *  is valid only when you select the optional TBI, RTBI, or SGMII PHY interface during
 *  core configuration and operation
 */
#define EMAC_PCSLCHGIS    (BIT(1))
#define EMAC_PCSLCHGIS_M  (EMAC_PCSLCHGIS_V << EMAC_PCSLCHGIS_S)
#define EMAC_PCSLCHGIS_V  0x00000001U
#define EMAC_PCSLCHGIS_S  1
/** EMAC_PCSANCIS : RO; bitpos: [2]; default: 0;
 *  PCS AutoNegotiation Complete This bit is set when the Autonegotiation is completed
 *  in the TBI, RTBI, or SGMII PHY interface _Bit 5 in Register 49 _AN Status
 *  Register__ This bit is cleared when you perform a read operation to the AN Status
 *  register This bit is valid only when you select the optional TBI, RTBI, or SGMII
 *  PHY interface during core configuration and operation
 */
#define EMAC_PCSANCIS    (BIT(2))
#define EMAC_PCSANCIS_M  (EMAC_PCSANCIS_V << EMAC_PCSANCIS_S)
#define EMAC_PCSANCIS_V  0x00000001U
#define EMAC_PCSANCIS_S  2
/** EMAC_PMTIS : RO; bitpos: [3]; default: 0;
 *  PMT Interrupt Status This bit is set when a magic packet or remote wakeup frame is
 *  received in the powerdown mode _see Bits 5 and 6 in the PMT Control and Status
 *  Register_ This bit is cleared when both Bits[6:5] are cleared because of a read
 *  operation to the PMT Control and Status register This bit is valid only when you
 *  select the optional PMT module during core configuration
 */
#define EMAC_PMTIS    (BIT(3))
#define EMAC_PMTIS_M  (EMAC_PMTIS_V << EMAC_PMTIS_S)
#define EMAC_PMTIS_V  0x00000001U
#define EMAC_PMTIS_S  3
/** EMAC_MMCIS : RO; bitpos: [4]; default: 0;
 *  MMC Interrupt Status This bit is set high when any of the Bits [7:5] is set high
 *  and cleared only when all of these bits are low This bit is valid only when you
 *  select the optional MMC module during core configuration
 */
#define EMAC_MMCIS    (BIT(4))
#define EMAC_MMCIS_M  (EMAC_MMCIS_V << EMAC_MMCIS_S)
#define EMAC_MMCIS_V  0x00000001U
#define EMAC_MMCIS_S  4
/** EMAC_MMCRXIS : RO; bitpos: [5]; default: 0;
 *  MMC Receive Interrupt Status This bit is set high when an interrupt is generated in
 *  the MMC Receive Interrupt Register This bit is cleared when all the bits in this
 *  interrupt register are cleared This bit is valid only when you select the optional
 *  MMC module during core configuration
 */
#define EMAC_MMCRXIS    (BIT(5))
#define EMAC_MMCRXIS_M  (EMAC_MMCRXIS_V << EMAC_MMCRXIS_S)
#define EMAC_MMCRXIS_V  0x00000001U
#define EMAC_MMCRXIS_S  5
/** EMAC_MMCTXIS : RO; bitpos: [6]; default: 0;
 *  MMC Transmit Interrupt Status This bit is set high when an interrupt is generated
 *  in the MMC Transmit Interrupt Register This bit is cleared when all the bits in
 *  this interrupt register are cleared This bit is valid only when you select the
 *  optional MMC module during core configuration
 */
#define EMAC_MMCTXIS    (BIT(6))
#define EMAC_MMCTXIS_M  (EMAC_MMCTXIS_V << EMAC_MMCTXIS_S)
#define EMAC_MMCTXIS_V  0x00000001U
#define EMAC_MMCTXIS_S  6
/** EMAC_MMCRXIPIS : RO; bitpos: [7]; default: 0;
 *  MMC Receive Checksum Offload Interrupt Status This bit is set high when an
 *  interrupt is generated in the MMC Receive Checksum Offload Interrupt Register This
 *  bit is cleared when all the bits in this interrupt register are cleared This bit is
 *  valid only when you select the optional MMC module and Checksum Offload Engine
 *  _Type 2_ during core configuration
 */
#define EMAC_MMCRXIPIS    (BIT(7))
#define EMAC_MMCRXIPIS_M  (EMAC_MMCRXIPIS_V << EMAC_MMCRXIPIS_S)
#define EMAC_MMCRXIPIS_V  0x00000001U
#define EMAC_MMCRXIPIS_S  7
/** EMAC_TSIS : RO; bitpos: [9]; default: 0;
 *  Timestamp Interrupt Status When the Advanced Timestamp feature is enabled, this bit
 *  is set when R_SS_RC any of the following conditions is true: The system time value
 *  equals or exceeds the value specified in the Target Time High and Low registers
 *  There is an overflow in the seconds register The Auxiliary snapshot trigger is
 *  asserted This bit is cleared on reading Bit 0 of Register 458 _Timestamp Status
 *  Register_ If default Timestamping is enabled, when set, this bit indicates that the
 *  system time value is equal to or exceeds the value specified in the Target Time
 *  registers In this mode, this bit is cleared after the completion of the read of
 *  this bit In all other modes, this bit is reserved
 */
#define EMAC_TSIS    (BIT(9))
#define EMAC_TSIS_M  (EMAC_TSIS_V << EMAC_TSIS_S)
#define EMAC_TSIS_V  0x00000001U
#define EMAC_TSIS_S  9
/** EMAC_LPIIS : RO; bitpos: [10]; default: 0;
 *  LPI Interrupt Status When the Energy Efficient Ethernet feature is enabled, this
 *  bit is set for any LPI state entry or exit in the MAC Transmitter or Receiver This
 *  bit is cleared on reading Bit 0 of Register 12 _LPI Control and Status Register_ In
 *  all other modes, this bit is reserved
 */
#define EMAC_LPIIS    (BIT(10))
#define EMAC_LPIIS_M  (EMAC_LPIIS_V << EMAC_LPIIS_S)
#define EMAC_LPIIS_V  0x00000001U
#define EMAC_LPIIS_S  10
/** EMAC_GPIIS : RO; bitpos: [11]; default: 0;
 *  GPI Interrupt Status When the GPIO feature is enabled, this bit is set when any
 *  active event _LL or LH_ occurs on the GPIS field _Bits [3:0]_ of Register 56
 *  _General Purpose IO Register_ and the corresponding GPIE bit is enabled This bit is
 *  cleared on reading lane 0 _GPIS_ of Register 56 _General Purpose IO Register_ When
 *  the GPIO feature is not enabled, this bit is reserved
 */
#define EMAC_GPIIS    (BIT(11))
#define EMAC_GPIIS_M  (EMAC_GPIIS_V << EMAC_GPIIS_S)
#define EMAC_GPIIS_V  0x00000001U
#define EMAC_GPIIS_S  11

/** EMAC_INTERRUPTMASK_REG register
 *  Contains the masks for generating the interrupts
 */
#define EMAC_INTERRUPTMASK_REG (DR_REG_EMAC_BASE + 0x3c)
/** EMAC_RGSMIIIM : R/W; bitpos: [0]; default: 0;
 *  RGMII or SMII Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of the RGMII or SMII Interrupt Status bit
 *  in Register 14 _Interrupt Status Register_
 */
#define EMAC_RGSMIIIM    (BIT(0))
#define EMAC_RGSMIIIM_M  (EMAC_RGSMIIIM_V << EMAC_RGSMIIIM_S)
#define EMAC_RGSMIIIM_V  0x00000001U
#define EMAC_RGSMIIIM_S  0
/** EMAC_PCSLCHGIM : R/W; bitpos: [1]; default: 0;
 *  PCS Link Status Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of the PCS Linkstatus changed bit in
 *  Register 14 _Interrupt Status Register_
 */
#define EMAC_PCSLCHGIM    (BIT(1))
#define EMAC_PCSLCHGIM_M  (EMAC_PCSLCHGIM_V << EMAC_PCSLCHGIM_S)
#define EMAC_PCSLCHGIM_V  0x00000001U
#define EMAC_PCSLCHGIM_S  1
/** EMAC_PCSANCIM : R/W; bitpos: [2]; default: 0;
 *  PCS AN Completion Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of PCS Autonegotiation complete bit in
 *  Register 14 _Interrupt Status Register_
 */
#define EMAC_PCSANCIM    (BIT(2))
#define EMAC_PCSANCIM_M  (EMAC_PCSANCIM_V << EMAC_PCSANCIM_S)
#define EMAC_PCSANCIM_V  0x00000001U
#define EMAC_PCSANCIM_S  2
/** EMAC_PMTIM : R/W; bitpos: [3]; default: 0;
 *  PMT Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of PMT Interrupt Status bit in Register 14 _Interrupt
 *  Status Register_
 */
#define EMAC_PMTIM    (BIT(3))
#define EMAC_PMTIM_M  (EMAC_PMTIM_V << EMAC_PMTIM_S)
#define EMAC_PMTIM_V  0x00000001U
#define EMAC_PMTIM_S  3
/** EMAC_TSIM : R/W; bitpos: [9]; default: 0;
 *  Timestamp Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of Timestamp Interrupt Status bit in Register 14
 *  _Interrupt Status Register_ This bit is valid only when IEEE1588 timestamping is
 *  enabled In all other modes, this bit is reserved
 */
#define EMAC_TSIM    (BIT(9))
#define EMAC_TSIM_M  (EMAC_TSIM_V << EMAC_TSIM_S)
#define EMAC_TSIM_V  0x00000001U
#define EMAC_TSIM_S  9
/** EMAC_LPIIM : R/W; bitpos: [10]; default: 0;
 *  LPI Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of the LPI Interrupt Status bit in Register 14
 *  _Interrupt Status Register_ This bit is valid only when you select the Energy
 *  Efficient Ethernet feature during core configuration In all other modes, this bit
 *  is reserved
 */
#define EMAC_LPIIM    (BIT(10))
#define EMAC_LPIIM_M  (EMAC_LPIIM_V << EMAC_LPIIM_S)
#define EMAC_LPIIM_V  0x00000001U
#define EMAC_LPIIM_S  10

/** EMAC_MACADDRESS0HIGH_REG register
 *  Contains the higher 16 bits of the first MAC address
 */
#define EMAC_MACADDRESS0HIGH_REG (DR_REG_EMAC_BASE + 0x40)
/** EMAC_ADDRHI_0 : R/W; bitpos: [15:0]; default: 65535;
 *  MAC Address0 [47:32] This field contains the upper 16 bits _47:32_ of the first
 *  6byte MAC address The MAC uses this field for filtering the received frames and
 *  inserting the MAC address in the Transmit Flow Control _Pause_ Frames
 */
#define EMAC_ADDRHI_0    0x0000FFFFU
#define EMAC_ADDRHI_0_M  (EMAC_ADDRHI_0_V << EMAC_ADDRHI_0_S)
#define EMAC_ADDRHI_0_V  0x0000FFFFU
#define EMAC_ADDRHI_0_S  0
/** EMAC_AE_0 : RO; bitpos: [31]; default: 1;
 *  Address Enable This bit is always set to 1
 */
#define EMAC_AE_0    (BIT(31))
#define EMAC_AE_0_M  (EMAC_AE_0_V << EMAC_AE_0_S)
#define EMAC_AE_0_V  0x00000001U
#define EMAC_AE_0_S  31

/** EMAC_MACADDRESS0LOW_REG register
 *  Contains the lower 32 bits of the first MAC address
 */
#define EMAC_MACADDRESS0LOW_REG (DR_REG_EMAC_BASE + 0x44)
/** EMAC_ADDRLO_0 : R/W; bitpos: [31:0]; default: 4294967295;
 *  MAC Address0 [31:0] This field contains the lower 32 bits of the first 6byte MAC
 *  address This is used by the MAC for filtering the received frames and inserting the
 *  MAC address in the Transmit Flow Control _Pause_ Frames
 */
#define EMAC_ADDRLO_0    0xFFFFFFFFU
#define EMAC_ADDRLO_0_M  (EMAC_ADDRLO_0_V << EMAC_ADDRLO_0_S)
#define EMAC_ADDRLO_0_V  0xFFFFFFFFU
#define EMAC_ADDRLO_0_S  0

/** EMAC_MACADDRESS1HIGH_REG register
 *  Contains the higher 16 bits of the second MAC address This register is present only
 *  when Enable MAC Address1 is selected in coreConsultant _See Table 78_
 */
#define EMAC_MACADDRESS1HIGH_REG (DR_REG_EMAC_BASE + 0x48)
/** EMAC_ADDRHI_1 : R/W; bitpos: [15:0]; default: 65535;
 *  MAC Address1 [47:32] This field contains the upper 16 bits _47:32_ of the second
 *  6byte MAC address
 */
#define EMAC_ADDRHI_1    0x0000FFFFU
#define EMAC_ADDRHI_1_M  (EMAC_ADDRHI_1_V << EMAC_ADDRHI_1_S)
#define EMAC_ADDRHI_1_V  0x0000FFFFU
#define EMAC_ADDRHI_1_S  0
/** EMAC_MBC_1 : R/W; bitpos: [29:24]; default: 0;
 *  Mask Byte Control These bits are mask control bits for comparison of each of the
 *  MAC Address bytes When set high, the MAC does not compare the corresponding byte of
 *  received DA or SA with the contents of MAC Address1 registers Each bit controls the
 *  masking of the bytes as follows: Bit 29: Register 18[15:8] Bit 28: Register 18[7:0]
 *  Bit 27: Register 19[31:24]  Bit 24: Register 19[7:0] You can filter a group of
 *  addresses _known as group address filtering_ by masking one or more bytes of the
 *  address
 */
#define EMAC_MBC_1    0x0000003FU
#define EMAC_MBC_1_M  (EMAC_MBC_1_V << EMAC_MBC_1_S)
#define EMAC_MBC_1_V  0x0000003FU
#define EMAC_MBC_1_S  24
/** EMAC_SA_1 : R/W; bitpos: [30]; default: 0;
 *  Source Address When this bit is set, the MAC Address1[47:0] is used to compare with
 *  the SA fields of the received frame When this bit is reset, the MAC Address1[47:0]
 *  is used to compare with the DA fields of the received frame
 */
#define EMAC_SA_1    (BIT(30))
#define EMAC_SA_1_M  (EMAC_SA_1_V << EMAC_SA_1_S)
#define EMAC_SA_1_V  0x00000001U
#define EMAC_SA_1_S  30
/** EMAC_AE_1 : R/W; bitpos: [31]; default: 0;
 *  Address Enable
 */
#define EMAC_AE_1    (BIT(31))
#define EMAC_AE_1_M  (EMAC_AE_1_V << EMAC_AE_1_S)
#define EMAC_AE_1_V  0x00000001U
#define EMAC_AE_1_S  31

