espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_MACADDRESS1LOW_REG register
 *  Contains the lower 32 bits of the second MAC address This register is present only
 *  when Enable MAC Address1 is selected in coreConsultant _See Table 78_
 */
#define EMAC_MACADDRESS1LOW_REG (DR_REG_EMAC_BASE + 0x4c)
/** EMAC_ADDRLO_1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  MAC Address1 [31:0] This field contains the lower 32 bits of the second 6byte MAC
 *  address The content of this field is undefined until loaded by the Application
 *  after the initialization process
 */
#define EMAC_ADDRLO_1    0xFFFFFFFFU
#define EMAC_ADDRLO_1_M  (EMAC_ADDRLO_1_V << EMAC_ADDRLO_1_S)
#define EMAC_ADDRLO_1_V  0xFFFFFFFFU
#define EMAC_ADDRLO_1_S  0

/** EMAC_MACADDRESS2HIGH_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS2HIGH_REG (DR_REG_EMAC_BASE + 0x50)
/** EMAC_ADDRHI_2 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_2    0x0000FFFFU
#define EMAC_ADDRHI_2_M  (EMAC_ADDRHI_2_V << EMAC_ADDRHI_2_S)
#define EMAC_ADDRHI_2_V  0x0000FFFFU
#define EMAC_ADDRHI_2_S  0
/** EMAC_MBC_2 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_2    0x0000003FU
#define EMAC_MBC_2_M  (EMAC_MBC_2_V << EMAC_MBC_2_S)
#define EMAC_MBC_2_V  0x0000003FU
#define EMAC_MBC_2_S  24
/** EMAC_SA_2 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_2    (BIT(30))
#define EMAC_SA_2_M  (EMAC_SA_2_V << EMAC_SA_2_S)
#define EMAC_SA_2_V  0x00000001U
#define EMAC_SA_2_S  30
/** EMAC_AE_2 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_2    (BIT(31))
#define EMAC_AE_2_M  (EMAC_AE_2_V << EMAC_AE_2_S)
#define EMAC_AE_2_V  0x00000001U
#define EMAC_AE_2_S  31

/** EMAC_MACADDRESS2LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS2LOW_REG (DR_REG_EMAC_BASE + 0x54)
/** EMAC_ADDRLO_2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_2    0xFFFFFFFFU
#define EMAC_ADDRLO_2_M  (EMAC_ADDRLO_2_V << EMAC_ADDRLO_2_S)
#define EMAC_ADDRLO_2_V  0xFFFFFFFFU
#define EMAC_ADDRLO_2_S  0

/** EMAC_MACADDRESS3HIGH_REG
 *  register
 *  Reserved
 */
#define EMAC_MACADDRESS3HIGH_REG (DR_REG_EMAC_BASE + 0x58)
/** EMAC_ADDRHI_3 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_3    0x0000FFFFU
#define EMAC_ADDRHI_3_M  (EMAC_ADDRHI_3_V << EMAC_ADDRHI_3_S)
#define EMAC_ADDRHI_3_V  0x0000FFFFU
#define EMAC_ADDRHI_3_S  0
/** EMAC_MBC_3 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_3    0x0000003FU
#define EMAC_MBC_3_M  (EMAC_MBC_3_V << EMAC_MBC_3_S)
#define EMAC_MBC_3_V  0x0000003FU
#define EMAC_MBC_3_S  24
/** EMAC_SA_3 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_3    (BIT(30))
#define EMAC_SA_3_M  (EMAC_SA_3_V << EMAC_SA_3_S)
#define EMAC_SA_3_V  0x00000001U
#define EMAC_SA_3_S  30
/** EMAC_AE_3 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_3    (BIT(31))
#define EMAC_AE_3_M  (EMAC_AE_3_V << EMAC_AE_3_S)
#define EMAC_AE_3_V  0x00000001U
#define EMAC_AE_3_S  31

/** EMAC_MACADDRESS3LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS3LOW_REG (DR_REG_EMAC_BASE + 0x5c)
/** EMAC_ADDRLO_3 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_3    0xFFFFFFFFU
#define EMAC_ADDRLO_3_M  (EMAC_ADDRLO_3_V << EMAC_ADDRLO_3_S)
#define EMAC_ADDRLO_3_V  0xFFFFFFFFU
#define EMAC_ADDRLO_3_S  0

/** EMAC_MACADDRESS4HIGH_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS4HIGH_REG (DR_REG_EMAC_BASE + 0x60)
/** EMAC_ADDRHI_4 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_4    0x0000FFFFU
#define EMAC_ADDRHI_4_M  (EMAC_ADDRHI_4_V << EMAC_ADDRHI_4_S)
#define EMAC_ADDRHI_4_V  0x0000FFFFU
#define EMAC_ADDRHI_4_S  0
/** EMAC_MBC_4 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_4    0x0000003FU
#define EMAC_MBC_4_M  (EMAC_MBC_4_V << EMAC_MBC_4_S)
#define EMAC_MBC_4_V  0x0000003FU
#define EMAC_MBC_4_S  24
/** EMAC_SA_4 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_4    (BIT(30))
#define EMAC_SA_4_M  (EMAC_SA_4_V << EMAC_SA_4_S)
#define EMAC_SA_4_V  0x00000001U
#define EMAC_SA_4_S  30
/** EMAC_AE_4 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_4    (BIT(31))
#define EMAC_AE_4_M  (EMAC_AE_4_V << EMAC_AE_4_S)
#define EMAC_AE_4_V  0x00000001U
#define EMAC_AE_4_S  31

/** EMAC_MACADDRESS4LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS4LOW_REG (DR_REG_EMAC_BASE + 0x64)
/** EMAC_ADDRLO_4 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_4    0xFFFFFFFFU
#define EMAC_ADDRLO_4_M  (EMAC_ADDRLO_4_V << EMAC_ADDRLO_4_S)
#define EMAC_ADDRLO_4_V  0xFFFFFFFFU
#define EMAC_ADDRLO_4_S  0

/** EMAC_MACADDRESS5HIGH_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS5HIGH_REG (DR_REG_EMAC_BASE + 0x68)
/** EMAC_ADDRHI_5 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_5    0x0000FFFFU
#define EMAC_ADDRHI_5_M  (EMAC_ADDRHI_5_V << EMAC_ADDRHI_5_S)
#define EMAC_ADDRHI_5_V  0x0000FFFFU
#define EMAC_ADDRHI_5_S  0
/** EMAC_MBC_5 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_5    0x0000003FU
#define EMAC_MBC_5_M  (EMAC_MBC_5_V << EMAC_MBC_5_S)
#define EMAC_MBC_5_V  0x0000003FU
#define EMAC_MBC_5_S  24
/** EMAC_SA_5 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_5    (BIT(30))
#define EMAC_SA_5_M  (EMAC_SA_5_V << EMAC_SA_5_S)
#define EMAC_SA_5_V  0x00000001U
#define EMAC_SA_5_S  30
/** EMAC_AE_5 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_5    (BIT(31))
#define EMAC_AE_5_M  (EMAC_AE_5_V << EMAC_AE_5_S)
#define EMAC_AE_5_V  0x00000001U
#define EMAC_AE_5_S  31

/** EMAC_MACADDRESS5LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS5LOW_REG (DR_REG_EMAC_BASE + 0x6c)
/** EMAC_ADDRLO_5 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_5    0xFFFFFFFFU
#define EMAC_ADDRLO_5_M  (EMAC_ADDRLO_5_V << EMAC_ADDRLO_5_S)
#define EMAC_ADDRLO_5_V  0xFFFFFFFFU
#define EMAC_ADDRLO_5_S  0

/** EMAC_MACADDRESS6HIGH_REG
 *  register
 *  Reserved
 */
#define EMAC_MACADDRESS6HIGH_REG (DR_REG_EMAC_BASE + 0x70)
/** EMAC_ADDRHI_6 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_6    0x0000FFFFU
#define EMAC_ADDRHI_6_M  (EMAC_ADDRHI_6_V << EMAC_ADDRHI_6_S)
#define EMAC_ADDRHI_6_V  0x0000FFFFU
#define EMAC_ADDRHI_6_S  0
/** EMAC_MBC_6 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_6    0x0000003FU
#define EMAC_MBC_6_M  (EMAC_MBC_6_V << EMAC_MBC_6_S)
#define EMAC_MBC_6_V  0x0000003FU
#define EMAC_MBC_6_S  24
/** EMAC_SA_6 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_6    (BIT(30))
#define EMAC_SA_6_M  (EMAC_SA_6_V << EMAC_SA_6_S)
#define EMAC_SA_6_V  0x00000001U
#define EMAC_SA_6_S  30
/** EMAC_AE_6 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_6    (BIT(31))
#define EMAC_AE_6_M  (EMAC_AE_6_V << EMAC_AE_6_S)
#define EMAC_AE_6_V  0x00000001U
#define EMAC_AE_6_S  31

/** EMAC_MACADDRESS6LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS6LOW_REG (DR_REG_EMAC_BASE + 0x74)
/** EMAC_ADDRLO_6 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_6    0xFFFFFFFFU
#define EMAC_ADDRLO_6_M  (EMAC_ADDRLO_6_V << EMAC_ADDRLO_6_S)
#define EMAC_ADDRLO_6_V  0xFFFFFFFFU
#define EMAC_ADDRLO_6_S  0

