espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_MACADDRESS7HIGH_REG
 *  register
 *  Reserved
 */
#define EMAC_MACADDRESS7HIGH_REG (DR_REG_EMAC_BASE + 0x78)
/** EMAC_ADDRHI_7 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRHI_7    0x0000FFFFU
#define EMAC_ADDRHI_7_M  (EMAC_ADDRHI_7_V << EMAC_ADDRHI_7_S)
#define EMAC_ADDRHI_7_V  0x0000FFFFU
#define EMAC_ADDRHI_7_S  0
/** EMAC_MBC_7 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_MBC_7    0x0000003FU
#define EMAC_MBC_7_M  (EMAC_MBC_7_V << EMAC_MBC_7_S)
#define EMAC_MBC_7_V  0x0000003FU
#define EMAC_MBC_7_S  24
/** EMAC_SA_7 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_SA_7    (BIT(30))
#define EMAC_SA_7_M  (EMAC_SA_7_V << EMAC_SA_7_S)
#define EMAC_SA_7_V  0x00000001U
#define EMAC_SA_7_S  30
/** EMAC_AE_7 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_AE_7    (BIT(31))
#define EMAC_AE_7_M  (EMAC_AE_7_V << EMAC_AE_7_S)
#define EMAC_AE_7_V  0x00000001U
#define EMAC_AE_7_S  31

/** EMAC_MACADDRESS7LOW_REG register
 *  Reserved
 */
#define EMAC_MACADDRESS7LOW_REG (DR_REG_EMAC_BASE + 0x7c)
/** EMAC_ADDRLO_7 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define EMAC_ADDRLO_7    0xFFFFFFFFU
#define EMAC_ADDRLO_7_M  (EMAC_ADDRLO_7_V << EMAC_ADDRLO_7_S)
#define EMAC_ADDRLO_7_V  0xFFFFFFFFU
#define EMAC_ADDRLO_7_S  0

/** EMAC_ANCONTROL_REG register
 *  Enables and/or restarts autonegotiation This register also enables the Physical
 *  Coding Sublayer _PCS_ loopback This register is present only when you select the
 *  TBI, RTBI, or SGMII interface in coreConsultant
 */
#define EMAC_ANCONTROL_REG (DR_REG_EMAC_BASE + 0xc0)
/** EMAC_RAN : R/W1S; bitpos: [9]; default: 0;
 *  Restart AutoNegotiation When set, this bit causes autonegotiation to restart if Bit
 *  12 _ANE_ is set This bit is selfclearing after autonegotiation starts This bit
 *  should be cleared for normal operation
 */
#define EMAC_RAN    (BIT(9))
#define EMAC_RAN_M  (EMAC_RAN_V << EMAC_RAN_S)
#define EMAC_RAN_V  0x00000001U
#define EMAC_RAN_S  9
/** EMAC_ANE : R/W; bitpos: [12]; default: 0;
 *  AutoNegotiation Enable When set, this bit enables the MAC to perform
 *  autonegotiation with the link partner Clearing this bit disables the autonegotiation
 */
#define EMAC_ANE    (BIT(12))
#define EMAC_ANE_M  (EMAC_ANE_V << EMAC_ANE_S)
#define EMAC_ANE_V  0x00000001U
#define EMAC_ANE_S  12
/** EMAC_ELE : R/W; bitpos: [14]; default: 0;
 *  External Loopback Enable When set, this bit causes the PHY to loopback the transmit
 *  data into the receive path The pcs_ewrap_o signal is asserted high when this bit is
 *  set
 */
#define EMAC_ELE    (BIT(14))
#define EMAC_ELE_M  (EMAC_ELE_V << EMAC_ELE_S)
#define EMAC_ELE_V  0x00000001U
#define EMAC_ELE_S  14
/** EMAC_ECD : R/W; bitpos: [16]; default: 0;
 *  Enable Comma Detect When set, this bit enables the PHY for comma detection and word
 *  resynchronization This bit controls the pcs_en_cdet_o signal on the TBI, RTBI, or
 *  SGMII interface
 */
#define EMAC_ECD    (BIT(16))
#define EMAC_ECD_M  (EMAC_ECD_V << EMAC_ECD_S)
#define EMAC_ECD_V  0x00000001U
#define EMAC_ECD_S  16
/** EMAC_LR : R/W; bitpos: [17]; default: 0;
 *  Lock to Reference When set, this bit enables the PHY to lock its PLL to the 125 MHz
 *  reference clock This bit controls the pcs_lck_ref_o signal on the TBI, RTBI, or
 *  SGMII interface
 */
#define EMAC_LR    (BIT(17))
#define EMAC_LR_M  (EMAC_LR_V << EMAC_LR_S)
#define EMAC_LR_V  0x00000001U
#define EMAC_LR_S  17
/** EMAC_SGMRAL : R/W; bitpos: [18]; default: 0;
 *  SGMII RAL Control When set, this bit forces the SGMII RAL block to operate in the
 *  speed configured in the Speed and Port Select bits of the MAC Configuration
 *  register This is useful when the SGMII interface is used in a direct MAC to MAC
 *  connection _without a PHY_ and any MAC must reconfigure the speed When reset, the
 *  SGMII RAL block operates according to the link speed status received on SGMII _from
 *  the PHY_ This bit is reserved _and RO_ if the SGMII PHY interface is not selected
 *  during core configuration
 */
#define EMAC_SGMRAL    (BIT(18))
#define EMAC_SGMRAL_M  (EMAC_SGMRAL_V << EMAC_SGMRAL_S)
#define EMAC_SGMRAL_V  0x00000001U
#define EMAC_SGMRAL_S  18

/** EMAC_ANSTATUS_REG register
 *  Indicates the link and autonegotiation status This register is present only when
 *  you select the TBI, RTBI, or SGMII interface in coreConsultant
 */
#define EMAC_ANSTATUS_REG (DR_REG_EMAC_BASE + 0xc4)
/** EMAC_LS : RO; bitpos: [2]; default: 0;
 *  Link Status This bit indicates whether the data channel _link_ is up or down For
 *  the TBI, RTBI or SGMII interfaces, if ANEG is going on, data cannot be transferred
 *  across the link and hence the link is given as down
 */
#define EMAC_LS    (BIT(2))
#define EMAC_LS_M  (EMAC_LS_V << EMAC_LS_S)
#define EMAC_LS_V  0x00000001U
#define EMAC_LS_S  2
/** EMAC_ANA : RO; bitpos: [3]; default: 1;
 *  AutoNegotiation Ability This bit is always high because the MAC supports auto
 *  negotiation
 */
#define EMAC_ANA    (BIT(3))
#define EMAC_ANA_M  (EMAC_ANA_V << EMAC_ANA_S)
#define EMAC_ANA_V  0x00000001U
#define EMAC_ANA_S  3
/** EMAC_ANC : RO; bitpos: [5]; default: 0;
 *  AutoNegotiation Complete When set, this bit indicates that the autonegotiation
 *  process is complete This bit is cleared when autonegotiation is reinitiated
 */
#define EMAC_ANC    (BIT(5))
#define EMAC_ANC_M  (EMAC_ANC_V << EMAC_ANC_S)
#define EMAC_ANC_V  0x00000001U
#define EMAC_ANC_S  5
/** EMAC_ES : RO; bitpos: [8]; default: 1;
 *  Extended Status This bit is tied to high if the TBI or RTBI interface is selected
 *  during core configuration indicating that the MAC supports extended status
 *  information in Register 53 _TBI Extended  Status Register_ This bit is tied to low
 *  if the SGMII interface is selected and the TBI or RTBI interface is not selected
 *  during core configuration indicating that Register 53 is not present
 */
#define EMAC_ES    (BIT(8))
#define EMAC_ES_M  (EMAC_ES_V << EMAC_ES_S)
#define EMAC_ES_V  0x00000001U
#define EMAC_ES_S  8

/** EMAC_AUTONEGOTIATIONADVERTISEMENT_REG register
 *  This register is configured before autonegotiation begins It contains the
 *  advertised ability of the MAC This register is present only when you select the TBI
 *  or RTBI interface in coreConsultant
 */
#define EMAC_AUTONEGOTIATIONADVERTISEMENT_REG (DR_REG_EMAC_BASE + 0xc8)
/** EMAC_FD : R/W; bitpos: [5]; default: 1;
 *  FullDuplex When set high, this bit indicates that the MAC supports the fullduplex
 *  mode
 */
#define EMAC_FD    (BIT(5))
#define EMAC_FD_M  (EMAC_FD_V << EMAC_FD_S)
#define EMAC_FD_V  0x00000001U
#define EMAC_FD_S  5
/** EMAC_HD : R/W; bitpos: [6]; default: 1;
 *  HalfDuplex When set high, this bit indicates that the MAC supports the halfduplex
 *  mode This bit is always low _and RO_ when the MAC is configured for the
 *  fullduplexonly mode
 */
#define EMAC_HD    (BIT(6))
#define EMAC_HD_M  (EMAC_HD_V << EMAC_HD_S)
#define EMAC_HD_V  0x00000001U
#define EMAC_HD_S  6
/** EMAC_PSE : R/W; bitpos: [8:7]; default: 3;
 *  Pause Encoding These bits provide an encoding for the Pause bits, indicating that
 *  the MAC is capable of configuring the Pause function as defined in IEEE 8023x The
 *  encoding of these bits is defined in IEEE 8023z, Section 37214
 */
#define EMAC_PSE    0x00000003U
#define EMAC_PSE_M  (EMAC_PSE_V << EMAC_PSE_S)
#define EMAC_PSE_V  0x00000003U
#define EMAC_PSE_S  7
/** EMAC_RFE : R/W; bitpos: [13:12]; default: 0;
 *  Remote Fault Encoding These bits provide a remote fault encoding, indicating to a
 *  link partner that a fault or error condition has occurred The encoding of these
 *  bits is defined in IEEE 8023z, Section 37215
 */
#define EMAC_RFE    0x00000003U
#define EMAC_RFE_M  (EMAC_RFE_V << EMAC_RFE_S)
#define EMAC_RFE_V  0x00000003U
#define EMAC_RFE_S  12
/** EMAC_NP : RO; bitpos: [15]; default: 0;
 *  Next Page Support This bit is always low because the MAC does not support the next
 *  page
 */
#define EMAC_NP    (BIT(15))
#define EMAC_NP_M  (EMAC_NP_V << EMAC_NP_S)
#define EMAC_NP_V  0x00000001U
#define EMAC_NP_S  15

