espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_AUTONEGOTIATIONLINKPARTNERABILITY_REG register
 *  Contains the advertised ability of the link partner Its value is valid after
 *  successful completion of autonegotiation or when a new base page has been received
 *  _indicated in the AutoNegotiation Expansion Register_ This register is present only
 *  when you select the TBI or RTBI interface in coreConsultant
 */
#define EMAC_AUTONEGOTIATIONLINKPARTNERABILITY_REG (DR_REG_EMAC_BASE + 0xcc)
/** EMAC_FD_ABILITY : RO; bitpos: [5]; default: 0;
 *  FullDuplex When set, this bit indicates that the link partner has the ability to
 *  operate in the full duplex mode When cleared, this bit indicates that the link
 *  partner does not have the ability to operate in the fullduplex mode
 */
#define EMAC_FD_ABILITY    (BIT(5))
#define EMAC_FD_ABILITY_M  (EMAC_FD_ABILITY_V << EMAC_FD_ABILITY_S)
#define EMAC_FD_ABILITY_V  0x00000001U
#define EMAC_FD_ABILITY_S  5
/** EMAC_HD_ABILITY : RO; bitpos: [6]; default: 0;
 *  HalfDuplex When set, this bit indicates that the link partner has the ability to
 *  operate in the halfduplex mode When cleared, this bit indicates that the link
 *  partner does not have the ability to operate in the halfduplex mode
 */
#define EMAC_HD_ABILITY    (BIT(6))
#define EMAC_HD_ABILITY_M  (EMAC_HD_ABILITY_V << EMAC_HD_ABILITY_S)
#define EMAC_HD_ABILITY_V  0x00000001U
#define EMAC_HD_ABILITY_S  6
/** EMAC_PSE_ABILITY : RO; bitpos: [8:7]; default: 0;
 *  Pause Encoding These bits provide an encoding for the Pause bits, indicating that
 *  the link partner's capability of configuring the Pause function as defined in the
 *  IEEE 8023x specification The encoding of these bits is defined in IEEE 8023z,
 *  Section 37214
 */
#define EMAC_PSE_ABILITY    0x00000003U
#define EMAC_PSE_ABILITY_M  (EMAC_PSE_ABILITY_V << EMAC_PSE_ABILITY_S)
#define EMAC_PSE_ABILITY_V  0x00000003U
#define EMAC_PSE_ABILITY_S  7
/** EMAC_RFE_ABILITY : RO; bitpos: [13:12]; default: 0;
 *  Remote Fault Encoding These bits provide a remote fault encoding, indicating a
 *  fault or error condition of the link partner The encoding of these bits is defined
 *  in IEEE 8023z, Section 37215
 */
#define EMAC_RFE_ABILITY    0x00000003U
#define EMAC_RFE_ABILITY_M  (EMAC_RFE_ABILITY_V << EMAC_RFE_ABILITY_S)
#define EMAC_RFE_ABILITY_V  0x00000003U
#define EMAC_RFE_ABILITY_S  12
/** EMAC_ACK : RO; bitpos: [14]; default: 0;
 *  Acknowledge When set, the autonegotiation function uses this bit to indicate that
 *  the link partner has successfully received the base page of the MAC When cleared,
 *  it indicates that the link partner did not successfully receive the base page of
 *  the MAC
 */
#define EMAC_ACK    (BIT(14))
#define EMAC_ACK_M  (EMAC_ACK_V << EMAC_ACK_S)
#define EMAC_ACK_V  0x00000001U
#define EMAC_ACK_S  14
/** EMAC_NO : RO; bitpos: [15]; default: 0;
 *  Next Page Support When set, this bit indicates that more next page information is
 *  available When cleared, this bit indicates that next page exchange is not desired
 */
#define EMAC_NO    (BIT(15))
#define EMAC_NO_M  (EMAC_NO_V << EMAC_NO_S)
#define EMAC_NO_V  0x00000001U
#define EMAC_NO_S  15

/** EMAC_AUTONEGOTIATIONEXPANSION_REG register
 *  Indicates whether a new base page has been received from the link partner This
 *  register is present only when you select the TBI or RTBI interface in coreConsultant
 */
#define EMAC_AUTONEGOTIATIONEXPANSION_REG (DR_REG_EMAC_BASE + 0xd0)
/** EMAC_NPR : RO; bitpos: [1]; default: 0;
 *  New Page Received When set, this bit indicates that the MAC has received a new page
 *  This bit is cleared when read
 */
#define EMAC_NPR    (BIT(1))
#define EMAC_NPR_M  (EMAC_NPR_V << EMAC_NPR_S)
#define EMAC_NPR_V  0x00000001U
#define EMAC_NPR_S  1
/** EMAC_NPA : RO; bitpos: [2]; default: 0;
 *  Next Page Ability This bit is always low because the MAC does not support the next
 *  page function
 */
#define EMAC_NPA    (BIT(2))
#define EMAC_NPA_M  (EMAC_NPA_V << EMAC_NPA_S)
#define EMAC_NPA_V  0x00000001U
#define EMAC_NPA_S  2

/** EMAC_TBIEXTENDEDSTATUS_REG register
 *  Indicates all modes of operation of the MAC This register is present only when you
 *  select the TBI or RTBI interface in coreConsultant
 */
#define EMAC_TBIEXTENDEDSTATUS_REG (DR_REG_EMAC_BASE + 0xd4)
/** EMAC_GHD : RO; bitpos: [14]; default: 1;
 *  1000BASEX HalfDuplex Capable This bit indicates that the MAC is able to perform the
 *  halfduplex and 1000BASEX operations This bit is always low when the MAC is
 *  configured for the fullduplexonly operation during core configuration
 */
#define EMAC_GHD    (BIT(14))
#define EMAC_GHD_M  (EMAC_GHD_V << EMAC_GHD_S)
#define EMAC_GHD_V  0x00000001U
#define EMAC_GHD_S  14
/** EMAC_GFD : RO; bitpos: [15]; default: 1;
 *  1000BASEX FullDuplex Capable This bit indicates that the MAC is able to perform the
 *  fullduplex and 1000BASEX operations
 */
#define EMAC_GFD    (BIT(15))
#define EMAC_GFD_M  (EMAC_GFD_V << EMAC_GFD_S)
#define EMAC_GFD_V  0x00000001U
#define EMAC_GFD_S  15

/** EMAC_SGMII_RGMII_SMIICONTROLANDSTATUS_REG register
 *  Indicates the status signals received from the PHY through the SGMII, RGMII, or
 *  SMII interface This register is present only when you select the SGMII, RGMII, or
 *  SMII interface in coreConsultant
 */
#define EMAC_SGMII_RGMII_SMIICONTROLANDSTATUS_REG (DR_REG_EMAC_BASE + 0xd8)
/** EMAC_LNKMOD : RO; bitpos: [0]; default: 0;
 *  Link Mode This bit indicates the current mode of operation of the link: 1’b0:
 *  Halfduplex mode 1’b1: Fullduplex mode
 */
#define EMAC_LNKMOD    (BIT(0))
#define EMAC_LNKMOD_M  (EMAC_LNKMOD_V << EMAC_LNKMOD_S)
#define EMAC_LNKMOD_V  0x00000001U
#define EMAC_LNKMOD_S  0
/** EMAC_LNKSPEED : RO; bitpos: [2:1]; default: 2;
 *  Link Speed
 */
#define EMAC_LNKSPEED    0x00000003U
#define EMAC_LNKSPEED_M  (EMAC_LNKSPEED_V << EMAC_LNKSPEED_S)
#define EMAC_LNKSPEED_V  0x00000003U
#define EMAC_LNKSPEED_S  1
/** EMAC_LNKSTS : RO; bitpos: [3]; default: 0;
 *  Link Status This bit indicates whether the link between the local PHY and the
 *  remote PHY is up or down It gives the status of the link between the SGMII of MAC
 *  and the SGMII of the local PHY The status bits are received from the local PHY
 *  during ANEG between he MAC and PHY on the SGMII link
 */
#define EMAC_LNKSTS    (BIT(3))
#define EMAC_LNKSTS_M  (EMAC_LNKSTS_V << EMAC_LNKSTS_S)
#define EMAC_LNKSTS_V  0x00000001U
#define EMAC_LNKSTS_S  3
/** EMAC_JABTO : RO; bitpos: [4]; default: 0;
 *  Jabber Timeout This bit indicates whether there is jabber timeout error _1'b1_ in
 *  the received frame This bit is reserved when the MAC is configured for the SGMII or
 *  RGMII PHY interface
 */
#define EMAC_JABTO    (BIT(4))
#define EMAC_JABTO_M  (EMAC_JABTO_V << EMAC_JABTO_S)
#define EMAC_JABTO_V  0x00000001U
#define EMAC_JABTO_S  4
/** EMAC_FALSCARDET : RO; bitpos: [5]; default: 0;
 *  False Carrier Detected This bit indicates whether the SMII PHY detected false
 *  carrier _1'b1_ This bit is reserved when the MAC is configured for the SGMII or
 *  RGMII PHY interface
 */
#define EMAC_FALSCARDET    (BIT(5))
#define EMAC_FALSCARDET_M  (EMAC_FALSCARDET_V << EMAC_FALSCARDET_S)
#define EMAC_FALSCARDET_V  0x00000001U
#define EMAC_FALSCARDET_S  5
/** EMAC_SMIDRXS : R/W; bitpos: [16]; default: 0;
 *  Delay SMII RX Data Sampling with respect to the SMII SYNC Signal When set, the
 *  first bit of the SMII RX data is sampled one cycle after the SMII SYNC signal When
 *  reset, the first bit of the SMII RX data is sampled along with the SMII SYNC signal
 *  If the SMII PHY Interface with source synchronous mode is selected during core
 *  configuration, this bit is reserved _RO with default value_
 */
#define EMAC_SMIDRXS    (BIT(16))
#define EMAC_SMIDRXS_M  (EMAC_SMIDRXS_V << EMAC_SMIDRXS_S)
#define EMAC_SMIDRXS_V  0x00000001U
#define EMAC_SMIDRXS_S  16

/** EMAC_WATCHDOGTIMEOUT_REG register
 *  Controls the watchdog timeout for received frames
 */
#define EMAC_WATCHDOGTIMEOUT_REG (DR_REG_EMAC_BASE + 0xdc)
/** EMAC_WTO : R/W; bitpos: [13:0]; default: 0;
 *  Watchdog Timeout When Bit 16 _PWE_ is set and Bit 23 _WD_ of Register 0 _MAC
 *  Configuration Register_ is reset, this field is used as watchdog timeout for a
 *  received frame If the length of a received frame exceeds the value of this field,
 *  such frame is terminated and declared as an error frame Note: When Bit 16 _PWE_ is
 *  set, the value in this field should be more than 1,522 _0x05F2_ Otherwise, the IEEE
 *  Std 8023specified valid tagged frames are declared as error frames and are dropped
 */
#define EMAC_WTO    0x00003FFFU
#define EMAC_WTO_M  (EMAC_WTO_V << EMAC_WTO_S)
#define EMAC_WTO_V  0x00003FFFU
#define EMAC_WTO_S  0
/** EMAC_PWE : R/W; bitpos: [16]; default: 0;
 *  Programmable Watchdog Enable When this bit is set and Bit 23 _WD_ of Register 0
 *  _MAC Configuration Register_ is reset, the WTO field _Bits[13:0]_ is used as
 *  watchdog timeout for a received frame When this bit is cleared, the watchdog
 *  timeout for a received frame is controlled by the setting of Bit 23 _WD_ and Bit 20
 *  _JE_ in Register 0 _MAC Configuration Register_
 */
#define EMAC_PWE    (BIT(16))
#define EMAC_PWE_M  (EMAC_PWE_V << EMAC_PWE_S)
#define EMAC_PWE_V  0x00000001U
#define EMAC_PWE_S  16

/** EMAC_GENERALPURPOSEIO_REG register
 *  Provides the control to drive up to 4 bits of output ports _GPO_ and also provides
 *  the status of up to 4 input ports _GPIS_
 */
#define EMAC_GENERALPURPOSEIO_REG (DR_REG_EMAC_BASE + 0xe0)
/** EMAC_GPIS : R/W; bitpos: [3:0]; default: 0;
 *  General Purpose Input Status This field gives the status of the signals connected
 *  to the gpi_i input ports This field is of the following types based on the setting
 *  of the corresponding GPIT field of this register: Latchedlow _LL_: This field is
 *  cleared when the corresponding gpi_i input becomes low This field remains low until
 *  the host reads this field After this, this field reflects the current value of the
 *  gpi_i input Latchedhigh _LH_: This field is set when the corresponding gpi_i input
 *  becomes high This field remains high until the host reads this field After this,
 *  this field reflects the current value of the gpi_i input The number of bits
 *  available in this field depend on the GP Input Signal Width option Other bits are
 *  not used _reserved and always reset_
 */
#define EMAC_GPIS    0x0000000FU
#define EMAC_GPIS_M  (EMAC_GPIS_V << EMAC_GPIS_S)
#define EMAC_GPIS_V  0x0000000FU
#define EMAC_GPIS_S  0
/** EMAC_GPO : R/W; bitpos: [11:8]; default: 0;
 *  General Purpose Output When this bit is set, it directly drives the gpo_o output
 *  ports When this bit is reset, it does not directly drive the gpo_o output ports The
 *  number of bits available in this field depend on the GP Output Signal Width option
 *  Other bits are not used _reserved and always reset_
 */
#define EMAC_GPO    0x0000000FU
#define EMAC_GPO_M  (EMAC_GPO_V << EMAC_GPO_S)
#define EMAC_GPO_V  0x0000000FU
#define EMAC_GPO_S  8
/** EMAC_GPIE : R/W; bitpos: [19:16]; default: 0;
 *  GPI Interrupt Enable When this bit is set and the programmed event _LL or LH_
 *  occurs on the corresponding GPIS bit, Bit 11 _GPIIS_ of Register 14 _Interrupt
 *  Status Register_ is set Accordingly, the interrupt is generated on the mci_intr_o
 *  or sbd_intr_o The GPIIS bit is cleared when the host reads the Bits[7:0] of this
 *  register When reset, Bit 11 _GPIIS_ of Register 14 _Interrupt Status Register_ is
 *  not set when any event occurs on the corresponding GPIS bits The number of bits
 *  available in this field depend on the GP Input Signal Width option Other bits are
 *  not used _reserved and always reset_
 */
#define EMAC_GPIE    0x0000000FU
#define EMAC_GPIE_M  (EMAC_GPIE_V << EMAC_GPIE_S)
#define EMAC_GPIE_V  0x0000000FU
#define EMAC_GPIE_S  16
/** EMAC_GPIT : R/W; bitpos: [27:24]; default: 0;
 *  GPI Type When set, this bit indicates that the corresponding GPIS is of latchedlow
 *  _LL_ type When reset, this bit indicates that the corresponding GPIS is of
 *  latchedhigh _LH_ type The number of bits available in this field depend on the GP
 *  Input Signal Width option Other bits are not used _reserved and always reset_
 */
#define EMAC_GPIT    0x0000000FU
#define EMAC_GPIT_M  (EMAC_GPIT_V << EMAC_GPIT_S)
#define EMAC_GPIT_V  0x0000000FU
#define EMAC_GPIT_S  24

/** EMAC_LAYER3ANDLAYER4CONTROLREGISTER0_REG register
 *  Controls the operations of the Layer 3 and Layer 4 frame filtering
 */
#define EMAC_LAYER3ANDLAYER4CONTROLREGISTER0_REG (DR_REG_EMAC_BASE + 0x400)
/** EMAC_L3PEN0 : R/W; bitpos: [0]; default: 0;
 *  Layer 3 Protocol Enable When set, this bit indicates that the Layer 3 IP Source or
 *  Destination Address matching is enabled for the IPv6 frames When reset, this bit
 *  indicates that the Layer 3 IP Source or Destination Address matching is enabled for
 *  the IPv4 frames The Layer 3 matching is done only when either L3SAM0 or L3DAM0 bit
 *  is set high
 */
#define EMAC_L3PEN0    (BIT(0))
#define EMAC_L3PEN0_M  (EMAC_L3PEN0_V << EMAC_L3PEN0_S)
#define EMAC_L3PEN0_V  0x00000001U
#define EMAC_L3PEN0_S  0
/** EMAC_L3SAM0 : R/W; bitpos: [2]; default: 0;
 *  Layer 3 IP SA Match Enable When set, this bit indicates that the Layer 3 IP Source
 *  Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP
 *  Source Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should set
 *  either this bit or Bit 4 _L3DAM0_ because either IPv6 SA or DA can be checked for
 *  filtering
 */
#define EMAC_L3SAM0    (BIT(2))
#define EMAC_L3SAM0_M  (EMAC_L3SAM0_V << EMAC_L3SAM0_S)
#define EMAC_L3SAM0_V  0x00000001U
#define EMAC_L3SAM0_S  2
/** EMAC_L3SAIM0 : R/W; bitpos: [3]; default: 0;
 *  Layer 3 IP SA Inverse Match Enable When set, this bit indicates that the Layer 3 IP
 *  Source Address field is enabled for inverse matching When reset, this bit indicates
 *  that the Layer 3 IP Source Address field is enabled for perfect matching This bit
 *  is valid and applicable only when Bit 2 _L3SAM0_ is set high
 */
#define EMAC_L3SAIM0    (BIT(3))
#define EMAC_L3SAIM0_M  (EMAC_L3SAIM0_V << EMAC_L3SAIM0_S)
#define EMAC_L3SAIM0_V  0x00000001U
#define EMAC_L3SAIM0_S  3
/** EMAC_L3DAM0 : R/W; bitpos: [4]; default: 0;
 *  Layer 3 IP DA Match Enable When set, this bit indicates that Layer 3 IP Destination
 *  Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP
 *  Destination Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should
 *  set either this bit or Bit 2 _L3SAM0_ because either IPv6 DA or SA can be checked
 *  for filtering
 */
#define EMAC_L3DAM0    (BIT(4))
#define EMAC_L3DAM0_M  (EMAC_L3DAM0_V << EMAC_L3DAM0_S)
#define EMAC_L3DAM0_V  0x00000001U
#define EMAC_L3DAM0_S  4
/** EMAC_L3DAIM0 : R/W; bitpos: [5]; default: 0;
 *  Layer 3 IP DA Inverse Match Enable When set, this bit indicates that the Layer 3 IP
 *  Destination Address field is enabled for inverse matching When reset, this bit
 *  indicates that the Layer 3 IP Destination Address field is enabled for perfect
 *  matching This bit is valid and applicable only when Bit 4 _L3DAM0_ is set high
 */
#define EMAC_L3DAIM0    (BIT(5))
#define EMAC_L3DAIM0_M  (EMAC_L3DAIM0_V << EMAC_L3DAIM0_S)
#define EMAC_L3DAIM0_V  0x00000001U
#define EMAC_L3DAIM0_S  5
/** EMAC_L3HSBM0 : R/W; bitpos: [10:6]; default: 0;
 *  Layer 3 IP SA Higher Bits Match IPv4 Frames: This field contains the number of
 *  lower bits of IP Source Address that are masked for matching in the IPv4 frames The
 *  following list describes the values of this field: 0: No bits are masked 1: LSb[0]
 *  is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6
 *  Frames: This field contains Bits [4:0] of the field that indicates the number of
 *  higher bits of IP Source or Destination Address matched in the IPv6 frames This
 *  field is valid and applicable only if L3DAM0 or L3SAM0 is set high
 */
#define EMAC_L3HSBM0    0x0000001FU
#define EMAC_L3HSBM0_M  (EMAC_L3HSBM0_V << EMAC_L3HSBM0_S)
#define EMAC_L3HSBM0_V  0x0000001FU
#define EMAC_L3HSBM0_S  6
/** EMAC_L3HDBM0 : R/W; bitpos: [15:11]; default: 0;
 *  Layer 3 IP DA Higher Bits Match IPv4 Frames: This field contains the number of
 *  higher bits of IP Destination Address that are matched in the IPv4 frames The
 *  following list describes the values of this field: 0: No bits are masked 1: LSb[0]
 *  is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6
 *  Frames: Bits [12:11] of this field correspond to Bits [6:5] of L3HSBM0, which
 *  indicate the number of lower bits of IP Source or Destination Address that are
 *  masked in the IPv6 frames The following list describes the concatenated values of
 *  the L3HDBM0[1:0] and L3HSBM0 bits: 0: No bits are masked 1: LSb[0] is masked 2: Two
 *  LSbs [1:0] are masked … 127: All bits except MSb are masked This field is valid and
 *  applicable only if L3DAM0 or L3SAM0 is set high
 */
#define EMAC_L3HDBM0    0x0000001FU
#define EMAC_L3HDBM0_M  (EMAC_L3HDBM0_V << EMAC_L3HDBM0_S)
#define EMAC_L3HDBM0_V  0x0000001FU
#define EMAC_L3HDBM0_S  11
/** EMAC_L4PEN0 : R/W; bitpos: [16]; default: 0;
 *  Layer 4 Protocol Enable When set, this bit indicates that the Source and
 *  Destination Port number fields for UDP frames are used for matching When reset,
 *  this bit indicates that the Source and Destination Port number fields for TCP
 *  frames are used for matching The Layer 4 matching is done only when either L4SPM0
 *  or L4DPM0 bit is set high
 */
#define EMAC_L4PEN0    (BIT(16))
#define EMAC_L4PEN0_M  (EMAC_L4PEN0_V << EMAC_L4PEN0_S)
#define EMAC_L4PEN0_V  0x00000001U
#define EMAC_L4PEN0_S  16
/** EMAC_L4SPM0 : R/W; bitpos: [18]; default: 0;
 *  Layer 4 Source Port Match Enable When set, this bit indicates that the Layer 4
 *  Source Port number field is enabled for matching When reset, the MAC ignores the
 *  Layer 4 Source Port number field for matching
 */
#define EMAC_L4SPM0    (BIT(18))
#define EMAC_L4SPM0_M  (EMAC_L4SPM0_V << EMAC_L4SPM0_S)
#define EMAC_L4SPM0_V  0x00000001U
#define EMAC_L4SPM0_S  18
/** EMAC_L4SPIM0 : R/W; bitpos: [19]; default: 0;
 *  Layer 4 Source Port Inverse Match Enable When set, this bit indicates that the
 *  Layer 4 Source Port number field is enabled for inverse matching When reset, this
 *  bit indicates that the Layer 4 Source Port number field is enabled for perfect
 *  matching This bit is valid and applicable only when Bit 18 _L4SPM0_ is set high
 */
#define EMAC_L4SPIM0    (BIT(19))
#define EMAC_L4SPIM0_M  (EMAC_L4SPIM0_V << EMAC_L4SPIM0_S)
#define EMAC_L4SPIM0_V  0x00000001U
#define EMAC_L4SPIM0_S  19
/** EMAC_L4DPM0 : R/W; bitpos: [20]; default: 0;
 *  Layer 4 Destination Port Match Enable When set, this bit indicates that the Layer 4
 *  Destination Port number field is enabled for matching When reset, the MAC ignores
 *  the Layer 4 Destination Port number field for matching
 */
#define EMAC_L4DPM0    (BIT(20))
#define EMAC_L4DPM0_M  (EMAC_L4DPM0_V << EMAC_L4DPM0_S)
#define EMAC_L4DPM0_V  0x00000001U
#define EMAC_L4DPM0_S  20
/** EMAC_L4DPIM0 : R/W; bitpos: [21]; default: 0;
 *  Layer 4 Destination Port Inverse Match Enable When set, this bit indicates that the
 *  Layer 4 Destination Port number field is enabled for inverse matching When reset,
 *  this bit indicates that the Layer 4 Destination Port number field is enabled for
 *  perfect matching This bit is valid and applicable only when Bit 20 _L4DPM0_ is set
 *  high
 */
#define EMAC_L4DPIM0    (BIT(21))
#define EMAC_L4DPIM0_M  (EMAC_L4DPIM0_V << EMAC_L4DPIM0_S)
#define EMAC_L4DPIM0_V  0x00000001U
#define EMAC_L4DPIM0_S  21

