espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_LAYER4ADDRESSREGISTER0_REG register
 *  Layer 4 Port number field It contains the 16bit Source and Destination Port numbers
 *  of the TCP or UDP frame
 */
#define EMAC_LAYER4ADDRESSREGISTER0_REG (DR_REG_EMAC_BASE + 0x404)
/** EMAC_L4SP0 : R/W; bitpos: [15:0]; default: 0;
 *  Layer 4 Source Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20 _L4DPM0_
 *  is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field
 *  contains the value to be matched with the TCP Source Port Number field in the IPv4
 *  or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in Register 256
 *  _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with the UDP Source Port Number field in the IPv4 or IPv6 frames
 */
#define EMAC_L4SP0    0x0000FFFFU
#define EMAC_L4SP0_M  (EMAC_L4SP0_V << EMAC_L4SP0_S)
#define EMAC_L4SP0_V  0x0000FFFFU
#define EMAC_L4SP0_S  0
/** EMAC_L4DP0 : R/W; bitpos: [31:16]; default: 0;
 *  Layer 4 Destination Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20
 *  _L4DPM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this
 *  field contains the value to be matched with the TCP Destination Port Number field
 *  in the IPv4 or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in
 *  Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the
 *  value to be matched with the UDP Destination Port Number field in the IPv4 or IPv6
 *  frames
 */
#define EMAC_L4DP0    0x0000FFFFU
#define EMAC_L4DP0_M  (EMAC_L4DP0_V << EMAC_L4DP0_S)
#define EMAC_L4DP0_V  0x0000FFFFU
#define EMAC_L4DP0_S  16

/** EMAC_LAYER3ADDRESS0REGISTER0_REG register
 *  Layer 3 Address field For IPv4 frames, it contains the 32bit IP Source Address
 *  field For IPv6 frames, it contains Bits [31:0] of the 128bit IP Source Address or
 *  Destination Address field
 */
#define EMAC_LAYER3ADDRESS0REGISTER0_REG (DR_REG_EMAC_BASE + 0x410)
/** EMAC_L3A00 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 0 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [31:0] of the IP Source Address field in the IPv6 frames When Bit
 *  0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control
 *  Register 0_, this field contains the value to be matched with Bits [31:0] of the IP
 *  Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset and Bit 2
 *  _L3SAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this
 *  field contains the value to be matched with the IP Source Address field in the IPv4
 *  frames
 */
#define EMAC_L3A00    0xFFFFFFFFU
#define EMAC_L3A00_M  (EMAC_L3A00_V << EMAC_L3A00_S)
#define EMAC_L3A00_V  0xFFFFFFFFU
#define EMAC_L3A00_S  0

/** EMAC_LAYER3ADDRESS1REGISTER0_REG register
 *  Layer 3 Address 1 field For IPv4 frames, it contains the 32bit IP Destination
 *  Address field For IPv6 frames, it contains Bits [63:32] of the 128bit IP Source
 *  Address or Destination Address field
 */
#define EMAC_LAYER3ADDRESS1REGISTER0_REG (DR_REG_EMAC_BASE + 0x414)
/** EMAC_L3A10 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 1 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [63:32] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains the value to be matched with Bits [63:32]
 *  of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset
 *  and Bit 4 _L3DAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_,
 *  this field contains the value to be matched with the IP Destination Address field
 *  in the IPv4 frames
 */
#define EMAC_L3A10    0xFFFFFFFFU
#define EMAC_L3A10_M  (EMAC_L3A10_V << EMAC_L3A10_S)
#define EMAC_L3A10_V  0xFFFFFFFFU
#define EMAC_L3A10_S  0

/** EMAC_LAYER3ADDRESS2REGISTER0_REG register
 *  Layer 3 Address 2 field This register is reserved for IPv4 frames For IPv6 frames,
 *  it contains Bits [95:64] of the 128bit IP Source Address or Destination Address
 *  field
 */
#define EMAC_LAYER3ADDRESS2REGISTER0_REG (DR_REG_EMAC_BASE + 0x418)
/** EMAC_L3A20 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 2 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [95:64] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains value to be matched with Bits [95:64] of
 *  the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset in
 *  Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used
 */
#define EMAC_L3A20    0xFFFFFFFFU
#define EMAC_L3A20_M  (EMAC_L3A20_V << EMAC_L3A20_S)
#define EMAC_L3A20_V  0xFFFFFFFFU
#define EMAC_L3A20_S  0

/** EMAC_LAYER3ADDRESS3REGISTER0_REG register
 *  Layer 3 Address 3 field This register is reserved for IPv4 frames For IPv6 frames,
 *  it contains Bits [127:96] of the 128bit IP Source Address or Destination Address
 *  field
 */
#define EMAC_LAYER3ADDRESS3REGISTER0_REG (DR_REG_EMAC_BASE + 0x41c)
/** EMAC_L3A30 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 3 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [127:96] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains the value to be matched with Bits [127:96]
 *  of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset
 *  in Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used
 */
#define EMAC_L3A30    0xFFFFFFFFU
#define EMAC_L3A30_M  (EMAC_L3A30_V << EMAC_L3A30_S)
#define EMAC_L3A30_V  0xFFFFFFFFU
#define EMAC_L3A30_S  0

/** EMAC_HASHTABLEREGISTER0_REG register
 *  This register contains the first 32 bits of the hash table when the width of the
 *  Hash table is 128 bits or 256 bits
 */
#define EMAC_HASHTABLEREGISTER0_REG (DR_REG_EMAC_BASE + 0x500)
/** EMAC_HT31T0 : R/W; bitpos: [31:0]; default: 0;
 *  First 32 bits of Hash Table This field contains the first 32 Bits _31:0_ of the
 *  Hash table Note Registers 321 through 327 are similar to Register 320 _Hash Table
 *  Register 0_ Registers 324 through 327 are present only when you select the 256bit
 *  Hash table during core configuration
 */
#define EMAC_HT31T0    0xFFFFFFFFU
#define EMAC_HT31T0_M  (EMAC_HT31T0_V << EMAC_HT31T0_S)
#define EMAC_HT31T0_V  0xFFFFFFFFU
#define EMAC_HT31T0_S  0

/** EMAC_VLANTAGINCLUSIONORREPLACEMENT_REG register
 *  This register contains the VLAN tag for insertion into or replacement in the
 *  transmit frames
 */
#define EMAC_VLANTAGINCLUSIONORREPLACEMENT_REG (DR_REG_EMAC_BASE + 0x584)
/** EMAC_VLT : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Tag for Transmit Frames This field contains the value of the VLAN tag to be
 *  inserted or replaced The value must only be changed when the transmit lines are
 *  inactive or during the initialization phase Bits[15:13] are the User Priority, Bit
 *  12 is the CFI/DEI, and Bits[11:0] are the VLAN tag’s VID field
 */
#define EMAC_VLT    0x0000FFFFU
#define EMAC_VLT_M  (EMAC_VLT_V << EMAC_VLT_S)
#define EMAC_VLT_V  0x0000FFFFU
#define EMAC_VLT_S  0
/** EMAC_VLC : R/W; bitpos: [17:16]; default: 0;
 *  VLAN Tag Control in Transmit Frames 2’b00: No VLAN tag deletion, insertion, or
 *  replacement 2’b01: VLAN tag deletion The MAC removes the VLAN type _bytes 13 and
 *  14_ and VLAN tag _bytes 15 and 16_ of all transmitted frames with VLAN tags 2’b10:
 *  VLAN tag insertion The MAC inserts VLT in bytes 15 and 16 of the frame after
 *  inserting the Type value _0x8100/0x88a8_ in bytes 13 and 14 This operation is
 *  performed on all transmitted frames, irrespective of whether they already have a
 *  VLAN tag 2’b11: VLAN tag replacement The MAC replaces VLT in bytes 15 and 16 of all
 *  VLANtype transmitted frames _Bytes 13 and 14 are 0x8100/0x88a8_ Note: Changes to
 *  this field take effect only on the start of a frame If you write this register
 *  field when a frame is being transmitted, only the subsequent frame can use the
 *  updated value, that is, the current frame does not use the updated value
 */
#define EMAC_VLC    0x00000003U
#define EMAC_VLC_M  (EMAC_VLC_V << EMAC_VLC_S)
#define EMAC_VLC_V  0x00000003U
#define EMAC_VLC_S  16
/** EMAC_VLP : R/W; bitpos: [18]; default: 0;
 *  VLAN Priority Control When this bit is set, the control Bits [17:16] are used for
 *  VLAN deletion, insertion, or replacement When this bit is reset, the
 *  mti_vlan_ctrl_i control input is used, and Bits [17:16] are ignored
 */
#define EMAC_VLP    (BIT(18))
#define EMAC_VLP_M  (EMAC_VLP_V << EMAC_VLP_S)
#define EMAC_VLP_V  0x00000001U
#define EMAC_VLP_S  18
/** EMAC_CSVL : R/W; bitpos: [19]; default: 0;
 *  CVLAN or SVLAN When this bit is set, SVLAN type _0x88A8_ is inserted or replaced in
 *  the 13th and 14th bytes of transmitted frames When this bit is reset, CVLAN type
 *  _0x8100_ is inserted or replaced in the transmitted frames
 */
#define EMAC_CSVL    (BIT(19))
#define EMAC_CSVL_M  (EMAC_CSVL_V << EMAC_CSVL_S)
#define EMAC_CSVL_V  0x00000001U
#define EMAC_CSVL_S  19

/** EMAC_VLANHASHTABLE_REG register
 *  This register contains the VLAN hash table
 */
#define EMAC_VLANHASHTABLE_REG (DR_REG_EMAC_BASE + 0x588)
/** EMAC_VLHT : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Hash Table This field contains the 16bit VLAN Hash Table
 */
#define EMAC_VLHT    0x0000FFFFU
#define EMAC_VLHT_M  (EMAC_VLHT_V << EMAC_VLHT_S)
#define EMAC_VLHT_V  0x0000FFFFU
#define EMAC_VLHT_S  0

/** EMAC_TIMESTAMPCONTROL_REG register
 *  Controls the timestamp generation and update logic This register is present only
 *  when IEEE1588 timestamping is enabled during coreConsultant configuration
 */
#define EMAC_TIMESTAMPCONTROL_REG (DR_REG_EMAC_BASE + 0x700)
/** EMAC_TSENA : R/W; bitpos: [0]; default: 0;
 *  Timestamp Enable When set, the timestamp is added for the transmit and receive
 *  frames When disabled, timestamp is not added for the transmit and receive frames
 *  and the Timestamp Generator is also suspended You need to initialize the Timestamp
 *  _system time_ after enabling this mode On the receive side, the MAC processes the
 *  1588 frames only if this bit is set
 */
#define EMAC_TSENA    (BIT(0))
#define EMAC_TSENA_M  (EMAC_TSENA_V << EMAC_TSENA_S)
#define EMAC_TSENA_V  0x00000001U
#define EMAC_TSENA_S  0
/** EMAC_TSCFUPDT : R/W; bitpos: [1]; default: 0;
 *  Timestamp Fine or Coarse Update When set, this bit indicates that the system times
 *  update should be done using the fine update method When reset, it indicates the
 *  system timestamp update should be done using the Coarse method
 */
#define EMAC_TSCFUPDT    (BIT(1))
#define EMAC_TSCFUPDT_M  (EMAC_TSCFUPDT_V << EMAC_TSCFUPDT_S)
#define EMAC_TSCFUPDT_V  0x00000001U
#define EMAC_TSCFUPDT_S  1
/** EMAC_TSINIT : R/W1S; bitpos: [2]; default: 0;
 *  Timestamp Initialize When set, the system time is initialized _overwritten_ with
 *  the value specified in the Register 452 _System Time  Seconds Update Register_ and
 *  Register 453 _System Time  Nanoseconds Update Register_ This bit should be read
 *  zero before updating it This bit is reset when the initialization is complete The
 *  “Timestamp Higher Word” register _if enabled during core configuration_ can only be
 *  initialized
 */
#define EMAC_TSINIT    (BIT(2))
#define EMAC_TSINIT_M  (EMAC_TSINIT_V << EMAC_TSINIT_S)
#define EMAC_TSINIT_V  0x00000001U
#define EMAC_TSINIT_S  2
/** EMAC_TSUPDT : R/W1S; bitpos: [3]; default: 0;
 *  Timestamp Update When set, the system time is updated _added or subtracted_ with
 *  the value specified in Register 452 _System Time  Seconds Update Register_ and
 *  Register 453 _System Time  Nanoseconds Update Register_ This bit should be read
 *  zero before updating it This bit is reset when the update is completed in hardware
 *  The “Timestamp Higher Word” register _if enabled during core configuration_ is not
 *  updated
 */
#define EMAC_TSUPDT    (BIT(3))
#define EMAC_TSUPDT_M  (EMAC_TSUPDT_V << EMAC_TSUPDT_S)
#define EMAC_TSUPDT_V  0x00000001U
#define EMAC_TSUPDT_S  3
/** EMAC_TSTRIG : R/W1S; bitpos: [4]; default: 0;
 *  Timestamp Interrupt Trigger Enable When set, the timestamp interrupt is generated
 *  when the System Time becomes greater than the value written in the Target Time
 *  register This bit is reset after the generation of the Timestamp Trigger Interrupt
 */
#define EMAC_TSTRIG    (BIT(4))
#define EMAC_TSTRIG_M  (EMAC_TSTRIG_V << EMAC_TSTRIG_S)
#define EMAC_TSTRIG_V  0x00000001U
#define EMAC_TSTRIG_S  4
/** EMAC_TSADDREG : R/W1S; bitpos: [5]; default: 0;
 *  Addend Reg Update When set, the content of the Timestamp Addend register is updated
 *  in the PTP block for fine correction This is cleared when the update is completed
 *  This register bit should be zero before setting it
 */
#define EMAC_TSADDREG    (BIT(5))
#define EMAC_TSADDREG_M  (EMAC_TSADDREG_V << EMAC_TSADDREG_S)
#define EMAC_TSADDREG_V  0x00000001U
#define EMAC_TSADDREG_S  5
/** EMAC_TSENALL : R/W; bitpos: [8]; default: 0;
 *  Enable Timestamp for All Frames When set, the timestamp snapshot is enabled for all
 *  frames received by the MAC
 */
#define EMAC_TSENALL    (BIT(8))
#define EMAC_TSENALL_M  (EMAC_TSENALL_V << EMAC_TSENALL_S)
#define EMAC_TSENALL_V  0x00000001U
#define EMAC_TSENALL_S  8
/** EMAC_TSCTRLSSR : R/W; bitpos: [9]; default: 0;
 *  Timestamp Digital or Binary Rollover Control When set, the Timestamp Low register
 *  rolls over after 0x3B9A_C9FF value _that is, 1 nanosecond accuracy_ and increments
 *  the timestamp _High_ seconds When reset, the rollover value of subsecond register
 *  is 0x7FFF_FFFF The subsecond increment has to be programmed correctly depending on
 *  the PTP reference clock frequency and the value of this bit
 */
#define EMAC_TSCTRLSSR    (BIT(9))
#define EMAC_TSCTRLSSR_M  (EMAC_TSCTRLSSR_V << EMAC_TSCTRLSSR_S)
#define EMAC_TSCTRLSSR_V  0x00000001U
#define EMAC_TSCTRLSSR_S  9
/** EMAC_TSVER2ENA : R/W; bitpos: [10]; default: 0;
 *  Enable PTP packet Processing for Version 2 Format When set, the PTP packets are
 *  processed using the 1588 version 2 format Otherwise, the PTP packets are processed
 *  using the version 1 format The IEEE 1588 Version 1 and Version 2 format are
 *  described in “PTP Processing and Control” on page 155
 */
#define EMAC_TSVER2ENA    (BIT(10))
#define EMAC_TSVER2ENA_M  (EMAC_TSVER2ENA_V << EMAC_TSVER2ENA_S)
#define EMAC_TSVER2ENA_V  0x00000001U
#define EMAC_TSVER2ENA_S  10
/** EMAC_TSIPENA : R/W; bitpos: [11]; default: 0;
 *  Enable Processing of PTP over Ethernet Frames When set, the MAC receiver processes
 *  the PTP packets encapsulated directly in the Ethernet frames When this bit is
 *  clear, the MAC ignores the PTP over Ethernet packets
 */
#define EMAC_TSIPENA    (BIT(11))
#define EMAC_TSIPENA_M  (EMAC_TSIPENA_V << EMAC_TSIPENA_S)
#define EMAC_TSIPENA_V  0x00000001U
#define EMAC_TSIPENA_S  11
/** EMAC_TSIPV6ENA : R/W; bitpos: [12]; default: 0;
 *  Enable Processing of PTP Frames Sent over IPv6UDP When set, the MAC receiver
 *  processes PTP packets encapsulated in UDP over IPv6 packets When this bit is clear,
 *  the MAC ignores the PTP transported over UDPIPv6 packets
 */
#define EMAC_TSIPV6ENA    (BIT(12))
#define EMAC_TSIPV6ENA_M  (EMAC_TSIPV6ENA_V << EMAC_TSIPV6ENA_S)
#define EMAC_TSIPV6ENA_V  0x00000001U
#define EMAC_TSIPV6ENA_S  12
/** EMAC_TSIPV4ENA : R/W; bitpos: [13]; default: 1;
 *  Enable Processing of PTP Frames Sent over IPv4UDP When set, the MAC receiver
 *  processes the PTP packets encapsulated in UDP over IPv4 packets When this bit is
 *  clear, the MAC ignores the PTP transported over UDPIPv4 packets This bit is set by
 *  default
 */
#define EMAC_TSIPV4ENA    (BIT(13))
#define EMAC_TSIPV4ENA_M  (EMAC_TSIPV4ENA_V << EMAC_TSIPV4ENA_S)
#define EMAC_TSIPV4ENA_V  0x00000001U
#define EMAC_TSIPV4ENA_S  13
/** EMAC_TSEVNTENA : R/W; bitpos: [14]; default: 0;
 *  Enable Timestamp Snapshot for Event Messages When set, the timestamp snapshot is
 *  taken only for event messages _SYNC, Delay_Req, Pdelay_Req, or Pdelay_Resp_ When
 *  reset, the snapshot is taken for all messages except Announce, Management, and
 *  Signaling For more information about the timestamp snapshots, see Table 670 on page
 *  462
 */
#define EMAC_TSEVNTENA    (BIT(14))
#define EMAC_TSEVNTENA_M  (EMAC_TSEVNTENA_V << EMAC_TSEVNTENA_S)
#define EMAC_TSEVNTENA_V  0x00000001U
#define EMAC_TSEVNTENA_S  14
/** EMAC_TSMSTRENA : R/W; bitpos: [15]; default: 0;
 *  Enable Snapshot for Messages Relevant to Master When set, the snapshot is taken
 *  only for the messages relevant to the master node Otherwise, the snapshot is taken
 *  for the messages relevant to the slave node
 */
#define EMAC_TSMSTRENA    (BIT(15))
#define EMAC_TSMSTRENA_M  (EMAC_TSMSTRENA_V << EMAC_TSMSTRENA_S)
#define EMAC_TSMSTRENA_V  0x00000001U
#define EMAC_TSMSTRENA_S  15
/** EMAC_SNAPTYPSEL : R/W; bitpos: [17:16]; default: 0;
 *  Select PTP packets for Taking Snapshots These bits along with Bits 15 and 14 decide
 *  the set of PTP packet types for which snapshot needs to be taken The encoding is
 *  given in Table 670 on page 462
 */
#define EMAC_SNAPTYPSEL    0x00000003U
#define EMAC_SNAPTYPSEL_M  (EMAC_SNAPTYPSEL_V << EMAC_SNAPTYPSEL_S)
#define EMAC_SNAPTYPSEL_V  0x00000003U
#define EMAC_SNAPTYPSEL_S  16
/** EMAC_TSENMACADDR : R/W; bitpos: [18]; default: 0;
 *  Enable MAC address for PTP Frame Filtering When set, the DA MAC address _that
 *  matches any MAC Address register_ is used to filter the PTP frames when PTP is
 *  directly sent over Ethernet
 */
#define EMAC_TSENMACADDR    (BIT(18))
#define EMAC_TSENMACADDR_M  (EMAC_TSENMACADDR_V << EMAC_TSENMACADDR_S)
#define EMAC_TSENMACADDR_V  0x00000001U
#define EMAC_TSENMACADDR_S  18
/** EMAC_ATSFC : R/W1S; bitpos: [24]; default: 0;
 *  Auxiliary Snapshot FIFO Clear When set, it resets the pointers of the Auxiliary
 *  Snapshot FIFO This bit is cleared when the pointers are reset and the FIFO is empty
 *  When this bit is high, auxiliary snapshots get stored in the FIFO This bit is
 *  reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during
 *  core configuration
 */
#define EMAC_ATSFC    (BIT(24))
#define EMAC_ATSFC_M  (EMAC_ATSFC_V << EMAC_ATSFC_S)
#define EMAC_ATSFC_V  0x00000001U
#define EMAC_ATSFC_S  24
/** EMAC_ATSEN0 : R/W; bitpos: [25]; default: 0;
 *  Auxiliary Snapshot 0 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 0 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[0] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration
 */
#define EMAC_ATSEN0    (BIT(25))
#define EMAC_ATSEN0_M  (EMAC_ATSEN0_V << EMAC_ATSEN0_S)
#define EMAC_ATSEN0_V  0x00000001U
#define EMAC_ATSEN0_S  25
/** EMAC_ATSEN1 : R/W; bitpos: [26]; default: 0;
 *  Auxiliary Snapshot 1 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 1 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[1] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than two
 */
#define EMAC_ATSEN1    (BIT(26))
#define EMAC_ATSEN1_M  (EMAC_ATSEN1_V << EMAC_ATSEN1_S)
#define EMAC_ATSEN1_V  0x00000001U
#define EMAC_ATSEN1_S  26
/** EMAC_ATSEN2 : R/W; bitpos: [27]; default: 0;
 *  Auxiliary Snapshot 2 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 2 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[2] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than three
 */
#define EMAC_ATSEN2    (BIT(27))
#define EMAC_ATSEN2_M  (EMAC_ATSEN2_V << EMAC_ATSEN2_S)
#define EMAC_ATSEN2_V  0x00000001U
#define EMAC_ATSEN2_S  27
/** EMAC_ATSEN3 : R/W; bitpos: [28]; default: 0;
 *  Auxiliary Snapshot 3 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 3 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[3] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than four
 */
#define EMAC_ATSEN3    (BIT(28))
#define EMAC_ATSEN3_M  (EMAC_ATSEN3_V << EMAC_ATSEN3_S)
#define EMAC_ATSEN3_V  0x00000001U
#define EMAC_ATSEN3_S  28

/** EMAC_SUBSECONDINCREMENT_REG register
 *  Contains the 8bit value by which the SubSecond register is incremented This
 *  register is present only when IEEE1588 timestamping is enabled without an external
 *  timestamp input
 */
#define EMAC_SUBSECONDINCREMENT_REG (DR_REG_EMAC_BASE + 0x704)
/** EMAC_SSINC : R/W; bitpos: [7:0]; default: 0;
 *  Subsecond Increment Value The value programmed in this field is accumulated every
 *  clock cycle _of clk_ptp_i_ with the contents of the subsecond register For example,
 *  when PTP clock is 50 MHz _period is 20 ns_, you should program 20 _0x14_ when the
 *  System Time Nanoseconds register has an accuracy of 1 ns [Bit 9 _TSCTRLSSR_ is set
 *  in Register 448 _Timestamp Control Register_] When TSCTRLSSR is clear, the
 *  Nanoseconds register has a resolution of ~0465ns In this case, you should program a
 *  value of 43 _0x2B_ that is derived by 20ns/0465
 */
#define EMAC_SSINC    0x000000FFU
#define EMAC_SSINC_M  (EMAC_SSINC_V << EMAC_SSINC_S)
#define EMAC_SSINC_V  0x000000FFU
#define EMAC_SSINC_S  0

/** EMAC_SYSTEMTIMESECONDS_REG register
 *  Contains the lower 32 bits of the seconds field of the system time This register is
 *  present only when IEEE1588 timestamping is enabled without an external timestamp
 *  input
 */
#define EMAC_SYSTEMTIMESECONDS_REG (DR_REG_EMAC_BASE + 0x708)
/** EMAC_TSS_RO : RO; bitpos: [31:0]; default: 0;
 *  Timestamp Second The value in this field indicates the current value in seconds of
 *  the System Time maintained by the MAC
 */
#define EMAC_TSS_RO    0xFFFFFFFFU
#define EMAC_TSS_RO_M  (EMAC_TSS_RO_V << EMAC_TSS_RO_S)
#define EMAC_TSS_RO_V  0xFFFFFFFFU
#define EMAC_TSS_RO_S  0

