espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_AUXILIARYTIMESTAMPNANOSECONDS_REG register
 *  Contains the lower 32 bits _nanoseconds field_ of the auxiliary timestamp register
 */
#define EMAC_AUXILIARYTIMESTAMPNANOSECONDS_REG (DR_REG_EMAC_BASE + 0x730)
/** EMAC_AUXTSLO : RO; bitpos: [30:0]; default: 0;
 *  Contains the lower 31 bits _nanoseconds field_ of the auxiliary timestamp
 */
#define EMAC_AUXTSLO    0x7FFFFFFFU
#define EMAC_AUXTSLO_M  (EMAC_AUXTSLO_V << EMAC_AUXTSLO_S)
#define EMAC_AUXTSLO_V  0x7FFFFFFFU
#define EMAC_AUXTSLO_S  0

/** EMAC_AUXILIARYTIMESTAMPSECONDS_REG register
 *  Contains the lower 32 bits of the Seconds field of the auxiliary timestamp register
 */
#define EMAC_AUXILIARYTIMESTAMPSECONDS_REG (DR_REG_EMAC_BASE + 0x734)
/** EMAC_AUXTSHI : RO; bitpos: [31:0]; default: 0;
 *  Contains the lower 32 bits of the Seconds field of the auxiliary timestamp
 */
#define EMAC_AUXTSHI    0xFFFFFFFFU
#define EMAC_AUXTSHI_M  (EMAC_AUXTSHI_V << EMAC_AUXTSHI_S)
#define EMAC_AUXTSHI_V  0xFFFFFFFFU
#define EMAC_AUXTSHI_S  0

/** EMAC_AVMACCONTROL_REG register
 *  Controls the AV traffic and queue management in the MAC Receiver This register is
 *  present only when you select the AV feature in coreConsultant
 */
#define EMAC_AVMACCONTROL_REG (DR_REG_EMAC_BASE + 0x738)
/** EMAC_AVT : R/W; bitpos: [15:0]; default: 0;
 *  AV EtherType Value This field contains the value that is compared with the
 *  EtherType field of the incoming _tagged or untagged_ Ethernet frame to detect an AV
 *  packet
 */
#define EMAC_AVT    0x0000FFFFU
#define EMAC_AVT_M  (EMAC_AVT_V << EMAC_AVT_S)
#define EMAC_AVT_V  0x0000FFFFU
#define EMAC_AVT_S  0
/** EMAC_AVP : R/W; bitpos: [18:16]; default: 0;
 *  AV Priority for Queuing The value programmed in these bits control the receive
 *  channel _0, 1, or 2_ to which an AV packet with a given priority must be queued If
 *  only Channel 1 receive path is enabled, the AV packets with priority value greater
 *  than or equal to the programmed value are queued on Channel 1 and all other packets
 *  are queued on Channel 0 If Channel 2 receive path is also enabled, the AV packets
 *  with priority value greater than or equal to the programmed value are queued on
 *  Channel 2 The AV packets with value less than the programmed value on Channel 1 and
 *  all other packets are queued on Channel 0 These bits are applicable only if at
 *  least one additional receive channel is selected in the AV mode
 */
#define EMAC_AVP    0x00000007U
#define EMAC_AVP_M  (EMAC_AVP_V << EMAC_AVP_S)
#define EMAC_AVP_V  0x00000007U
#define EMAC_AVP_S  16
/** EMAC_VQE : R/W; bitpos: [19]; default: 0;
 *  VLAN Tagged NonAV Packets Queueing Enable When this bit is set, the MAC also queues
 *  nonAV VLAN tagged packets into the available channels according to the value of the
 *  AVP bits This bit is reserved and readonly if Channel 1 and Channel 2 Receive paths
 *  are not selected during core configuration
 */
#define EMAC_VQE    (BIT(19))
#define EMAC_VQE_M  (EMAC_VQE_V << EMAC_VQE_S)
#define EMAC_VQE_V  0x00000001U
#define EMAC_VQE_S  19
/** EMAC_AVCD : R/W; bitpos: [20]; default: 0;
 *  AV Channel Disable When this bit is set, the MAC forwards all packets to the
 *  default Channel 0 and the values programmed in the AVP, AVCH, and PTPCH fields are
 *  ignored This bit is reserved and readonly if Channel 1 or Channel 2 receive paths
 *  are not selected during core configuration
 */
#define EMAC_AVCD    (BIT(20))
#define EMAC_AVCD_M  (EMAC_AVCD_V << EMAC_AVCD_S)
#define EMAC_AVCD_V  0x00000001U
#define EMAC_AVCD_S  20
/** EMAC_AVCH : R/W; bitpos: [22:21]; default: 0;
 *  Channel for Queuing the AV Control Packets This field specifies the channel on
 *  which the received untagged AV control packets are queued 00: Channel 0 01: Channel
 *  1 10: Channel 2 11: Reserved These bits are reserved if the receive paths of
 *  Channel 1 or Channel 2 are not enabled
 */
#define EMAC_AVCH    0x00000003U
#define EMAC_AVCH_M  (EMAC_AVCH_V << EMAC_AVCH_S)
#define EMAC_AVCH_V  0x00000003U
#define EMAC_AVCH_S  21
/** EMAC_PTPCH : R/W; bitpos: [25:24]; default: 0;
 *  Channel for Queuing the PTP Packets This field specifies the channel on which the
 *  untagged PTP packets, sent over the Ethernet payload and not over IPv4 or IPv6, are
 *  queued 00: Channel 0 01: Channel 1 10: Channel 2 11: Reserved These bits are
 *  reserved if the receive paths of Channel 1 or Channel 2 are not enabled
 */
#define EMAC_PTPCH    0x00000003U
#define EMAC_PTPCH_M  (EMAC_PTPCH_V << EMAC_PTPCH_S)
#define EMAC_PTPCH_V  0x00000003U
#define EMAC_PTPCH_S  24

/** EMAC_PPS0INTERVAL_REG register
 *  Contains the number of units of subsecond increment value between the rising edges
 *  of PPS0 signal output This register is available only when the flexible PPS feature
 *  is selected
 */
#define EMAC_PPS0INTERVAL_REG (DR_REG_EMAC_BASE + 0x760)
/** EMAC_PPSINT : R/W; bitpos: [31:0]; default: 0;
 *  PPS0 Output Signal Interval These bits store the interval between the rising edges
 *  of PPS0 signal output in terms of units of subsecond increment value You need to
 *  program one value less than the required interval For example, if the PTP reference
 *  clock is 50 MHz _period of 20ns_, and desired interval between rising edges of PPS0
 *  signal output is 100ns _that is, five units of subsecond increment value_, then you
 *  should program value 4 _5  1_ in this register
 */
#define EMAC_PPSINT    0xFFFFFFFFU
#define EMAC_PPSINT_M  (EMAC_PPSINT_V << EMAC_PPSINT_S)
#define EMAC_PPSINT_V  0xFFFFFFFFU
#define EMAC_PPSINT_S  0

/** EMAC_PPS0WIDTH_REG register
 *  Contains the number of units of subsecond increment value between the rising and
 *  corresponding falling edges of PPS0 signal output This register is available only
 *  when the flexible PPS feature is selected
 */
#define EMAC_PPS0WIDTH_REG (DR_REG_EMAC_BASE + 0x764)
/** EMAC_PPSWIDTH : R/W; bitpos: [31:0]; default: 0;
 *  PPS0 Output Signal Width These bits store the width between the rising edge and
 *  corresponding falling edge of the PPS0 signal output in terms of units of subsecond
 *  increment value You need to program one value less than the required interval For
 *  example, if PTP reference clock is 50 MHz _period of 20ns_, and desired width
 *  between the rising and corresponding falling edges of PPS0 signal output is 80ns
 *  _that is, four units of subsecond increment value_, then you should program value 3
 *  _4  1_ in this register Note: The value programmed in this register must be lesser
 *  than the value programmed in Register 472 _PPS0 Interval Register_
 */
#define EMAC_PPSWIDTH    0xFFFFFFFFU
#define EMAC_PPSWIDTH_M  (EMAC_PPSWIDTH_V << EMAC_PPSWIDTH_S)
#define EMAC_PPSWIDTH_V  0xFFFFFFFFU
#define EMAC_PPSWIDTH_S  0

/** EMAC_PPS1TARGETTIMESECONDS_REG register
 *  Contains the higher 32 bits of time to be compared with the system time to generate
 *  the interrupt event or to start generating the PPS1 output signal This register is
 *  present only when IEEE1588 timestamping is enabled without an external timestamp
 *  input and at least one additional PPS output is selected
 */
#define EMAC_PPS1TARGETTIMESECONDS_REG (DR_REG_EMAC_BASE + 0x780)
/** EMAC_TSTRH1 : R/W; bitpos: [31:0]; default: 0;
 *  PPS1 Target Time Seconds Register This register stores the time in seconds When the
 *  timestamp value matches or exceeds both Target Timestamp registers, then based on
 *  Bits [14:13], TRGTMODSEL1, of Register 459 _PPS Control Register_, the MAC starts
 *  or stops the PPS signal output and generates an interrupt _if enabled_
 */
#define EMAC_TSTRH1    0xFFFFFFFFU
#define EMAC_TSTRH1_M  (EMAC_TSTRH1_V << EMAC_TSTRH1_S)
#define EMAC_TSTRH1_V  0xFFFFFFFFU
#define EMAC_TSTRH1_S  0

