espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_MISSEDFRAMEANDBUFFEROVERFLOWCOUNTER_REG register
 *  Contains the counters for discarded frames because no host Receive Descriptor was
 *  available or because of Receive FIFO Overflow
 */
#define EMAC_MISSEDFRAMEANDBUFFEROVERFLOWCOUNTER_REG (DR_REG_EMAC_BASE + 0x1020)
/** EMAC_MISFRMCNT : R/W; bitpos: [15:0]; default: 0;
 *  Missed Frame Counter This field indicates the number of frames missed by the
 *  controller because of the Host Receive Buffer being unavailable This counter is
 *  incremented each time the DMA discards an incoming frame The counter is cleared
 *  when this register is read with mci_be_i[0] at 1’b1
 */
#define EMAC_MISFRMCNT    0x0000FFFFU
#define EMAC_MISFRMCNT_M  (EMAC_MISFRMCNT_V << EMAC_MISFRMCNT_S)
#define EMAC_MISFRMCNT_V  0x0000FFFFU
#define EMAC_MISFRMCNT_S  0
/** EMAC_MISCNTOVF : R/W; bitpos: [16]; default: 0;
 *  Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame
 *  Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because
 *  of the Host Receive Buffer being unavailable with the missed frame counter at
 *  maximum value In such a scenario, the Missed frame counter is reset to allzeros and
 *  this bit indicates that the rollover happened
 */
#define EMAC_MISCNTOVF    (BIT(16))
#define EMAC_MISCNTOVF_M  (EMAC_MISCNTOVF_V << EMAC_MISCNTOVF_S)
#define EMAC_MISCNTOVF_V  0x00000001U
#define EMAC_MISCNTOVF_S  16
/** EMAC_OVFFRMCNT : R/W; bitpos: [27:17]; default: 0;
 *  Overflow Frame Counter This field indicates the number of frames missed by the
 *  application This counter is incremented each time the MTL FIFO overflows The
 *  counter is cleared when this register is read with mci_be_i[2] at 1’b1
 */
#define EMAC_OVFFRMCNT    0x000007FFU
#define EMAC_OVFFRMCNT_M  (EMAC_OVFFRMCNT_V << EMAC_OVFFRMCNT_S)
#define EMAC_OVFFRMCNT_V  0x000007FFU
#define EMAC_OVFFRMCNT_S  17
/** EMAC_OVFCNTOVF : R/W; bitpos: [28]; default: 0;
 *  Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow
 *  Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the
 *  overflow frame counter at maximum value In such a scenario, the overflow frame
 *  counter is reset to allzeros and this bit indicates that the rollover happened
 */
#define EMAC_OVFCNTOVF    (BIT(28))
#define EMAC_OVFCNTOVF_M  (EMAC_OVFCNTOVF_V << EMAC_OVFCNTOVF_S)
#define EMAC_OVFCNTOVF_V  0x00000001U
#define EMAC_OVFCNTOVF_S  28

/** EMAC_RECEIVEINTERRUPTWATCHDOGTIMER_REG register
 *  Watchdog timeout for Receive Interrupt _RI_ from DMA
 */
#define EMAC_RECEIVEINTERRUPTWATCHDOGTIMER_REG (DR_REG_EMAC_BASE + 0x1024)
/** EMAC_RIWT : R/W; bitpos: [7:0]; default: 0;
 *  RI Watchdog Timer Count This bit indicates the number of system clock cycles
 *  multiplied by 256 for which the watchdog timer is set The watchdog timer gets
 *  triggered with the programmed value after the Rx DMA completes the transfer of a
 *  frame for which the RI status bit is not set because of the setting in the
 *  corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is
 *  set and the timer is stopped The watchdog timer is reset when the RI bit is set
 *  high because of automatic setting of RI as per RDES1[31] of any received frame
 */
#define EMAC_RIWT    0x000000FFU
#define EMAC_RIWT_M  (EMAC_RIWT_V << EMAC_RIWT_S)
#define EMAC_RIWT_V  0x000000FFU
#define EMAC_RIWT_S  0

/** EMAC_AXIBUSMODE_REG register
 *  Controls AXI master behavior _mainly controls burst splitting and number of
 *  outstanding requests_
 */
#define EMAC_AXIBUSMODE_REG (DR_REG_EMAC_BASE + 0x1028)
/** EMAC_UNDEF : RO; bitpos: [0]; default: 1;
 *  AXI Undefined Burst Length This bit is readonly bit and indicates the complement
 *  _invert_ value of Bit 16 _FB_ in Register 0 _Bus Mode Register_ When this bit is
 *  set to 1, the EMACAXI is allowed to perform any burst length equal to or below the
 *  maximum allowed burst length programmed in Bits[7:3] When this bit is set to 0, the
 *  EMACAXI is allowed to perform only fixed burst lengths as indicated by BLEN256,
 *  BLEN128, BLEN64, BLEN32, BLEN16, BLEN8, or BLEN4, or a burst length of 1 If UNDEF
 *  is set and none of the BLEN bits is set, then EMACAXI is allowed to perform a burst
 *  length of 16
 */
#define EMAC_UNDEF    (BIT(0))
#define EMAC_UNDEF_M  (EMAC_UNDEF_V << EMAC_UNDEF_S)
#define EMAC_UNDEF_V  0x00000001U
#define EMAC_UNDEF_S  0
/** EMAC_BLEN4 : R/W; bitpos: [1]; default: 0;
 *  AXI Burst Length 4 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 4 on the AXI master interface Setting this bit has no effect when
 *  UNDEF is set to 1
 */
#define EMAC_BLEN4    (BIT(1))
#define EMAC_BLEN4_M  (EMAC_BLEN4_V << EMAC_BLEN4_S)
#define EMAC_BLEN4_V  0x00000001U
#define EMAC_BLEN4_S  1
/** EMAC_BLEN8 : R/W; bitpos: [2]; default: 0;
 *  AXI Burst Length 8 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 8 on the AXI master interface Setting this bit has no effect when
 *  UNDEF is set to 1
 */
#define EMAC_BLEN8    (BIT(2))
#define EMAC_BLEN8_M  (EMAC_BLEN8_V << EMAC_BLEN8_S)
#define EMAC_BLEN8_V  0x00000001U
#define EMAC_BLEN8_S  2
/** EMAC_BLEN16 : R/W; bitpos: [3]; default: 0;
 *  AXI Burst Length 16 When this bit is set to 1 or UNDEF is set to 1, the EMACAXI is
 *  allowed to select a burst length of 16 on the AXI master interface
 */
#define EMAC_BLEN16    (BIT(3))
#define EMAC_BLEN16_M  (EMAC_BLEN16_V << EMAC_BLEN16_S)
#define EMAC_BLEN16_V  0x00000001U
#define EMAC_BLEN16_S  3
/** EMAC_BLEN32 : R/W; bitpos: [4]; default: 0;
 *  AXI Burst Length 32 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 32 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 32 or more Otherwise, this bit is reserved
 *  and is readonly _RO_
 */
#define EMAC_BLEN32    (BIT(4))
#define EMAC_BLEN32_M  (EMAC_BLEN32_V << EMAC_BLEN32_S)
#define EMAC_BLEN32_V  0x00000001U
#define EMAC_BLEN32_S  4
/** EMAC_BLEN64 : R/W; bitpos: [5]; default: 0;
 *  AXI Burst Length 64 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 64 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 64 or more Otherwise, this bit is reserved
 *  and is readonly _RO_
 */
#define EMAC_BLEN64    (BIT(5))
#define EMAC_BLEN64_M  (EMAC_BLEN64_V << EMAC_BLEN64_S)
#define EMAC_BLEN64_V  0x00000001U
#define EMAC_BLEN64_S  5
/** EMAC_BLEN128 : R/W; bitpos: [6]; default: 0;
 *  AXI Burst Length 128 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 128 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 128 or more Otherwise, this bit is
 *  reserved and is readonly _RO_
 */
#define EMAC_BLEN128    (BIT(6))
#define EMAC_BLEN128_M  (EMAC_BLEN128_V << EMAC_BLEN128_S)
#define EMAC_BLEN128_V  0x00000001U
#define EMAC_BLEN128_S  6
/** EMAC_BLEN256 : R/W; bitpos: [7]; default: 0;
 *  AXI Burst Length 256 When this bit is set to 1, the EMACAXI is allowed to select a
 *  burst length of 256 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 256 Otherwise, this bit is reserved and is
 *  readonly _RO_
 */
#define EMAC_BLEN256    (BIT(7))
#define EMAC_BLEN256_M  (EMAC_BLEN256_V << EMAC_BLEN256_S)
#define EMAC_BLEN256_V  0x00000001U
#define EMAC_BLEN256_S  7
/** EMAC_AXI_AAL : RO; bitpos: [12]; default: 0;
 *  AddressAligned Beats This bit is readonly bit and reflects the Bit 25 _AAL_ of
 *  Register 0 _Bus Mode Register_ When this bit is set to 1, the EMACAXI performs
 *  addressaligned burst transfers on both read and write channels 11:8		Reserved	0H	RO
 */
#define EMAC_AXI_AAL    (BIT(12))
#define EMAC_AXI_AAL_M  (EMAC_AXI_AAL_V << EMAC_AXI_AAL_S)
#define EMAC_AXI_AAL_V  0x00000001U
#define EMAC_AXI_AAL_S  12
/** EMAC_ONEKBBE : R/W; bitpos: [13]; default: 0;
 *  1 KB Boundary Crossing Enable for the EMACAXI Master When set, the EMACAXI master
 *  performs burst transfers that do not cross 1 KB boundary When reset, the EMACAXI
 *  master performs burst transfers that do not cross 4 KB boundary
 */
#define EMAC_ONEKBBE    (BIT(13))
#define EMAC_ONEKBBE_M  (EMAC_ONEKBBE_V << EMAC_ONEKBBE_S)
#define EMAC_ONEKBBE_V  0x00000001U
#define EMAC_ONEKBBE_S  13
/** EMAC_RD_OSR_LMT : R/W; bitpos: [19:16]; default: 1;
 *  AXI Maximum Read Outstanding Request Limit This value limits the maximum
 *  outstanding request on the AXI read interface Maximum outstanding requests =
 *  RD_OSR_LMT+1 Note: Bit 18 is reserved if AXI_GM_MAX_RD_REQUESTS = 4 Bit 19 is
 *  reserved if AXI_GM_MAX_RD_REQUESTS != 16 15:14		Reserved	00	RO
 */
#define EMAC_RD_OSR_LMT    0x0000000FU
#define EMAC_RD_OSR_LMT_M  (EMAC_RD_OSR_LMT_V << EMAC_RD_OSR_LMT_S)
#define EMAC_RD_OSR_LMT_V  0x0000000FU
#define EMAC_RD_OSR_LMT_S  16
/** EMAC_WR_OSR_LMT : R/W; bitpos: [23:20]; default: 1;
 *  AXI Maximum Write Outstanding Request Limit This value limits the maximum
 *  outstanding request on the AXI write interface Maximum outstanding requests =
 *  WR_OSR_LMT+1 Note: Bit 22 is reserved if AXI_GM_MAX_WR_REQUESTS = 4 Bit 23 bit is
 *  reserved if AXI_GM_MAX_WR_REQUESTS != 16
 */
#define EMAC_WR_OSR_LMT    0x0000000FU
#define EMAC_WR_OSR_LMT_M  (EMAC_WR_OSR_LMT_V << EMAC_WR_OSR_LMT_S)
#define EMAC_WR_OSR_LMT_V  0x0000000FU
#define EMAC_WR_OSR_LMT_S  20
/** EMAC_LPI_XIT_FRM : R/W; bitpos: [30]; default: 0;
 *  Unlock on Magic Packet or Remote WakeUp Frame When set to 1, this bit enables the
 *  EMACAXI to come out of the LPI mode only when the magic packet or remote wakeup
 *  frame is received When set to 0, this bit enables the EMACAXI to come out of LPI
 *  mode when any frame is received 29:24		Reserved	00H	RO
 */
#define EMAC_LPI_XIT_FRM    (BIT(30))
#define EMAC_LPI_XIT_FRM_M  (EMAC_LPI_XIT_FRM_V << EMAC_LPI_XIT_FRM_S)
#define EMAC_LPI_XIT_FRM_V  0x00000001U
#define EMAC_LPI_XIT_FRM_S  30
/** EMAC_EN_LPI : R/W; bitpos: [31]; default: 0;
 *  Enable Low Power Interface _LPI_ When set to 1, this bit enables the LPI mode
 *  supported by the EMACAXI configuration and accepts the LPI request from the AXI
 *  System Clock controller When set to 0, this bit disables the LPI mode and always
 *  denies the LPI request from the AXI System Clock controller
 */
#define EMAC_EN_LPI    (BIT(31))
#define EMAC_EN_LPI_M  (EMAC_EN_LPI_V << EMAC_EN_LPI_S)
#define EMAC_EN_LPI_V  0x00000001U
#define EMAC_EN_LPI_S  31

/** EMAC_AHBORAXISTATUS_REG register
 *  Gives the idle status of the AHB master interface in the EMACAHB configuration
 *  Gives the idle status of the AXI master's read or write channel in the EMACAXI
 *  configuration
 */
#define EMAC_AHBORAXISTATUS_REG (DR_REG_EMAC_BASE + 0x102c)
/** EMAC_AXWHSTS : RO; bitpos: [0]; default: 0;
 *  AXI Master Write Channel or AHB Master Status When high, it indicates that AXI
 *  master's write channel is active and transferring data in the EMACAXI configuration
 *  In the EMACAHB configuration, it indicates that the AHB master interface FSMs are
 *  in the nonidle state
 */
#define EMAC_AXWHSTS    (BIT(0))
#define EMAC_AXWHSTS_M  (EMAC_AXWHSTS_V << EMAC_AXWHSTS_S)
#define EMAC_AXWHSTS_V  0x00000001U
#define EMAC_AXWHSTS_S  0
/** EMAC_AXIRDSTS : RO; bitpos: [1]; default: 0;
 *  AXI Master Read Channel Status When high, it indicates that AXI master's read
 *  channel is active and transferring data
 */
#define EMAC_AXIRDSTS    (BIT(1))
#define EMAC_AXIRDSTS_M  (EMAC_AXIRDSTS_V << EMAC_AXIRDSTS_S)
#define EMAC_AXIRDSTS_V  0x00000001U
#define EMAC_AXIRDSTS_S  1

/** EMAC_CURRENTHOSTTRANSMITDESCRIPTOR_REG register
 *  Points to the start of current Transmit Descriptor read by the DMA
 */
#define EMAC_CURRENTHOSTTRANSMITDESCRIPTOR_REG (DR_REG_EMAC_BASE + 0x1048)
/** EMAC_CURTDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Descriptor Address Pointer
 */
#define EMAC_CURTDESAPTR    0xFFFFFFFFU
#define EMAC_CURTDESAPTR_M  (EMAC_CURTDESAPTR_V << EMAC_CURTDESAPTR_S)
#define EMAC_CURTDESAPTR_V  0xFFFFFFFFU
#define EMAC_CURTDESAPTR_S  0

/** EMAC_CURRENTHOSTRECEIVEDESCRIPTOR_REG register
 *  Points to the start of current Receive Descriptor read by the DMA
 */
#define EMAC_CURRENTHOSTRECEIVEDESCRIPTOR_REG (DR_REG_EMAC_BASE + 0x104c)
/** EMAC_CURRDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Descriptor Address Pointer
 */
#define EMAC_CURRDESAPTR    0xFFFFFFFFU
#define EMAC_CURRDESAPTR_M  (EMAC_CURRDESAPTR_V << EMAC_CURRDESAPTR_S)
#define EMAC_CURRDESAPTR_V  0xFFFFFFFFU
#define EMAC_CURRDESAPTR_S  0

/** EMAC_CURRENTHOSTTRANSMITBUFFERADDRESS_REG register
 *  Points to the current Transmit Buffer address read by the DMA
 */
#define EMAC_CURRENTHOSTTRANSMITBUFFERADDRESS_REG (DR_REG_EMAC_BASE + 0x1050)
/** EMAC_CURTBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Buffer Address Pointer
 */
#define EMAC_CURTBUFAPTR    0xFFFFFFFFU
#define EMAC_CURTBUFAPTR_M  (EMAC_CURTBUFAPTR_V << EMAC_CURTBUFAPTR_S)
#define EMAC_CURTBUFAPTR_V  0xFFFFFFFFU
#define EMAC_CURTBUFAPTR_S  0

/** EMAC_CURRENTHOSTRECEIVEBUFFERADDRESS_REG register
 *  Points to the current Receive Buffer address read by the DMA
 */
#define EMAC_CURRENTHOSTRECEIVEBUFFERADDRESS_REG (DR_REG_EMAC_BASE + 0x1054)
/** EMAC_CURRBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Buffer Address Pointer
 */
#define EMAC_CURRBUFAPTR    0xFFFFFFFFU
#define EMAC_CURRBUFAPTR_M  (EMAC_CURRBUFAPTR_V << EMAC_CURRBUFAPTR_S)
#define EMAC_CURRBUFAPTR_V  0xFFFFFFFFU
#define EMAC_CURRBUFAPTR_S  0

/** EMAC_HWFEATURE_REG register
 *  Indicates the presence of the optional features of the core
 */
#define EMAC_HWFEATURE_REG (DR_REG_EMAC_BASE + 0x1058)
/** EMAC_MIISEL : RO; bitpos: [0]; default: 0;
 *  10 or 100 Mbps support
 */
#define EMAC_MIISEL    (BIT(0))
#define EMAC_MIISEL_M  (EMAC_MIISEL_V << EMAC_MIISEL_S)
#define EMAC_MIISEL_V  0x00000001U
#define EMAC_MIISEL_S  0
/** EMAC_GMIISEL : RO; bitpos: [1]; default: 0;
 *  1000 Mbps support
 */
#define EMAC_GMIISEL    (BIT(1))
#define EMAC_GMIISEL_M  (EMAC_GMIISEL_V << EMAC_GMIISEL_S)
#define EMAC_GMIISEL_V  0x00000001U
#define EMAC_GMIISEL_S  1
/** EMAC_HDSEL : RO; bitpos: [2]; default: 0;
 *  Halfduplex support
 */
#define EMAC_HDSEL    (BIT(2))
#define EMAC_HDSEL_M  (EMAC_HDSEL_V << EMAC_HDSEL_S)
#define EMAC_HDSEL_V  0x00000001U
#define EMAC_HDSEL_S  2
/** EMAC_EXTHASHEN : RO; bitpos: [3]; default: 0;
 *  Expanded DA Hash filter
 */
#define EMAC_EXTHASHEN    (BIT(3))
#define EMAC_EXTHASHEN_M  (EMAC_EXTHASHEN_V << EMAC_EXTHASHEN_S)
#define EMAC_EXTHASHEN_V  0x00000001U
#define EMAC_EXTHASHEN_S  3
/** EMAC_HASHSEL : RO; bitpos: [4]; default: 0;
 *  HASH filter
 */
#define EMAC_HASHSEL    (BIT(4))
#define EMAC_HASHSEL_M  (EMAC_HASHSEL_V << EMAC_HASHSEL_S)
#define EMAC_HASHSEL_V  0x00000001U
#define EMAC_HASHSEL_S  4
/** EMAC_ADDMACADRSEL : RO; bitpos: [5]; default: 0;
 *  Multiple MAC Address registers
 */
#define EMAC_ADDMACADRSEL    (BIT(5))
#define EMAC_ADDMACADRSEL_M  (EMAC_ADDMACADRSEL_V << EMAC_ADDMACADRSEL_S)
#define EMAC_ADDMACADRSEL_V  0x00000001U
#define EMAC_ADDMACADRSEL_S  5
/** EMAC_PCSSEL : RO; bitpos: [6]; default: 0;
 *  PCS registers _TBI, SGMII, or RTBI PHY interface_
 */
#define EMAC_PCSSEL    (BIT(6))
#define EMAC_PCSSEL_M  (EMAC_PCSSEL_V << EMAC_PCSSEL_S)
#define EMAC_PCSSEL_V  0x00000001U
#define EMAC_PCSSEL_S  6
/** EMAC_L3L4FLTREN : RO; bitpos: [7]; default: 0;
 *  Layer 3 and Layer 4 feature
 */
#define EMAC_L3L4FLTREN    (BIT(7))
#define EMAC_L3L4FLTREN_M  (EMAC_L3L4FLTREN_V << EMAC_L3L4FLTREN_S)
#define EMAC_L3L4FLTREN_V  0x00000001U
#define EMAC_L3L4FLTREN_S  7
/** EMAC_SMASEL : RO; bitpos: [8]; default: 0;
 *  SMA _MDIO_ Interface
 */
#define EMAC_SMASEL    (BIT(8))
#define EMAC_SMASEL_M  (EMAC_SMASEL_V << EMAC_SMASEL_S)
#define EMAC_SMASEL_V  0x00000001U
#define EMAC_SMASEL_S  8
/** EMAC_RWKSEL : RO; bitpos: [9]; default: 0;
 *  PMT remote wakeup frame
 */
#define EMAC_RWKSEL    (BIT(9))
#define EMAC_RWKSEL_M  (EMAC_RWKSEL_V << EMAC_RWKSEL_S)
#define EMAC_RWKSEL_V  0x00000001U
#define EMAC_RWKSEL_S  9
/** EMAC_MGKSEL : RO; bitpos: [10]; default: 0;
 *  PMT magic packet
 */
#define EMAC_MGKSEL    (BIT(10))
#define EMAC_MGKSEL_M  (EMAC_MGKSEL_V << EMAC_MGKSEL_S)
#define EMAC_MGKSEL_V  0x00000001U
#define EMAC_MGKSEL_S  10
/** EMAC_MMCSEL : RO; bitpos: [11]; default: 0;
 *  RMON module
 */
#define EMAC_MMCSEL    (BIT(11))
#define EMAC_MMCSEL_M  (EMAC_MMCSEL_V << EMAC_MMCSEL_S)
#define EMAC_MMCSEL_V  0x00000001U
#define EMAC_MMCSEL_S  11
/** EMAC_TSVER1SEL : RO; bitpos: [12]; default: 0;
 *  Only IEEE 15882002 timestamp
 */
#define EMAC_TSVER1SEL    (BIT(12))
#define EMAC_TSVER1SEL_M  (EMAC_TSVER1SEL_V << EMAC_TSVER1SEL_S)
#define EMAC_TSVER1SEL_V  0x00000001U
#define EMAC_TSVER1SEL_S  12
/** EMAC_TSVER2SEL : RO; bitpos: [13]; default: 0;
 *  IEEE 15882008 Advanced timestamp
 */
#define EMAC_TSVER2SEL    (BIT(13))
#define EMAC_TSVER2SEL_M  (EMAC_TSVER2SEL_V << EMAC_TSVER2SEL_S)
#define EMAC_TSVER2SEL_V  0x00000001U
#define EMAC_TSVER2SEL_S  13
/** EMAC_EEESEL : RO; bitpos: [14]; default: 0;
 *  Energy Efficient Ethernet
 */
#define EMAC_EEESEL    (BIT(14))
#define EMAC_EEESEL_M  (EMAC_EEESEL_V << EMAC_EEESEL_S)
#define EMAC_EEESEL_V  0x00000001U
#define EMAC_EEESEL_S  14
/** EMAC_AVSEL : RO; bitpos: [15]; default: 0;
 *  AV feature
 */
#define EMAC_AVSEL    (BIT(15))
#define EMAC_AVSEL_M  (EMAC_AVSEL_V << EMAC_AVSEL_S)
#define EMAC_AVSEL_V  0x00000001U
#define EMAC_AVSEL_S  15
/** EMAC_TXCOESEL : RO; bitpos: [16]; default: 0;
 *  Checksum Offload in Tx
 */
#define EMAC_TXCOESEL    (BIT(16))
#define EMAC_TXCOESEL_M  (EMAC_TXCOESEL_V << EMAC_TXCOESEL_S)
#define EMAC_TXCOESEL_V  0x00000001U
#define EMAC_TXCOESEL_S  16
/** EMAC_RXTYP1COE : RO; bitpos: [17]; default: 0;
 *  IP Checksum Offload _Type 1_ in Rx Note: If IPCHKSUM_EN = Enabled and
 *  IPC_FULL_OFFLOAD = Enabled, then RXTYP1COE = 0 and RXTYP2COE = 1
 */
#define EMAC_RXTYP1COE    (BIT(17))
#define EMAC_RXTYP1COE_M  (EMAC_RXTYP1COE_V << EMAC_RXTYP1COE_S)
#define EMAC_RXTYP1COE_V  0x00000001U
#define EMAC_RXTYP1COE_S  17
/** EMAC_RXTYP2COE : RO; bitpos: [18]; default: 0;
 *  IP Checksum Offload _Type 2_ in Rx
 */
#define EMAC_RXTYP2COE    (BIT(18))
#define EMAC_RXTYP2COE_M  (EMAC_RXTYP2COE_V << EMAC_RXTYP2COE_S)
#define EMAC_RXTYP2COE_V  0x00000001U
#define EMAC_RXTYP2COE_S  18
/** EMAC_RXFIFOSIZE : RO; bitpos: [19]; default: 0;
 *  Rx FIFO > 2,048 Bytes
 */
#define EMAC_RXFIFOSIZE    (BIT(19))
#define EMAC_RXFIFOSIZE_M  (EMAC_RXFIFOSIZE_V << EMAC_RXFIFOSIZE_S)
#define EMAC_RXFIFOSIZE_V  0x00000001U
#define EMAC_RXFIFOSIZE_S  19
/** EMAC_RXCHCNT : RO; bitpos: [21:20]; default: 0;
 *  Number of additional Rx Channels
 */
#define EMAC_RXCHCNT    0x00000003U
#define EMAC_RXCHCNT_M  (EMAC_RXCHCNT_V << EMAC_RXCHCNT_S)
#define EMAC_RXCHCNT_V  0x00000003U
#define EMAC_RXCHCNT_S  20
/** EMAC_TXCHCNT : RO; bitpos: [23:22]; default: 0;
 *  Number of additional Tx Channels
 */
#define EMAC_TXCHCNT    0x00000003U
#define EMAC_TXCHCNT_M  (EMAC_TXCHCNT_V << EMAC_TXCHCNT_S)
#define EMAC_TXCHCNT_V  0x00000003U
#define EMAC_TXCHCNT_S  22
/** EMAC_ENHDESSEL : RO; bitpos: [24]; default: 0;
 *  Alternate _Enhanced Descriptor_
 */
#define EMAC_ENHDESSEL    (BIT(24))
#define EMAC_ENHDESSEL_M  (EMAC_ENHDESSEL_V << EMAC_ENHDESSEL_S)
#define EMAC_ENHDESSEL_V  0x00000001U
#define EMAC_ENHDESSEL_S  24
/** EMAC_INTTSEN : RO; bitpos: [25]; default: 0;
 *  Timestamping with Internal System Time
 */
#define EMAC_INTTSEN    (BIT(25))
#define EMAC_INTTSEN_M  (EMAC_INTTSEN_V << EMAC_INTTSEN_S)
#define EMAC_INTTSEN_V  0x00000001U
#define EMAC_INTTSEN_S  25
/** EMAC_FLEXIPPSEN : RO; bitpos: [26]; default: 0;
 *  Flexible PulsePerSecond Output
 */
#define EMAC_FLEXIPPSEN    (BIT(26))
#define EMAC_FLEXIPPSEN_M  (EMAC_FLEXIPPSEN_V << EMAC_FLEXIPPSEN_S)
#define EMAC_FLEXIPPSEN_V  0x00000001U
#define EMAC_FLEXIPPSEN_S  26
/** EMAC_SAVLANINS : RO; bitpos: [27]; default: 0;
 *  Source Address or VLAN Insertion
 */
#define EMAC_SAVLANINS    (BIT(27))
#define EMAC_SAVLANINS_M  (EMAC_SAVLANINS_V << EMAC_SAVLANINS_S)
#define EMAC_SAVLANINS_V  0x00000001U
#define EMAC_SAVLANINS_S  27
/** EMAC_ACTPHYIF : RO; bitpos: [30:28]; default: 0;
 *  Active or selected PHY interface When you have multiple PHY interfaces in your
 *  configuration, this field indicates the sampled value of phy_intf_sel_i during
 *  reset deassertion 000: GMII or MII 001: RGMII 010: SGMII 011: TBI 100: RMII 101:
 *  RTBI 110: SMII 111: RevMII All Others: Reserved
 */
#define EMAC_ACTPHYIF    0x00000007U
#define EMAC_ACTPHYIF_M  (EMAC_ACTPHYIF_V << EMAC_ACTPHYIF_S)
#define EMAC_ACTPHYIF_V  0x00000007U
#define EMAC_ACTPHYIF_S  28

