espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_CHANNEL1BUSMODE_REG register
 *  Controls the Host Interface mode for Channel 1
 */
#define EMAC_CHANNEL1BUSMODE_REG (DR_REG_EMAC_BASE + 0x1100)
/** EMAC_CH1_SWR : R/W1S; bitpos: [0]; default: 1;
 *  Software Reset When this bit is set, the MAC DMA Controller resets the logic and
 *  all internal registers of the MAC It is cleared automatically after the reset
 *  operation is complete in all of the DWC_EMAC clock domains Before reprogramming any
 *  register of the DWC_EMAC, you should read a zero _0_ value in this bit Note: The
 *  Software reset function is driven only by this bit Bit 0 of Register 64 _Channel 1
 *  Bus Mode Register_ or Register 128 _Channel 2 Bus Mode Register_ has no impact on
 *  the Software reset function The reset operation is completed only when all resets
 *  in all active clock domains are deasserted Therefore, it is essential that all PHY
 *  inputs clocks _applicable for the selected PHY interface_ are present for the
 *  software reset completion The time to complete the software reset operation depends
 *  on the frequency of the slowest active clock
 */
#define EMAC_CH1_SWR    (BIT(0))
#define EMAC_CH1_SWR_M  (EMAC_CH1_SWR_V << EMAC_CH1_SWR_S)
#define EMAC_CH1_SWR_V  0x00000001U
#define EMAC_CH1_SWR_S  0
/** EMAC_CH1_DA : R/W; bitpos: [1]; default: 0;
 *  DMA Arbitration Scheme This bit specifies the arbitration scheme between the
 *  transmit and receive paths of Channel 1 0: Weighted roundrobin with Rx:Tx or Tx:Rx
 *  The priority between the paths is according to the priority specified in Bits
 *  [15:14] _PR_ and priority weights specified in Bit 27 _TXPR_ 1: Fixed priority The
 *  transmit path has priority over receive path when Bit 27 _TXPR_ is set Otherwise,
 *  receive path has priority over the transmit path In the EMACAXI configuration,
 *  these bits are reserved and are readonly _RO_ For more information about the
 *  priority scheme between the transmit and receive paths, see Table 412 in “DMA
 *  Arbiter Functions” on page 167
 */
#define EMAC_CH1_DA    (BIT(1))
#define EMAC_CH1_DA_M  (EMAC_CH1_DA_V << EMAC_CH1_DA_S)
#define EMAC_CH1_DA_V  0x00000001U
#define EMAC_CH1_DA_S  1
/** EMAC_CH1_DSL : R/W; bitpos: [6:2]; default: 0;
 *  Descriptor Skip Length This bit specifies the number of Word, Dword, or Lword
 *  _depending on the 32bit, 64bit, or 128bit bus_ to skip between two unchained
 *  descriptors The address skipping starts from the end of current descriptor to the
 *  start of next descriptor When the DSL value is equal to zero, the descriptor table
 *  is taken as contiguous by the DMA in Ring mode
 */
#define EMAC_CH1_DSL    0x0000001FU
#define EMAC_CH1_DSL_M  (EMAC_CH1_DSL_V << EMAC_CH1_DSL_S)
#define EMAC_CH1_DSL_V  0x0000001FU
#define EMAC_CH1_DSL_S  2
/** EMAC_CH1_ATDS : R/W; bitpos: [7]; default: 0;
 *  Alternate Descriptor Size When set, the size of the alternate descriptor _described
 *  in “Alternate or Enhanced Descriptors” on page 545_ increases to 32 bytes _8
 *  DWORDS_ This is required when the Advanced Timestamp feature or the IPC Full
 *  Checksum Offload Engine _Type 2_ is enabled in the receiver The enhanced descriptor
 *  is not required if the Advanced Timestamp and IPC Full Checksum Offload Engine
 *  _Type 2_ features are not enabled In such case, you can use the 16 bytes descriptor
 *  to save 4 bytes of memory This bit is present only when you select the Alternate
 *  Descriptor feature and any one of the following features during core configuration:
 *  Advanced Timestamp feature IPC Full Checksum Offload Engine _Type 2_ feature
 *  Otherwise, this bit is reserved and is readonly When reset, the descriptor size
 *  reverts back to 4 DWORDs _16 bytes_ This bit preserves the backward compatibility
 *  for the descriptor size In versions prior to 350a, the descriptor size is 16 bytes
 *  for both normal and enhanced descriptors In version 350a, descriptor size is
 *  increased to 32 bytes because of the Advanced Timestamp and IPC Full Checksum
 *  Offload Engine _Type 2_ features
 */
#define EMAC_CH1_ATDS    (BIT(7))
#define EMAC_CH1_ATDS_M  (EMAC_CH1_ATDS_V << EMAC_CH1_ATDS_S)
#define EMAC_CH1_ATDS_V  0x00000001U
#define EMAC_CH1_ATDS_S  7
/** EMAC_CH1_PBL : R/W; bitpos: [13:8]; default: 1;
 *  Programmable Burst Length These bits indicate the maximum number of beats to be
 *  transferred in one DMA transaction This is the maximum value that is used in a
 *  single block Read or Write The DMA always attempts to burst as specified in PBL
 *  each time it starts a Burst transfer on the host bus PBL can be programmed with
 *  permissible values of 1, 2, 4, 8, 16, and 32 Any other value results in undefined
 *  behavior When USP is set high, this PBL value is applicable only for Tx DMA
 *  transactions If the number of beats to be transferred is more than 32, then perform
 *  the following steps: 1 Set the PBLx8 mode 2 Set the PBL For example, if the maximum
 *  number of beats to be transferred is 64, then first set PBLx8 to 1 and then set PBL
 *  to 8 The PBL values have the following limitation: The maximum number of possible
 *  beats _PBL_ is limited by the size of the Tx FIFO and Rx FIFO in the MTL layer and
 *  the data bus width on the DMA The FIFO has a constraint that the maximum beat
 *  supported is half the depth of the FIFO, except when specified For different data
 *  bus widths and FIFO sizes, the valid PBL range _including x8 mode_ is provided in
 *  Table 66 on page 382
 */
#define EMAC_CH1_PBL    0x0000003FU
#define EMAC_CH1_PBL_M  (EMAC_CH1_PBL_V << EMAC_CH1_PBL_S)
#define EMAC_CH1_PBL_V  0x0000003FU
#define EMAC_CH1_PBL_S  8
/** EMAC_CH1_PR : R/W; bitpos: [15:14]; default: 0;
 *  Priority Ratio These bits control the priority ratio in the weighted roundrobin
 *  arbitration between the Rx DMA and Tx DMA These bits are valid only when Bit 1 _DA_
 *  is reset The priority ratio is Rx:Tx or Tx:Rx depending on whether Bit 27 _TXPR_ is
 *  reset or set 00: The Priority Ratio is 1:1 01: The Priority Ratio is 2:1 10: The
 *  Priority Ratio is 3:1 11: The Priority Ratio is 4:1 In the EMACAXI configuration,
 *  these bits are reserved and readonly _RO_ For more information about the priority
 *  scheme between the transmit and receive paths, see Table 412 in “DMA Arbiter
 *  Functions” on page 167
 */
#define EMAC_CH1_PR    0x00000003U
#define EMAC_CH1_PR_M  (EMAC_CH1_PR_V << EMAC_CH1_PR_S)
#define EMAC_CH1_PR_V  0x00000003U
#define EMAC_CH1_PR_S  14
/** EMAC_CH1_FB : R/W; bitpos: [16]; default: 0;
 *  Fixed Burst This bit controls whether the AHB or AXI master interface performs
 *  fixed burst transfers or not When set, the AHB interface uses only SINGLE, INCR4,
 *  INCR8, or INCR16 during start of the normal burst transfers When reset, the AHB or
 *  AXI interface uses SINGLE and INCR burst transfer operations For more information,
 *  see Bit 0 _UNDEF_ of the AXI Bus Mode register in the EMACAXI configuration
 */
#define EMAC_CH1_FB    (BIT(16))
#define EMAC_CH1_FB_M  (EMAC_CH1_FB_V << EMAC_CH1_FB_S)
#define EMAC_CH1_FB_V  0x00000001U
#define EMAC_CH1_FB_S  16
/** EMAC_CH1_RPBL : R/W; bitpos: [22:17]; default: 1;
 *  Rx DMA PBL This field indicates the maximum number of beats to be transferred in
 *  one Rx DMA transaction This is the maximum value that is used in a single block
 *  Read or Write The Rx DMA always attempts to burst as specified in the RPBL bit each
 *  time it starts a Burst transfer on the host bus You can program RPBL with values of
 *  1, 2, 4, 8, 16, and 32 Any other value results in undefined behavior This field is
 *  valid and applicable only when USP is set high
 */
#define EMAC_CH1_RPBL    0x0000003FU
#define EMAC_CH1_RPBL_M  (EMAC_CH1_RPBL_V << EMAC_CH1_RPBL_S)
#define EMAC_CH1_RPBL_V  0x0000003FU
#define EMAC_CH1_RPBL_S  17
/** EMAC_CH1_USP : R/W; bitpos: [23]; default: 0;
 *  Use Separate PBL When set high, this bit configures the Rx DMA to use the value
 *  configured in Bits [22:17] as PBL The PBL value in Bits [13:8] is applicable only
 *  to the Tx DMA operations When reset to low, the PBL value in Bits [13:8] is
 *  applicable for both DMA engines
 */
#define EMAC_CH1_USP    (BIT(23))
#define EMAC_CH1_USP_M  (EMAC_CH1_USP_V << EMAC_CH1_USP_S)
#define EMAC_CH1_USP_V  0x00000001U
#define EMAC_CH1_USP_S  23
/** EMAC_CH1_PBLX8 : R/W; bitpos: [24]; default: 0;
 *  PBLx8 Mode When set high, this bit multiplies the programmed PBL value _Bits
 *  [22:17] and Bits[13:8]_ eight times Therefore, the DMA transfers the data in 8, 16,
 *  32, 64, 128, and 256 beats depending on the PBL value Note: This bit function is
 *  not backward compatible Before release 350a, this bit was 4xPBL
 */
#define EMAC_CH1_PBLX8    (BIT(24))
#define EMAC_CH1_PBLX8_M  (EMAC_CH1_PBLX8_V << EMAC_CH1_PBLX8_S)
#define EMAC_CH1_PBLX8_V  0x00000001U
#define EMAC_CH1_PBLX8_S  24
/** EMAC_CH1_AAL : R/W; bitpos: [25]; default: 0;
 *  AddressAligned Beats When this bit is set high and the FB bit is equal to 1, the
 *  AHB or AXI interface generates all bursts aligned to the start address LS bits If
 *  the FB bit is equal to 0, the first burst _accessing the start address of data
 *  buffer_ is not aligned, but subsequent bursts are aligned to the address This bit
 *  is valid only in the EMACAHB and EMACAXI configurations and is reserved _RO with
 *  default value 0_ in all other configurations
 */
#define EMAC_CH1_AAL    (BIT(25))
#define EMAC_CH1_AAL_M  (EMAC_CH1_AAL_V << EMAC_CH1_AAL_S)
#define EMAC_CH1_AAL_V  0x00000001U
#define EMAC_CH1_AAL_S  25
/** EMAC_CH1_MB : R/W; bitpos: [26]; default: 0;
 *  Mixed Burst When this bit is set high and the FB bit is low, the AHB master
 *  interface starts all bursts of length more than 16 with INCR _undefined burst_,
 *  whereas it reverts to fixed burst transfers _INCRx and SINGLE_ for burst length of
 *  16 and less This bit is valid only in the EMACAHB configuration and reserved in all
 *  other configuration
 */
#define EMAC_CH1_MB    (BIT(26))
#define EMAC_CH1_MB_M  (EMAC_CH1_MB_V << EMAC_CH1_MB_S)
#define EMAC_CH1_MB_V  0x00000001U
#define EMAC_CH1_MB_S  26
/** EMAC_CH1_TXPR : R/W; bitpos: [27]; default: 0;
 *  Transmit Priority When set, this bit indicates that the transmit DMA has higher
 *  priority than the receive DMA during arbitration for the systemside bus In the
 *  EMACAXI configuration, this bit is reserved and readonly _RO_ For more information
 *  about the priority scheme between the transmit and receive paths, see Table 412 in
 *  “DMA Arbiter Functions” on page 167
 */
#define EMAC_CH1_TXPR    (BIT(27))
#define EMAC_CH1_TXPR_M  (EMAC_CH1_TXPR_V << EMAC_CH1_TXPR_S)
#define EMAC_CH1_TXPR_V  0x00000001U
#define EMAC_CH1_TXPR_S  27
/** EMAC_CH1_PRWG : R/W; bitpos: [29:28]; default: 0;
 *  Channel Priority Weights This field sets the priority weights for Channel 1 during
 *  the roundrobin arbitration between the DMA channels for the system bus 00: The
 *  priority weight is 1 01: The priority weight is 2 10: The priority weight is 3 11:
 *  The priority weight is 4 This field is present in all DWC_EMAC configurations
 *  except EMACAXI when you select the AV feature Otherwise, this field is reserved and
 *  readonly _RO_ For more information about the priority weights of DMA channels, see
 *  “DMA Arbiter Functions” on page 167
 */
#define EMAC_CH1_PRWG    0x00000003U
#define EMAC_CH1_PRWG_M  (EMAC_CH1_PRWG_V << EMAC_CH1_PRWG_S)
#define EMAC_CH1_PRWG_V  0x00000003U
#define EMAC_CH1_PRWG_S  28
/** EMAC_CH1_RIB : R/W; bitpos: [31]; default: 0;
 *  Rebuild INCRx Burst When this bit is set high and the AHB master gets an EBT
 *  _Retry, Split, or Losing bus grant_, the AHB master interface rebuilds the pending
 *  beats of any burst transfer initiated with INCRx The AHB master interface rebuilds
 *  the beats with a combination of specified bursts with INCRx and SINGLE By default,
 *  the AHB master interface rebuilds pending beats of an EBT with an unspecified
 *  _INCR_ burst This bit is valid only in the EMACAHB configuration It is reserved in
 *  all other configuration
 */
#define EMAC_CH1_RIB    (BIT(31))
#define EMAC_CH1_RIB_M  (EMAC_CH1_RIB_V << EMAC_CH1_RIB_S)
#define EMAC_CH1_RIB_V  0x00000001U
#define EMAC_CH1_RIB_S  31

