espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_CHANNEL1OPERATIONMODE_REG register
 *  Establishes the Receive and Transmit operating modes and command
 */
#define EMAC_CHANNEL1OPERATIONMODE_REG (DR_REG_EMAC_BASE + 0x1118)
/** EMAC_CH1_SR : R/W; bitpos: [1]; default: 0;
 *  Start or Stop Receive When this bit is set, the Receive process is placed in the
 *  Running state The DMA attempts to acquire the descriptor from the Receive list and
 *  processes the incoming frames The descriptor acquisition is attempted from the
 *  current position in the list, which is the address set by the Register 3 _Receive
 *  Descriptor List Address Register_ or the position retained when the Receive process
 *  was previously stopped If the DMA does not own the descriptor, reception is
 *  suspended and Bit 7 _Receive Buffer Unavailable_ of Register 5 _Status Register_ is
 *  set The Start Receive command is effective only when the reception has stopped If
 *  the command is issued before setting Register 3 _Receive Descriptor List Address
 *  Register_, the DMA behavior is unpredictable When this bit is cleared, the Rx DMA
 *  operation is stopped after the transfer of the current frame The next descriptor
 *  position in the Receive list is saved and becomes the current position after the
 *  Receive process is restarted The Stop Receive command is effective only when the
 *  Receive process is in either the Running _waiting for receive packet_ or in the
 *  Suspended state Note: For information about how to pause the transmission, see
 *  “Stopping and Starting Transmission” on page 715
 */
#define EMAC_CH1_SR    (BIT(1))
#define EMAC_CH1_SR_M  (EMAC_CH1_SR_V << EMAC_CH1_SR_S)
#define EMAC_CH1_SR_V  0x00000001U
#define EMAC_CH1_SR_S  1
/** EMAC_CH1_OSF : R/W; bitpos: [2]; default: 0;
 *  Operate on Second Frame When this bit is set, it instructs the DMA to process the
 *  second frame of the Transmit data even before the status for the first frame is
 *  obtained
 */
#define EMAC_CH1_OSF    (BIT(2))
#define EMAC_CH1_OSF_M  (EMAC_CH1_OSF_V << EMAC_CH1_OSF_S)
#define EMAC_CH1_OSF_V  0x00000001U
#define EMAC_CH1_OSF_S  2
/** EMAC_CH1_RTC : R/W; bitpos: [4:3]; default: 0;
 *  Receive Threshold Control These two bits control the threshold level of the MTL
 *  Receive FIFO Transfer _request_ to DMA starts when the frame size within the MTL
 *  Receive FIFO is larger than the threshold In addition, full frames with length less
 *  than the threshold are automatically transferred The value of 11 is not applicable
 *  if the configured Receive FIFO size is 128 bytes These bits are valid only when the
 *  RSF bit is zero, and are ignored when the RSF bit is set to 1 00: 64 01: 32 10: 96
 *  11: 128
 */
#define EMAC_CH1_RTC    0x00000003U
#define EMAC_CH1_RTC_M  (EMAC_CH1_RTC_V << EMAC_CH1_RTC_S)
#define EMAC_CH1_RTC_V  0x00000003U
#define EMAC_CH1_RTC_S  3
/** EMAC_CH1_DGF : R/W; bitpos: [5]; default: 0;
 *  Drop Giant Frames When set, the MAC drops the received giant frames in the Rx FIFO,
 *  that is, frames that are larger than the computed giant frame limit When reset, the
 *  MAC does not drop the giant frames in the Rx FIFO Note: This bit is available in
 *  the following configurations in which the giant frame status is not provided in Rx
 *  status and giant frames are not dropped by default: Configurations in which IP
 *  Checksum Offload _Type 1_ is selected in Rx Configurations in which the IPC Full
 *  Checksum Offload Engine _Type 2_ is selected in Rx with normal descriptor format
 *  Configurations in which the Advanced Timestamp feature is selected In all other
 *  configurations, this bit is not used _reserved and always reset_
 */
#define EMAC_CH1_DGF    (BIT(5))
#define EMAC_CH1_DGF_M  (EMAC_CH1_DGF_V << EMAC_CH1_DGF_S)
#define EMAC_CH1_DGF_V  0x00000001U
#define EMAC_CH1_DGF_S  5
/** EMAC_CH1_FUF : R/W; bitpos: [6]; default: 0;
 *  Forward Undersized Good Frames When set, the Rx FIFO forwards Undersized frames
 *  _that is, frames with no Error and length less than 64 bytes_ including padbytes
 *  and CRC When reset, the Rx FIFO drops all frames of less than 64 bytes, unless a
 *  frame is already transferred because of the lower value of Receive Threshold, for
 *  example, RTC = 01
 */
#define EMAC_CH1_FUF    (BIT(6))
#define EMAC_CH1_FUF_M  (EMAC_CH1_FUF_V << EMAC_CH1_FUF_S)
#define EMAC_CH1_FUF_V  0x00000001U
#define EMAC_CH1_FUF_S  6
/** EMAC_CH1_FEF : R/W; bitpos: [7]; default: 0;
 *  Forward Error Frames When this bit is reset, the Rx FIFO drops frames with error
 *  status _CRC error, collision error, GMII_ER, giant frame, watchdog timeout, or
 *  overflow_ However, if the start byte _write_ pointer of a frame is already
 *  transferred to the read controller side _in Threshold mode_, then the frame is not
 *  dropped In the EMACMTL configuration in which the Frame Length FIFO is also enabled
 *  during core configuration, the Rx FIFO drops the error frames if that frame's start
 *  byte is not transferred _output_ on the ARI bus When the FEF bit is set, all frames
 *  except runt error frames are forwarded to the DMA If the Bit 25 _RSF_ is set and
 *  the Rx FIFO overflows when a partial frame is written, then the frame is dropped
 *  irrespective of the FEF bit setting However, if the Bit 25 _RSF_ is reset and the
 *  Rx FIFO overflows when a partial frame is written, then a partial frame may be
 *  forwarded to the DMA Note: When FEF bit is reset, the giant frames are dropped if
 *  the giant frame status is given in Rx Status _in Table 86 or Table 823_ in the
 *  following configurations: The IP checksum engine _Type 1_ and full checksum offload
 *  engine _Type 2_ are not selected The advanced timestamp feature is not selected but
 *  the extended status is selected The extended status is available with the following
 *  features: 	L3L4 filter in EMACCORE or EMACMTL configurations 	Full checksum offload
 *  engine _Type 2_ with enhanced descriptor format in the EMACDMA, EMACAHB, or EMACAXI
 *  configurations
 */
#define EMAC_CH1_FEF    (BIT(7))
#define EMAC_CH1_FEF_M  (EMAC_CH1_FEF_V << EMAC_CH1_FEF_S)
#define EMAC_CH1_FEF_V  0x00000001U
#define EMAC_CH1_FEF_S  7
/** EMAC_CH1_EFC : R/W; bitpos: [8]; default: 0;
 *  Enable HW Flow Control When this bit is set, the flow control signal operation
 *  based on the filllevel of Rx FIFO is enabled When reset, the flow control operation
 *  is disabled This bit is not used _reserved and always reset_ when the Rx FIFO is
 *  less than 4 KB
 */
#define EMAC_CH1_EFC    (BIT(8))
#define EMAC_CH1_EFC_M  (EMAC_CH1_EFC_V << EMAC_CH1_EFC_S)
#define EMAC_CH1_EFC_V  0x00000001U
#define EMAC_CH1_EFC_S  8
/** EMAC_CH1_RFA : R/W; bitpos: [10:9]; default: 0;
 *  Threshold for Activating Flow Control _in halfduplex and fullduplex modes_ These
 *  bits control the threshold _Fill level of Rx FIFO_ at which the flow control is
 *  activated 00: Full minus 1 KB, that is, FULL—1KB 01: Full minus 2 KB, that is,
 *  FULL—2KB 10: Full minus 3 KB, that is, FULL—3KB 11: Full minus 4 KB, that is,
 *  FULL—4KB These values are applicable only to Rx FIFOs of 4 KB or more and when Bit
 *  8 _EFC_ is set high If the Rx FIFO is 8 KB or more, an additional Bit _RFA_2_ is
 *  used for more threshold levels as described in Bit 23 These bits are reserved and
 *  readonly when the depth of Rx FIFO is less than 4 KB Note: When FIFO size is
 *  exactly 4 KB, although the DWC_EMAC allows you to program the value of these bits
 *  to 11, the software should not program these bits to 2'b11 The value 2'b11 means
 *  flow control on FIFO empty condition
 */
#define EMAC_CH1_RFA    0x00000003U
#define EMAC_CH1_RFA_M  (EMAC_CH1_RFA_V << EMAC_CH1_RFA_S)
#define EMAC_CH1_RFA_V  0x00000003U
#define EMAC_CH1_RFA_S  9
/** EMAC_CH1_RFD : R/W; bitpos: [12:11]; default: 0;
 *  Threshold for Deactivating Flow Control _in halfduplex and fullduplex modes_ These
 *  bits control the threshold _Filllevel of Rx FIFO_ at which the flow control is
 *  deasserted after activation 00: Full minus 1 KB, that is, FULL — 1 KB 01: Full
 *  minus 2 KB, that is, FULL — 2 KB 10: Full minus 3 KB, that is, FULL — 3 KB 11: Full
 *  minus 4 KB, that is, FULL — 4 KB The deassertion is effective only after flow
 *  control is asserted If the Rx FIFO is 8 KB or more, an additional Bit _RFD_2_ is
 *  used for more threshold levels as described in Bit 22 These bits are reserved and
 *  readonly when the Rx FIFO depth is less than 4 KB Note: For proper flow control,
 *  the value programmed in the “RFD_2, RFD” fields should be equal to or more than the
 *  value programmed in the “RFA_2, RFA” fields
 */
#define EMAC_CH1_RFD    0x00000003U
#define EMAC_CH1_RFD_M  (EMAC_CH1_RFD_V << EMAC_CH1_RFD_S)
#define EMAC_CH1_RFD_V  0x00000003U
#define EMAC_CH1_RFD_S  11
/** EMAC_CH1_ST : R/W; bitpos: [13]; default: 0;
 *  Start or Stop Transmission Command When this bit is set, transmission is placed in
 *  the Running state, and the DMA checks the Transmit List at the current position for
 *  a frame to be transmitted Descriptor acquisition is attempted either from the
 *  current position in the list, which is the Transmit List Base Address set by
 *  Register 4 _Transmit Descriptor List Address Register_, or from the position
 *  retained when transmission was stopped previously If the DMA does not own the
 *  current descriptor, transmission enters the Suspended state and Bit 2 _Transmit
 *  Buffer Unavailable_ of Register 5 _Status Register_ is set The Start Transmission
 *  command is effective only when transmission is stopped If the command is issued
 *  before setting Register 4 _Transmit Descriptor List Address Register_, then the DMA
 *  behavior is unpredictable When this bit is reset, the transmission process is
 *  placed in the Stopped state after completing the transmission of the current frame
 *  The Next Descriptor position in the Transmit List is saved, and it becomes the
 *  current position when transmission is restarted To change the list address, you
 *  need to program Register 4 _Transmit Descriptor List Address Register_ with a new
 *  value when this bit is reset The new value is considered when this bit is set again
 *  The stop transmission command is effective only when the transmission of the
 *  current frame is complete or the transmission is in the Suspended state Note: For
 *  information about how to pause the transmission, see “Stopping and Starting
 *  Transmission” on page 715
 */
#define EMAC_CH1_ST    (BIT(13))
#define EMAC_CH1_ST_M  (EMAC_CH1_ST_V << EMAC_CH1_ST_S)
#define EMAC_CH1_ST_V  0x00000001U
#define EMAC_CH1_ST_S  13
/** EMAC_CH1_TTC : R/W; bitpos: [16:14]; default: 0;
 *  Transmit Threshold Control These bits control the threshold level of the MTL
 *  Transmit FIFO Transmission starts when the frame size within the MTL Transmit FIFO
 *  is larger than the threshold In addition, full frames with a length less than the
 *  threshold are also transmitted These bits are used only when Bit 21 _TSF_ is reset
 *  000: 64 001: 128 010: 192 011: 256 100: 40 101: 32 110: 24 111: 16
 */
#define EMAC_CH1_TTC    0x00000007U
#define EMAC_CH1_TTC_M  (EMAC_CH1_TTC_V << EMAC_CH1_TTC_S)
#define EMAC_CH1_TTC_V  0x00000007U
#define EMAC_CH1_TTC_S  14
/** EMAC_CH1_FTF : R/W1S; bitpos: [20]; default: 0;
 *  Flush Transmit FIFO When this bit is set, the transmit FIFO controller logic is
 *  reset to its default values and thus all data in the Tx FIFO is lost or flushed
 *  This bit is cleared internally when the flushing operation is complete The
 *  Operation Mode register should not be written to until this bit is cleared The data
 *  which is already accepted by the MAC transmitter is not flushed It is scheduled for
 *  transmission and results in underflow and runt frame transmission Note: The flush
 *  operation is complete only when the Tx FIFO is emptied of its contents and all the
 *  pending Transmit Status of the transmitted frames are accepted by the host In order
 *  to complete this flush operation, the PHY transmit clock _clk_tx_i_ is required to
 *  be active 19:17		Reserved 	000	RO
 */
#define EMAC_CH1_FTF    (BIT(20))
#define EMAC_CH1_FTF_M  (EMAC_CH1_FTF_V << EMAC_CH1_FTF_S)
#define EMAC_CH1_FTF_V  0x00000001U
#define EMAC_CH1_FTF_S  20
/** EMAC_CH1_TSF : R/W; bitpos: [21]; default: 0;
 *  Transmit Store and Forward When this bit is set, transmission starts when a full
 *  frame resides in the MTL Transmit FIFO When this bit is set, the TTC values
 *  specified in Bits [16:14] are ignored This bit should be changed only when the
 *  transmission is stopped
 */
#define EMAC_CH1_TSF    (BIT(21))
#define EMAC_CH1_TSF_M  (EMAC_CH1_TSF_V << EMAC_CH1_TSF_S)
#define EMAC_CH1_TSF_V  0x00000001U
#define EMAC_CH1_TSF_S  21
/** EMAC_CH1_RFD_2 : R/W; bitpos: [22]; default: 0;
 *  MSB of Threshold for Deactivating Flow Control If the DWC_EMAC is configured for Rx
 *  FIFO size of 8 KB or more, this bit _when set_ provides additional threshold levels
 *  for deactivating the flow control in both halfduplex and fullduplex modes This bit
 *  _as Most Significant Bit_ along with the RFD _Bits [12:11]_ gives the following
 *  thresholds for deactivating flow control: 100: Full minus 5 KB, that is, FULL — 5
 *  KB 101: Full minus 6 KB, that is, FULL — 6 KB 110: Full minus 7 KB, that is, FULL —
 *  7 KB 111: Reserved This bit is reserved _and RO_ if the Rx FIFO is 4 KB or less deep
 */
#define EMAC_CH1_RFD_2    (BIT(22))
#define EMAC_CH1_RFD_2_M  (EMAC_CH1_RFD_2_V << EMAC_CH1_RFD_2_S)
#define EMAC_CH1_RFD_2_V  0x00000001U
#define EMAC_CH1_RFD_2_S  22
/** EMAC_CH1_RFA_2 : R/W; bitpos: [23]; default: 0;
 *  MSB of Threshold for Activating Flow Control If the DWC_EMAC is configured for an
 *  Rx FIFO size of 8 KB or more, this bit _when set_ provides additional threshold
 *  levels for activating the flow control in both half duplex and fullduplex modes
 *  This bit _as Most Significant Bit_, along with the RFA _Bits [10:9]_, gives the
 *  following thresholds for activating flow control: 100: Full minus 5 KB, that is,
 *  FULL — 5 KB 101: Full minus 6 KB, that is, FULL — 6 KB 110: Full minus 7 KB, that
 *  is, FULL — 7 KB 111: Reserved This bit is reserved _and RO_ if the Rx FIFO is 4 KB
 *  or less deep
 */
#define EMAC_CH1_RFA_2    (BIT(23))
#define EMAC_CH1_RFA_2_M  (EMAC_CH1_RFA_2_V << EMAC_CH1_RFA_2_S)
#define EMAC_CH1_RFA_2_V  0x00000001U
#define EMAC_CH1_RFA_2_S  23
/** EMAC_CH1_DFF : R/W; bitpos: [24]; default: 0;
 *  Disable Flushing of Received Frames When this bit is set, the Rx DMA does not flush
 *  any frames because of the unavailability of receive descriptors or buffers as it
 *  does normally when this bit is reset _See “Receive Process Suspended” on page 83_
 *  This bit is reserved _and RO_ in the EMACMTL configuration
 */
#define EMAC_CH1_DFF    (BIT(24))
#define EMAC_CH1_DFF_M  (EMAC_CH1_DFF_V << EMAC_CH1_DFF_S)
#define EMAC_CH1_DFF_V  0x00000001U
#define EMAC_CH1_DFF_S  24
/** EMAC_CH1_RSF : R/W; bitpos: [25]; default: 0;
 *  Receive Store and Forward When this bit is set, the MTL reads a frame from the Rx
 *  FIFO only after the complete frame has been written to it, ignoring the RTC bits
 *  When this bit is reset, the Rx FIFO operates in the cutthrough mode, subject to the
 *  threshold specified by the RTC bits
 */
#define EMAC_CH1_RSF    (BIT(25))
#define EMAC_CH1_RSF_M  (EMAC_CH1_RSF_V << EMAC_CH1_RSF_S)
#define EMAC_CH1_RSF_V  0x00000001U
#define EMAC_CH1_RSF_S  25
/** EMAC_CH1_DT : R/W; bitpos: [26]; default: 0;
 *  Disable Dropping of TCP/IP Checksum Error Frames When this bit is set, the MAC does
 *  not drop the frames which only have errors detected by the Receive Checksum Offload
 *  engine Such frames do not have any errors _including FCS error_ in the Ethernet
 *  frame received by the MAC but have errors only in the encapsulated payload When
 *  this bit is reset, all error frames are dropped if the FEF bit is reset If the IPC
 *  Full Checksum Offload Engine _Type 2_ is disabled, this bit is reserved _RO with
 *  value 1'b0_
 */
#define EMAC_CH1_DT    (BIT(26))
#define EMAC_CH1_DT_M  (EMAC_CH1_DT_V << EMAC_CH1_DT_S)
#define EMAC_CH1_DT_V  0x00000001U
#define EMAC_CH1_DT_S  26

/** EMAC_CHANNEL1INTERRUPTENABLE_REG register
 *  Enables the interrupts reported by the Status Register
 */
#define EMAC_CHANNEL1INTERRUPTENABLE_REG (DR_REG_EMAC_BASE + 0x111c)
/** EMAC_CH1_TIE : R/W; bitpos: [0]; default: 0;
 *  Transmit Interrupt Enable When this bit is set with Normal Interrupt Summary Enable
 *  _Bit 16_, the Transmit Interrupt is enabled When this bit is reset, the Transmit
 *  Interrupt is disabled The sbd_intr_o interrupt is generated as shown in Figure 61
 *  It is asserted only when the TTI, GPI, GMI, GLI, or GLPII bit of the DMA Status
 *  register is asserted, or when the NIS or AIS Status bit is asserted and the
 *  corresponding Interrupt Enable bits _NIE or AIE_ are enabled
 */
#define EMAC_CH1_TIE    (BIT(0))
#define EMAC_CH1_TIE_M  (EMAC_CH1_TIE_V << EMAC_CH1_TIE_S)
#define EMAC_CH1_TIE_V  0x00000001U
#define EMAC_CH1_TIE_S  0
/** EMAC_CH1_TSE : R/W; bitpos: [1]; default: 0;
 *  Transmit Stopped Enable When this bit is set with Abnormal Interrupt Summary Enable
 *  _Bit 15_, the Transmission Stopped Interrupt is enabled When this bit is reset, the
 *  Transmission Stopped Interrupt is disabled
 */
#define EMAC_CH1_TSE    (BIT(1))
#define EMAC_CH1_TSE_M  (EMAC_CH1_TSE_V << EMAC_CH1_TSE_S)
#define EMAC_CH1_TSE_V  0x00000001U
#define EMAC_CH1_TSE_S  1
/** EMAC_CH1_TUE : R/W; bitpos: [2]; default: 0;
 *  Transmit Buffer Unavailable Enable When this bit is set with Normal Interrupt
 *  Summary Enable _Bit 16_, the Transmit Buffer Unavailable Interrupt is enabled When
 *  this bit is reset, the Transmit Buffer Unavailable Interrupt is disabled
 */
#define EMAC_CH1_TUE    (BIT(2))
#define EMAC_CH1_TUE_M  (EMAC_CH1_TUE_V << EMAC_CH1_TUE_S)
#define EMAC_CH1_TUE_V  0x00000001U
#define EMAC_CH1_TUE_S  2
/** EMAC_CH1_TJE : R/W; bitpos: [3]; default: 0;
 *  Transmit Jabber Timeout Enable When this bit is set with Abnormal Interrupt Summary
 *  Enable _Bit 15_, the Transmit Jabber Timeout Interrupt is enabled When this bit is
 *  reset, the Transmit Jabber Timeout Interrupt is disabled
 */
#define EMAC_CH1_TJE    (BIT(3))
#define EMAC_CH1_TJE_M  (EMAC_CH1_TJE_V << EMAC_CH1_TJE_S)
#define EMAC_CH1_TJE_V  0x00000001U
#define EMAC_CH1_TJE_S  3
/** EMAC_CH1_OVE : R/W; bitpos: [4]; default: 0;
 *  Overflow Interrupt Enable When this bit is set with Abnormal Interrupt Summary
 *  Enable _Bit 15_, the Receive Overflow Interrupt is enabled When this bit is reset,
 *  the Overflow Interrupt is disabled
 */
#define EMAC_CH1_OVE    (BIT(4))
#define EMAC_CH1_OVE_M  (EMAC_CH1_OVE_V << EMAC_CH1_OVE_S)
#define EMAC_CH1_OVE_V  0x00000001U
#define EMAC_CH1_OVE_S  4
/** EMAC_CH1_UNE : R/W; bitpos: [5]; default: 0;
 *  Underflow Interrupt Enable When this bit is set with Abnormal Interrupt Summary
 *  Enable _Bit 15_, the Transmit Underflow Interrupt is enabled When this bit is
 *  reset, the Underflow Interrupt is disabled
 */
#define EMAC_CH1_UNE    (BIT(5))
#define EMAC_CH1_UNE_M  (EMAC_CH1_UNE_V << EMAC_CH1_UNE_S)
#define EMAC_CH1_UNE_V  0x00000001U
#define EMAC_CH1_UNE_S  5
/** EMAC_CH1_RIE : R/W; bitpos: [6]; default: 0;
 *  Receive Interrupt Enable When this bit is set with Normal Interrupt Summary Enable
 *  _Bit 16_, the Receive Interrupt is enabled When this bit is reset, the Receive
 *  Interrupt is disabled
 */
#define EMAC_CH1_RIE    (BIT(6))
#define EMAC_CH1_RIE_M  (EMAC_CH1_RIE_V << EMAC_CH1_RIE_S)
#define EMAC_CH1_RIE_V  0x00000001U
#define EMAC_CH1_RIE_S  6
/** EMAC_CH1_RUE : R/W; bitpos: [7]; default: 0;
 *  Receive Buffer Unavailable Enable When this bit is set with Abnormal Interrupt
 *  Summary Enable _Bit 15_, the Receive Buffer Unavailable Interrupt is enabled When
 *  this bit is reset, the Receive Buffer Unavailable Interrupt is disabled
 */
#define EMAC_CH1_RUE    (BIT(7))
#define EMAC_CH1_RUE_M  (EMAC_CH1_RUE_V << EMAC_CH1_RUE_S)
#define EMAC_CH1_RUE_V  0x00000001U
#define EMAC_CH1_RUE_S  7
/** EMAC_CH1_RSE : R/W; bitpos: [8]; default: 0;
 *  Receive Stopped Enable When this bit is set with Abnormal Interrupt Summary Enable
 *  _Bit 15_, the Receive Stopped Interrupt is enabled When this bit is reset, the
 *  Receive Stopped Interrupt is disabled
 */
#define EMAC_CH1_RSE    (BIT(8))
#define EMAC_CH1_RSE_M  (EMAC_CH1_RSE_V << EMAC_CH1_RSE_S)
#define EMAC_CH1_RSE_V  0x00000001U
#define EMAC_CH1_RSE_S  8
/** EMAC_CH1_RWE : R/W; bitpos: [9]; default: 0;
 *  Receive Watchdog Timeout Enable When this bit is set with Abnormal Interrupt
 *  Summary Enable _Bit 15_, the Receive Watchdog Timeout Interrupt is enabled When
 *  this bit is reset, the Receive Watchdog Timeout Interrupt is disabled
 */
#define EMAC_CH1_RWE    (BIT(9))
#define EMAC_CH1_RWE_M  (EMAC_CH1_RWE_V << EMAC_CH1_RWE_S)
#define EMAC_CH1_RWE_V  0x00000001U
#define EMAC_CH1_RWE_S  9
/** EMAC_CH1_ETE : R/W; bitpos: [10]; default: 0;
 *  Early Transmit Interrupt Enable When this bit is set with an Abnormal Interrupt
 *  Summary Enable _Bit 15_, the Early Transmit Interrupt is enabled When this bit is
 *  reset, the Early Transmit Interrupt is disabled
 */
#define EMAC_CH1_ETE    (BIT(10))
#define EMAC_CH1_ETE_M  (EMAC_CH1_ETE_V << EMAC_CH1_ETE_S)
#define EMAC_CH1_ETE_V  0x00000001U
#define EMAC_CH1_ETE_S  10
/** EMAC_CH1_FBE : R/W; bitpos: [13]; default: 0;
 *  Fatal Bus Error Enable When this bit is set with Abnormal Interrupt Summary Enable
 *  _Bit 15_, the Fatal Bus Error Interrupt is enabled When this bit is reset, the
 *  Fatal Bus Error Enable Interrupt is disabled 12:11		Reserved	00	RO
 */
#define EMAC_CH1_FBE    (BIT(13))
#define EMAC_CH1_FBE_M  (EMAC_CH1_FBE_V << EMAC_CH1_FBE_S)
#define EMAC_CH1_FBE_V  0x00000001U
#define EMAC_CH1_FBE_S  13
/** EMAC_CH1_ERE : R/W; bitpos: [14]; default: 0;
 *  Early Receive Interrupt Enable When this bit is set with Normal Interrupt Summary
 *  Enable _Bit 16_, the Early Receive Interrupt is enabled When this bit is reset, the
 *  Early Receive Interrupt is disabled
 */
#define EMAC_CH1_ERE    (BIT(14))
#define EMAC_CH1_ERE_M  (EMAC_CH1_ERE_V << EMAC_CH1_ERE_S)
#define EMAC_CH1_ERE_V  0x00000001U
#define EMAC_CH1_ERE_S  14
/** EMAC_CH1_AIE : R/W; bitpos: [15]; default: 0;
 *  Abnormal Interrupt Summary Enable When this bit is set, abnormal interrupt summary
 *  is enabled When this bit is reset, the abnormal interrupt summary is disabled This
 *  bit enables the following interrupts in Register 5 _Status Register_: Register
 *  5[1]: Transmit Process Stopped Register 5[3]: Transmit Jabber Timeout Register
 *  5[4]: Receive Overflow Register 5[5]: Transmit Underflow Register 5[7]: Receive
 *  Buffer Unavailable Register 5[8]: Receive Process Stopped Register 5[9]: Receive
 *  Watchdog Timeout Register 5[10]: Early Transmit Interrupt Register 5[13]: Fatal Bus
 *  Error
 */
#define EMAC_CH1_AIE    (BIT(15))
#define EMAC_CH1_AIE_M  (EMAC_CH1_AIE_V << EMAC_CH1_AIE_S)
#define EMAC_CH1_AIE_V  0x00000001U
#define EMAC_CH1_AIE_S  15
/** EMAC_CH1_NIE : R/W; bitpos: [16]; default: 0;
 *  Normal Interrupt Summary Enable When this bit is set, normal interrupt summary is
 *  enabled When this bit is reset, normal interrupt summary is disabled This bit
 *  enables the following interrupts in Register 5 _Status Register_: Register 5[0]:
 *  Transmit Interrupt Register 5[2]: Transmit Buffer Unavailable Register 5[6]:
 *  Receive Interrupt Register 5[14]: Early Receive Interrupt
 */
#define EMAC_CH1_NIE    (BIT(16))
#define EMAC_CH1_NIE_M  (EMAC_CH1_NIE_V << EMAC_CH1_NIE_S)
#define EMAC_CH1_NIE_V  0x00000001U
#define EMAC_CH1_NIE_S  16

