espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_CHANNEL1MISSEDFRAMEANDBUFFEROVERFLOWCOUNTER_REG register
 *  Contains the counters for discarded frames because no host Receive Descriptor was
 *  available, and discarded frames because of Receive FIFO Overflow
 */
#define EMAC_CHANNEL1MISSEDFRAMEANDBUFFEROVERFLOWCOUNTER_REG (DR_REG_EMAC_BASE + 0x1120)
/** EMAC_CH1_MISFRMCNT : R/W; bitpos: [15:0]; default: 0;
 *  Missed Frame Counter This field indicates the number of frames missed by the
 *  controller because of the Host Receive Buffer being unavailable This counter is
 *  incremented each time the DMA discards an incoming frame The counter is cleared
 *  when this register is read with mci_be_i[0] at 1’b1
 */
#define EMAC_CH1_MISFRMCNT    0x0000FFFFU
#define EMAC_CH1_MISFRMCNT_M  (EMAC_CH1_MISFRMCNT_V << EMAC_CH1_MISFRMCNT_S)
#define EMAC_CH1_MISFRMCNT_V  0x0000FFFFU
#define EMAC_CH1_MISFRMCNT_S  0
/** EMAC_CH1_MISCNTOVF : R/W; bitpos: [16]; default: 0;
 *  Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame
 *  Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because
 *  of the Host Receive Buffer being unavailable with the missed frame counter at
 *  maximum value In such a scenario, the Missed frame counter is reset to allzeros and
 *  this bit indicates that the rollover happened
 */
#define EMAC_CH1_MISCNTOVF    (BIT(16))
#define EMAC_CH1_MISCNTOVF_M  (EMAC_CH1_MISCNTOVF_V << EMAC_CH1_MISCNTOVF_S)
#define EMAC_CH1_MISCNTOVF_V  0x00000001U
#define EMAC_CH1_MISCNTOVF_S  16
/** EMAC_CH1_OVFFRMCNT : R/W; bitpos: [27:17]; default: 0;
 *  Overflow Frame Counter This field indicates the number of frames missed by the
 *  application This counter is incremented each time the MTL FIFO overflows The
 *  counter is cleared when this register is read with mci_be_i[2] at 1’b1
 */
#define EMAC_CH1_OVFFRMCNT    0x000007FFU
#define EMAC_CH1_OVFFRMCNT_M  (EMAC_CH1_OVFFRMCNT_V << EMAC_CH1_OVFFRMCNT_S)
#define EMAC_CH1_OVFFRMCNT_V  0x000007FFU
#define EMAC_CH1_OVFFRMCNT_S  17
/** EMAC_CH1_OVFCNTOVF : R/W; bitpos: [28]; default: 0;
 *  Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow
 *  Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the
 *  overflow frame counter at maximum value In such a scenario, the overflow frame
 *  counter is reset to allzeros and this bit indicates that the rollover happened
 */
#define EMAC_CH1_OVFCNTOVF    (BIT(28))
#define EMAC_CH1_OVFCNTOVF_M  (EMAC_CH1_OVFCNTOVF_V << EMAC_CH1_OVFCNTOVF_S)
#define EMAC_CH1_OVFCNTOVF_V  0x00000001U
#define EMAC_CH1_OVFCNTOVF_S  28

/** EMAC_CHANNEL1RECEIVEINTERRUPTWATCHDOGTIMER_REG register
 *  Watchdog timeout for Receive Interrupt _RI_ from DMA
 */
#define EMAC_CHANNEL1RECEIVEINTERRUPTWATCHDOGTIMER_REG (DR_REG_EMAC_BASE + 0x1124)
/** EMAC_CH1_RIWT : R/W; bitpos: [7:0]; default: 0;
 *  RI Watchdog Timer Count This bit indicates the number of system clock cycles
 *  multiplied by 256 for which the watchdog timer is set The watchdog timer gets
 *  triggered with the programmed value after the Rx DMA completes the transfer of a
 *  frame for which the RI status bit is not set because of the setting in the
 *  corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is
 *  set and the timer is stopped The watchdog timer is reset when the RI bit is set
 *  high because of automatic setting of RI as per RDES1[31] of any received frame
 */
#define EMAC_CH1_RIWT    0x000000FFU
#define EMAC_CH1_RIWT_M  (EMAC_CH1_RIWT_V << EMAC_CH1_RIWT_S)
#define EMAC_CH1_RIWT_V  0x000000FFU
#define EMAC_CH1_RIWT_S  0

/** EMAC_CHANNEL1SLOTFUNCTIONCONTROLANDSTATUS_REG register
 *  Contains the control bits for slot function and its status for Channel 1 transmit
 *  path
 */
#define EMAC_CHANNEL1SLOTFUNCTIONCONTROLANDSTATUS_REG (DR_REG_EMAC_BASE + 0x1130)
/** EMAC_ESC : R/W; bitpos: [0]; default: 0;
 *  Enable Slot Comparison When set, this bit enables the checking of the slot numbers,
 *  programmed in the transmit descriptor, with the current reference given in Bits
 *  [19:16] The DMA fetches the data from the corresponding buffer only when the slot
 *  number is equal to the reference slot number or is ahead of the reference slot
 *  number by one slot When reset, this bit disables the checking of the slot numbers
 *  The DMA fetches the data immediately after the descriptor is processed
 */
#define EMAC_ESC    (BIT(0))
#define EMAC_ESC_M  (EMAC_ESC_V << EMAC_ESC_S)
#define EMAC_ESC_V  0x00000001U
#define EMAC_ESC_S  0
/** EMAC_ASC : R/W; bitpos: [1]; default: 0;
 *  Advance Slot Check When set, this bit enables the DMA to fetch the data from the
 *  buffer when the slot number _SLOTNUM_ programmed in the transmit descriptor is:
 *  equal to the reference slot number given in Bits [19:16] or ahead of the reference
 *  slot number by up to two slots This bit is applicable only when Bit 0 _ESC_ is set
 */
#define EMAC_ASC    (BIT(1))
#define EMAC_ASC_M  (EMAC_ASC_V << EMAC_ASC_S)
#define EMAC_ASC_V  0x00000001U
#define EMAC_ASC_S  1
/** EMAC_RSN : RO; bitpos: [19:16]; default: 0;
 *  Reference Slot Number This field gives the current value of the reference slot
 *  number in DMA used for comparison checking
 */
#define EMAC_RSN    0x0000000FU
#define EMAC_RSN_M  (EMAC_RSN_V << EMAC_RSN_S)
#define EMAC_RSN_V  0x0000000FU
#define EMAC_RSN_S  16

/** EMAC_CHANNEL1CURRENTHOSTTRANSMITDESCRIPTOR_REG register
 *  Points to the start of current Transmit Descriptor read by the DMA
 */
#define EMAC_CHANNEL1CURRENTHOSTTRANSMITDESCRIPTOR_REG (DR_REG_EMAC_BASE + 0x1148)
/** EMAC_CH1_CURTDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Descriptor Address Pointer
 */
#define EMAC_CH1_CURTDESAPTR    0xFFFFFFFFU
#define EMAC_CH1_CURTDESAPTR_M  (EMAC_CH1_CURTDESAPTR_V << EMAC_CH1_CURTDESAPTR_S)
#define EMAC_CH1_CURTDESAPTR_V  0xFFFFFFFFU
#define EMAC_CH1_CURTDESAPTR_S  0

/** EMAC_CHANNEL1CURRENTHOSTRECEIVEDESCRIPTOR_REG register
 *  Points to the start of current Receive Descriptor read by the DMA
 */
#define EMAC_CHANNEL1CURRENTHOSTRECEIVEDESCRIPTOR_REG (DR_REG_EMAC_BASE + 0x114c)
/** EMAC_CH1_CURRDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Descriptor Address Pointer
 */
#define EMAC_CH1_CURRDESAPTR    0xFFFFFFFFU
#define EMAC_CH1_CURRDESAPTR_M  (EMAC_CH1_CURRDESAPTR_V << EMAC_CH1_CURRDESAPTR_S)
#define EMAC_CH1_CURRDESAPTR_V  0xFFFFFFFFU
#define EMAC_CH1_CURRDESAPTR_S  0

/** EMAC_CHANNEL1CURRENTHOSTTRANSMITBUFFERADDRESS_REG register
 *  Points to the current Transmit Buffer address read by the DMA
 */
#define EMAC_CHANNEL1CURRENTHOSTTRANSMITBUFFERADDRESS_REG (DR_REG_EMAC_BASE + 0x1150)
/** EMAC_CH1_CURTBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Buffer Address Pointer
 */
#define EMAC_CH1_CURTBUFAPTR    0xFFFFFFFFU
#define EMAC_CH1_CURTBUFAPTR_M  (EMAC_CH1_CURTBUFAPTR_V << EMAC_CH1_CURTBUFAPTR_S)
#define EMAC_CH1_CURTBUFAPTR_V  0xFFFFFFFFU
#define EMAC_CH1_CURTBUFAPTR_S  0

/** EMAC_CHANNEL1CURRENTHOSTRECEIVEBUFFERADDRESS_REG register
 *  Points to the current Receive Buffer address read by the DMA
 */
#define EMAC_CHANNEL1CURRENTHOSTRECEIVEBUFFERADDRESS_REG (DR_REG_EMAC_BASE + 0x1154)
/** EMAC_CH1_CURRBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Buffer Address Pointer
 */
#define EMAC_CH1_CURRBUFAPTR    0xFFFFFFFFU
#define EMAC_CH1_CURRBUFAPTR_M  (EMAC_CH1_CURRBUFAPTR_V << EMAC_CH1_CURRBUFAPTR_S)
#define EMAC_CH1_CURRBUFAPTR_V  0xFFFFFFFFU
#define EMAC_CH1_CURRBUFAPTR_S  0

