espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_CHANNEL1CBSCONTROL_REG register
 *  Controls the Channel 1 credit shaping operation on the transmit path
 */
#define EMAC_CHANNEL1CBSCONTROL_REG (DR_REG_EMAC_BASE + 0x1160)
/** EMAC_CH1_CBSD : R/W; bitpos: [0]; default: 0;
 *  CreditBased Shaper Disable When set, the MAC disables the creditbased shaper
 *  algorithm for Channel 1 traffic and makes the traffic management algorithm to
 *  strict priority for Channel 1 over Channel 0 When reset, the creditbased shaper
 *  algorithm schedules the traffic in Channel 1 for transmission
 */
#define EMAC_CH1_CBSD    (BIT(0))
#define EMAC_CH1_CBSD_M  (EMAC_CH1_CBSD_V << EMAC_CH1_CBSD_S)
#define EMAC_CH1_CBSD_V  0x00000001U
#define EMAC_CH1_CBSD_S  0
/** EMAC_CH1_CC : R/W; bitpos: [1]; default: 0;
 *  Credit Control When reset, the accumulated credit parameter in the creditbased
 *  shaper algorithm logic is set to zero when there is positive credit and no frame to
 *  transmit in Channel 1 When there is no frame waiting in Channel 1 and other channel
 *  is transmitting, no credit is accumulated When set, the accumulated credit
 *  parameter in the creditbased shaper algorithm logic is not reset to zero when there
 *  is positive credit and no frame to transmit in Channel 1 The credit accumulates
 *  even when there is no frame waiting in Channel 1 and another channel is transmitting
 */
#define EMAC_CH1_CC    (BIT(1))
#define EMAC_CH1_CC_M  (EMAC_CH1_CC_V << EMAC_CH1_CC_S)
#define EMAC_CH1_CC_V  0x00000001U
#define EMAC_CH1_CC_S  1
/** EMAC_CH1_SLC : R/W; bitpos: [6:4]; default: 0;
 *  Slot Count The software can program the number of slots _of duration 125 microsec_
 *  over which the average transmitted bits per slot _provided in the CBS Status
 *  register_ need to be computed for Channel 1 when the creditbased shaper algorithm
 *  is enabled The encoding is as follows: 3'b000: 1 Slot 3'b001: 2 Slots 3'b010: 4
 *  Slots 3'b011: 8 Slots 3'b100: 16 Slots 3'b1013'b111: Reserved
 */
#define EMAC_CH1_SLC    0x00000007U
#define EMAC_CH1_SLC_M  (EMAC_CH1_SLC_V << EMAC_CH1_SLC_S)
#define EMAC_CH1_SLC_V  0x00000007U
#define EMAC_CH1_SLC_S  4
/** EMAC_CH1_ABPSSIE : R/W; bitpos: [17]; default: 0;
 *  Average Bits Per Slot Interrupt Enable When this bit is set, the MAC asserts an
 *  interrupt _sbd_intr_o or mci_intr_o_ when the average bits per slot status is
 *  updated _Bit 17 _ABSU_ in Register 89_ for Channel 1 When this bit is cleared,
 *  interrupt is not asserted for such an event
 */
#define EMAC_CH1_ABPSSIE    (BIT(17))
#define EMAC_CH1_ABPSSIE_M  (EMAC_CH1_ABPSSIE_V << EMAC_CH1_ABPSSIE_S)
#define EMAC_CH1_ABPSSIE_V  0x00000001U
#define EMAC_CH1_ABPSSIE_S  17

/** EMAC_CHANNEL1CBSSTATUS_REG register
 *  Provides the average traffic transmitted in Channel 1
 */
#define EMAC_CHANNEL1CBSSTATUS_REG (DR_REG_EMAC_BASE + 0x1164)
/** EMAC_CH1_ABS : RO; bitpos: [16:0]; default: 0;
 *  Average Bits per Slot This field contains the average transmitted bits per slot
 *  This field is computed over programmed number of slots _SLC bits in the CBS Control
 *  Register_ for Channel 1 traffic The maximum value is 0x30D4 for 100 Mbps and
 *  0x1E848 for 1000 Mbps
 */
#define EMAC_CH1_ABS    0x0001FFFFU
#define EMAC_CH1_ABS_M  (EMAC_CH1_ABS_V << EMAC_CH1_ABS_S)
#define EMAC_CH1_ABS_V  0x0001FFFFU
#define EMAC_CH1_ABS_S  0
/** EMAC_CH1_ABSU : RO; bitpos: [17]; default: 0;
 *  ABS Updated When set, this bit indicates that the MAC has updated the ABS value
 *  This bit is cleared when the application reads the ABS value
 */
#define EMAC_CH1_ABSU    (BIT(17))
#define EMAC_CH1_ABSU_M  (EMAC_CH1_ABSU_V << EMAC_CH1_ABSU_S)
#define EMAC_CH1_ABSU_V  0x00000001U
#define EMAC_CH1_ABSU_S  17

/** EMAC_CHANNEL1IDLESLOPECREDIT_REG register
 *  Contains the idleSlope credit value required for the creditbased shaper algorithm
 *  for Channel 1
 */
#define EMAC_CHANNEL1IDLESLOPECREDIT_REG (DR_REG_EMAC_BASE + 0x1168)
/** EMAC_CH1_ISC : R/W; bitpos: [13:0]; default: 0;
 *  idleSlopeCredit This field contains the idleSlopeCredit value required for the
 *  creditbased shaper algorithm for Channel 1 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is increasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode
 */
#define EMAC_CH1_ISC    0x00003FFFU
#define EMAC_CH1_ISC_M  (EMAC_CH1_ISC_V << EMAC_CH1_ISC_S)
#define EMAC_CH1_ISC_V  0x00003FFFU
#define EMAC_CH1_ISC_S  0

/** EMAC_CHANNEL1SENDSLOPECREDIT_REG register
 *  Contains the sendSlope credit value required for the creditbased shaper algorithm
 *  for Channel 1
 */
#define EMAC_CHANNEL1SENDSLOPECREDIT_REG (DR_REG_EMAC_BASE + 0x116c)
/** EMAC_CH1_SSC : R/W; bitpos: [13:0]; default: 0;
 *  sendSlopeCredit This field contains the sendSlopeCredit value required for
 *  creditbased shaper algorithm for Channel 1 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is decreasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode This field should be
 *  programmed with absolute sendSlopeCredit value The creditbased shaper logic
 *  subtracts it from the accumulated credit when Channel 1 is selected for transmission
 */
#define EMAC_CH1_SSC    0x00003FFFU
#define EMAC_CH1_SSC_M  (EMAC_CH1_SSC_V << EMAC_CH1_SSC_S)
#define EMAC_CH1_SSC_V  0x00003FFFU
#define EMAC_CH1_SSC_S  0

/** EMAC_CHANNEL1HICREDIT_REG register
 *  Contains the hiCredit value required for the creditbased shaper algorithm for
 *  Channel 1
 */
#define EMAC_CHANNEL1HICREDIT_REG (DR_REG_EMAC_BASE + 0x1170)
/** EMAC_CH1_HC : R/W; bitpos: [28:0]; default: 0;
 *  hiCredit This field contains the hiCredit value required for the creditbased shaper
 *  algorithm for Channel 1 This is the maximum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000
 */
#define EMAC_CH1_HC    0x1FFFFFFFU
#define EMAC_CH1_HC_M  (EMAC_CH1_HC_V << EMAC_CH1_HC_S)
#define EMAC_CH1_HC_V  0x1FFFFFFFU
#define EMAC_CH1_HC_S  0

/** EMAC_CHANNEL1LOCREDIT_REG register
 *  Contains the loCredit value required for the creditbased shaper algorithm for
 *  Channel 1
 */
#define EMAC_CHANNEL1LOCREDIT_REG (DR_REG_EMAC_BASE + 0x1174)
/** EMAC_CH1_LC : R/W; bitpos: [28:0]; default: 536870911;
 *  loCredit This field contains the loCredit value required for the creditbased shaper
 *  algorithm for Channel 1 This is the minimum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000 The programmed value is 2's complement _negative number_, that is,
 *  0xF800_0000
 */
#define EMAC_CH1_LC    0x1FFFFFFFU
#define EMAC_CH1_LC_M  (EMAC_CH1_LC_V << EMAC_CH1_LC_S)
#define EMAC_CH1_LC_V  0x1FFFFFFFU
#define EMAC_CH1_LC_S  0

/** EMAC_CHANNEL2BUSMODE_REG register
 *  Controls the Host Interface mode for Channel 2
 */
#define EMAC_CHANNEL2BUSMODE_REG (DR_REG_EMAC_BASE + 0x1200)
/** EMAC_CH2_SWR : R/W; bitpos: [0]; default: 1;
 *  Software Reset When this bit is set, the MAC DMA Controller resets the logic and
 *  all internal registers of the MAC It is cleared automatically after the reset
 *  operation is complete in all of the DWC_EMAC clock domains Before reprogramming any
 *  register of the DWC_EMAC, you should read a zero _0_ value in this bit Note: The
 *  Software reset function is driven only by this bit Bit 0 of Register 64 _Channel 1
 *  Bus Mode Register_ or Register 128 _Channel 2 Bus Mode Register_ has no impact on
 *  the Software reset function The reset operation is completed only when all resets
 *  in all active clock domains are deasserted Therefore, it is essential that all PHY
 *  inputs clocks _applicable for the selected PHY interface_ are present for the
 *  software reset completion The time to complete the software reset operation depends
 *  on the frequency of the slowest active clock
 */
#define EMAC_CH2_SWR    (BIT(0))
#define EMAC_CH2_SWR_M  (EMAC_CH2_SWR_V << EMAC_CH2_SWR_S)
#define EMAC_CH2_SWR_V  0x00000001U
#define EMAC_CH2_SWR_S  0
/** EMAC_CH2_DA : R/W; bitpos: [1]; default: 0;
 *  DMA Arbitration Scheme This bit specifies the arbitration scheme between the
 *  transmit and receive paths of Channel 2 0: Weighted roundrobin with Rx:Tx or Tx:Rx
 *  The priority between the paths is according to the priority specified in Bits
 *  [15:14] _PR_ and priority weights specified in Bit 27 _TXPR_ 1: Fixed priority The
 *  transmit path has priority over receive path when Bit 27 _TXPR_ is set Otherwise,
 *  receive path has priority over the transmit path In the EMACAXI configuration,
 *  these bits are reserved and are readonly _RO_ For more information about the
 *  priority scheme between the transmit and receive paths, see Table 412 in “DMA
 *  Arbiter Functions” on page 167
 */
#define EMAC_CH2_DA    (BIT(1))
#define EMAC_CH2_DA_M  (EMAC_CH2_DA_V << EMAC_CH2_DA_S)
#define EMAC_CH2_DA_V  0x00000001U
#define EMAC_CH2_DA_S  1
/** EMAC_CH2_DSL : R/W; bitpos: [6:2]; default: 0;
 *  Descriptor Skip Length This bit specifies the number of Word, Dword, or Lword
 *  _depending on the 32bit, 64bit, or 128bit bus_ to skip between two unchained
 *  descriptors The address skipping starts from the end of current descriptor to the
 *  start of next descriptor When the DSL value is equal to zero, the descriptor table
 *  is taken as contiguous by the DMA in Ring mode
 */
#define EMAC_CH2_DSL    0x0000001FU
#define EMAC_CH2_DSL_M  (EMAC_CH2_DSL_V << EMAC_CH2_DSL_S)
#define EMAC_CH2_DSL_V  0x0000001FU
#define EMAC_CH2_DSL_S  2
/** EMAC_CH2_ATDS : R/W; bitpos: [7]; default: 0;
 *  Alternate Descriptor Size When set, the size of the alternate descriptor _described
 *  in “Alternate or Enhanced Descriptors” on page 545_ increases to 32 bytes _8
 *  DWORDS_ This is required when the Advanced Timestamp feature or the IPC Full
 *  Checksum Offload Engine _Type 2_ is enabled in the receiver The enhanced descriptor
 *  is not required if the Advanced Timestamp and IPC Full Checksum Offload Engine
 *  _Type 2_ features are not enabled In such case, you can use the 16 bytes descriptor
 *  to save 4 bytes of memory This bit is present only when you select the Alternate
 *  Descriptor feature and any one of the following features during core configuration:
 *  Advanced Timestamp feature IPC Full Checksum Offload Engine _Type 2_ feature
 *  Otherwise, this bit is reserved and is readonly When reset, the descriptor size
 *  reverts back to 4 DWORDs _16 bytes_ This bit preserves the backward compatibility
 *  for the descriptor size In versions prior to 350a, the descriptor size is 16 bytes
 *  for both normal and enhanced descriptors In version 350a, descriptor size is
 *  increased to 32 bytes because of the Advanced Timestamp and IPC Full Checksum
 *  Offload Engine _Type 2_ features
 */
#define EMAC_CH2_ATDS    (BIT(7))
#define EMAC_CH2_ATDS_M  (EMAC_CH2_ATDS_V << EMAC_CH2_ATDS_S)
#define EMAC_CH2_ATDS_V  0x00000001U
#define EMAC_CH2_ATDS_S  7
/** EMAC_CH2_PBL : R/W; bitpos: [13:8]; default: 1;
 *  Programmable Burst Length These bits indicate the maximum number of beats to be
 *  transferred in one DMA transaction This is the maximum value that is used in a
 *  single block Read or Write The DMA always attempts to burst as specified in PBL
 *  each time it starts a Burst transfer on the host bus PBL can be programmed with
 *  permissible values of 1, 2, 4, 8, 16, and 32 Any other value results in undefined
 *  behavior When USP is set high, this PBL value is applicable only for Tx DMA
 *  transactions If the number of beats to be transferred is more than 32, then perform
 *  the following steps: 1 Set the PBLx8 mode 2 Set the PBL For example, if the maximum
 *  number of beats to be transferred is 64, then first set PBLx8 to 1 and then set PBL
 *  to 8 The PBL values have the following limitation: The maximum number of possible
 *  beats _PBL_ is limited by the size of the Tx FIFO and Rx FIFO in the MTL layer and
 *  the data bus width on the DMA The FIFO has a constraint that the maximum beat
 *  supported is half the depth of the FIFO, except when specified For different data
 *  bus widths and FIFO sizes, the valid PBL range _including x8 mode_ is provided in
 *  Table 66 on page 382
 */
#define EMAC_CH2_PBL    0x0000003FU
#define EMAC_CH2_PBL_M  (EMAC_CH2_PBL_V << EMAC_CH2_PBL_S)
#define EMAC_CH2_PBL_V  0x0000003FU
#define EMAC_CH2_PBL_S  8
/** EMAC_CH2_PR : R/W; bitpos: [15:14]; default: 0;
 *  Priority Ratio These bits control the priority ratio in the weighted roundrobin
 *  arbitration between the Rx DMA and Tx DMA These bits are valid only when Bit 1 _DA_
 *  is reset The priority ratio is Rx:Tx or Tx:Rx depending on whether Bit 27 _TXPR_ is
 *  reset or set 00: The Priority Ratio is 1:1 01: The Priority Ratio is 2:1 10: The
 *  Priority Ratio is 3:1 11: The Priority Ratio is 4:1 In the EMACAXI configuration,
 *  these bits are reserved and readonly _RO_ For more information about the priority
 *  scheme between the transmit and receive paths, see Table 412 in “DMA Arbiter
 *  Functions” on page 167
 */
#define EMAC_CH2_PR    0x00000003U
#define EMAC_CH2_PR_M  (EMAC_CH2_PR_V << EMAC_CH2_PR_S)
#define EMAC_CH2_PR_V  0x00000003U
#define EMAC_CH2_PR_S  14
/** EMAC_CH2_FB : R/W; bitpos: [16]; default: 0;
 *  Fixed Burst This bit controls whether the AHB or AXI master interface performs
 *  fixed burst transfers or not When set, the AHB interface uses only SINGLE, INCR4,
 *  INCR8, or INCR16 during start of the normal burst transfers When reset, the AHB or
 *  AXI interface uses SINGLE and INCR burst transfer operations For more information,
 *  see Bit 0 _UNDEF_ of the AXI Bus Mode register in the EMACAXI configuration
 */
#define EMAC_CH2_FB    (BIT(16))
#define EMAC_CH2_FB_M  (EMAC_CH2_FB_V << EMAC_CH2_FB_S)
#define EMAC_CH2_FB_V  0x00000001U
#define EMAC_CH2_FB_S  16
/** EMAC_CH2_RPBL : R/W; bitpos: [22:17]; default: 1;
 *  Rx DMA PBL This field indicates the maximum number of beats to be transferred in
 *  one Rx DMA transaction This is the maximum value that is used in a single block
 *  Read or Write The Rx DMA always attempts to burst as specified in the RPBL bit each
 *  time it starts a Burst transfer on the host bus You can program RPBL with values of
 *  1, 2, 4, 8, 16, and 32 Any other value results in undefined behavior This field is
 *  valid and applicable only when USP is set high
 */
#define EMAC_CH2_RPBL    0x0000003FU
#define EMAC_CH2_RPBL_M  (EMAC_CH2_RPBL_V << EMAC_CH2_RPBL_S)
#define EMAC_CH2_RPBL_V  0x0000003FU
#define EMAC_CH2_RPBL_S  17
/** EMAC_CH2_USP : R/W; bitpos: [23]; default: 0;
 *  Use Separate PBL When set high, this bit configures the Rx DMA to use the value
 *  configured in Bits [22:17] as PBL The PBL value in Bits [13:8] is applicable only
 *  to the Tx DMA operations When reset to low, the PBL value in Bits [13:8] is
 *  applicable for both DMA engines
 */
#define EMAC_CH2_USP    (BIT(23))
#define EMAC_CH2_USP_M  (EMAC_CH2_USP_V << EMAC_CH2_USP_S)
#define EMAC_CH2_USP_V  0x00000001U
#define EMAC_CH2_USP_S  23
/** EMAC_CH2_PBLX8 : R/W; bitpos: [24]; default: 0;
 *  PBLx8 Mode When set high, this bit multiplies the programmed PBL value _Bits
 *  [22:17] and Bits[13:8]_ eight times Therefore, the DMA transfers the data in 8, 16,
 *  32, 64, 128, and 256 beats depending on the PBL value Note: This bit function is
 *  not backward compatible Before release 350a, this bit was 4xPBL
 */
#define EMAC_CH2_PBLX8    (BIT(24))
#define EMAC_CH2_PBLX8_M  (EMAC_CH2_PBLX8_V << EMAC_CH2_PBLX8_S)
#define EMAC_CH2_PBLX8_V  0x00000001U
#define EMAC_CH2_PBLX8_S  24
/** EMAC_CH2_AAL : R/W; bitpos: [25]; default: 0;
 *  AddressAligned Beats When this bit is set high and the FB bit is equal to 1, the
 *  AHB or AXI interface generates all bursts aligned to the start address LS bits If
 *  the FB bit is equal to 0, the first burst _accessing the start address of data
 *  buffer_ is not aligned, but subsequent bursts are aligned to the address This bit
 *  is valid only in the EMACAHB and EMACAXI configurations and is reserved _RO with
 *  default value 0_ in all other configurations
 */
#define EMAC_CH2_AAL    (BIT(25))
#define EMAC_CH2_AAL_M  (EMAC_CH2_AAL_V << EMAC_CH2_AAL_S)
#define EMAC_CH2_AAL_V  0x00000001U
#define EMAC_CH2_AAL_S  25
/** EMAC_CH2_MB : R/W; bitpos: [26]; default: 0;
 *  Mixed Burst When this bit is set high and the FB bit is low, the AHB master
 *  interface starts all bursts of length more than 16 with INCR _undefined burst_,
 *  whereas it reverts to fixed burst transfers _INCRx and SINGLE_ for burst length of
 *  16 and less This bit is valid only in the EMACAHB configuration and reserved in all
 *  other configuration
 */
#define EMAC_CH2_MB    (BIT(26))
#define EMAC_CH2_MB_M  (EMAC_CH2_MB_V << EMAC_CH2_MB_S)
#define EMAC_CH2_MB_V  0x00000001U
#define EMAC_CH2_MB_S  26
/** EMAC_CH2_TXPR : R/W; bitpos: [27]; default: 0;
 *  Transmit Priority When set, this bit indicates that the transmit DMA has higher
 *  priority than the receive DMA during arbitration for the systemside bus In the
 *  EMACAXI configuration, this bit is reserved and readonly _RO_ For more information
 *  about the priority scheme between the transmit and receive paths, see Table 412 in
 *  “DMA Arbiter Functions” on page 167
 */
#define EMAC_CH2_TXPR    (BIT(27))
#define EMAC_CH2_TXPR_M  (EMAC_CH2_TXPR_V << EMAC_CH2_TXPR_S)
#define EMAC_CH2_TXPR_V  0x00000001U
#define EMAC_CH2_TXPR_S  27
/** EMAC_CH2_PRWG : R/W; bitpos: [29:28]; default: 0;
 *  Channel Priority Weights This field sets the priority weights for Channel 2 during
 *  the roundrobin arbitration between the DMA channels for the system bus 00: The
 *  priority weight is 1 01: The priority weight is 2 10: The priority weight is 3 11:
 *  The priority weight is 4 This field is present in all DWC_EMAC configurations
 *  except EMACAXI when you select the AV feature Otherwise, this field is reserved and
 *  readonly _RO_ For more information about the priority weights of DMA channels, see
 *  “DMA Arbiter Functions” on page 167
 */
#define EMAC_CH2_PRWG    0x00000003U
#define EMAC_CH2_PRWG_M  (EMAC_CH2_PRWG_V << EMAC_CH2_PRWG_S)
#define EMAC_CH2_PRWG_V  0x00000003U
#define EMAC_CH2_PRWG_S  28
/** EMAC_CH2_RIB : R/W; bitpos: [31]; default: 0;
 *  Rebuild INCRx Burst When this bit is set high and the AHB master gets an EBT
 *  _Retry, Split, or Losing bus grant_, the AHB master interface rebuilds the pending
 *  beats of any burst transfer initiated with INCRx The AHB master interface rebuilds
 *  the beats with a combination of specified bursts with INCRx and SINGLE By default,
 *  the AHB master interface rebuilds pending beats of an EBT with an unspecified
 *  _INCR_ burst This bit is valid only in the EMACAHB configuration It is reserved in
 *  all other configuration
 */
#define EMAC_CH2_RIB    (BIT(31))
#define EMAC_CH2_RIB_M  (EMAC_CH2_RIB_V << EMAC_CH2_RIB_S)
#define EMAC_CH2_RIB_V  0x00000001U
#define EMAC_CH2_RIB_S  31

/** EMAC_CHANNEL2TRANSMITPOLLDEMAND_REG register
 *  Used by the host to instruct the DMA to poll the Transmit Descriptor list
 */
#define EMAC_CHANNEL2TRANSMITPOLLDEMAND_REG (DR_REG_EMAC_BASE + 0x1204)
/** EMAC_CH2_TPD : RO; bitpos: [31:0]; default: 0;
 *  Transmit Poll Demand When these bits are written with any value, the DMA reads the
 *  current descriptor to which the Register 18 _Current Host Transmit Descriptor
 *  Register_ is pointing If that descriptor is not available _owned by the Host_, the
 *  transmission returns to the Suspend state and Bit 2 _TU_ of Register 5 _Status
 *  Register_ is asserted If the descriptor is available, the transmission resumes
 */
#define EMAC_CH2_TPD    0xFFFFFFFFU
#define EMAC_CH2_TPD_M  (EMAC_CH2_TPD_V << EMAC_CH2_TPD_S)
#define EMAC_CH2_TPD_V  0xFFFFFFFFU
#define EMAC_CH2_TPD_S  0

/** EMAC_CHANNEL2RECEIVEPOLLDEMAND_REG register
 *  Used by the Host to instruct the DMA to poll the Receive Descriptor list
 */
#define EMAC_CHANNEL2RECEIVEPOLLDEMAND_REG (DR_REG_EMAC_BASE + 0x1208)
/** EMAC_CH2_RPD : RO; bitpos: [31:0]; default: 0;
 *  Receive Poll Demand When these bits are written with any value, the DMA reads the
 *  current descriptor to which the Register 19 _Current Host Receive Descriptor
 *  Register_ is pointing If that descriptor is not available _owned by the Host_, the
 *  reception returns to the Suspended state and Bit 7 _RU_ of Register 5 _Status
 *  Register_ is asserted If the descriptor is available, the Rx DMA returns to the
 *  active state
 */
#define EMAC_CH2_RPD    0xFFFFFFFFU
#define EMAC_CH2_RPD_M  (EMAC_CH2_RPD_V << EMAC_CH2_RPD_S)
#define EMAC_CH2_RPD_V  0xFFFFFFFFU
#define EMAC_CH2_RPD_S  0

/** EMAC_CHANNEL2RECEIVEDESCRIPTORLISTADDRESS_REG register
 *  Points the DMA to the start of the Receive Descriptor list
 */
#define EMAC_CHANNEL2RECEIVEDESCRIPTORLISTADDRESS_REG (DR_REG_EMAC_BASE + 0x120c)
/** EMAC_CH2_RDESLA : R/W; bitpos: [31:0]; default: 0;
 *  Start of Receive List This field contains the base address of the first descriptor
 *  in the Receive Descriptor list The LSB bits _1:0, 2:0, or 3:0_ for 32bit, 64bit, or
 *  128bit bus width are ignored and internally taken as allzero by the DMA Therefore,
 *  these LSB bits are readonly _RO_
 */
#define EMAC_CH2_RDESLA    0xFFFFFFFFU
#define EMAC_CH2_RDESLA_M  (EMAC_CH2_RDESLA_V << EMAC_CH2_RDESLA_S)
#define EMAC_CH2_RDESLA_V  0xFFFFFFFFU
#define EMAC_CH2_RDESLA_S  0

/** EMAC_CHANNEL2TRANSMITDESCRIPTORLISTADDRESS_REG register
 *  Points the DMA to the start of the Transmit Descriptor List
 */
#define EMAC_CHANNEL2TRANSMITDESCRIPTORLISTADDRESS_REG (DR_REG_EMAC_BASE + 0x1210)
/** EMAC_CH2_TDESLA : R/W; bitpos: [31:0]; default: 0;
 *  Start of Transmit List This field contains the base address of the first descriptor
 *  in the Transmit Descriptor list The LSB bits _1:0, 2:0, 3:0_ for 32bit, 64bit, or
 *  128bit bus width are ignored and are internally taken as allzero by the DMA
 *  Therefore, these LSB bits are readonly _RO_
 */
#define EMAC_CH2_TDESLA    0xFFFFFFFFU
#define EMAC_CH2_TDESLA_M  (EMAC_CH2_TDESLA_V << EMAC_CH2_TDESLA_S)
#define EMAC_CH2_TDESLA_V  0xFFFFFFFFU
#define EMAC_CH2_TDESLA_S  0

