espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/emac_reg.h
/** EMAC_CHANNEL2HICREDIT_REG register
 *  Contains the hiCredit value required for the creditbased shaper algorithm for
 *  Channel 2
 */
#define EMAC_CHANNEL2HICREDIT_REG (DR_REG_EMAC_BASE + 0x1270)
/** EMAC_CH2_HC : R/W; bitpos: [28:0]; default: 0;
 *  hiCredit This field contains the hiCredit value required for the creditbased shaper
 *  algorithm for Channel 2 This is the maximum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000
 */
#define EMAC_CH2_HC    0x1FFFFFFFU
#define EMAC_CH2_HC_M  (EMAC_CH2_HC_V << EMAC_CH2_HC_S)
#define EMAC_CH2_HC_V  0x1FFFFFFFU
#define EMAC_CH2_HC_S  0

/** EMAC_CHANNEL2LOCREDIT_REG register
 *  Contains the loCredit value required for the creditbased shaper algorithm for
 *  Channel 2
 */
#define EMAC_CHANNEL2LOCREDIT_REG (DR_REG_EMAC_BASE + 0x1274)
/** EMAC_CH2_LC : R/W; bitpos: [28:0]; default: 536870911;
 *  loCredit This field contains the loCredit value required for the creditbased shaper
 *  algorithm for Channel 2 This is the minimum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000 The programmed value is 2's complement _negative number_, that is,
 *  0xF800_0000
 */
#define EMAC_CH2_LC    0x1FFFFFFFU
#define EMAC_CH2_LC_M  (EMAC_CH2_LC_V << EMAC_CH2_LC_S)
#define EMAC_CH2_LC_V  0x1FFFFFFFU
#define EMAC_CH2_LC_S  0

#ifdef __cplusplus
}
#endif
